{"details":{"0":"akhirnya beli produk ini pas banget lagi sale juga di e-commerce. niat beli produk ini emang buat reapply sunscreen through out the day. buat temen temen yang mau pake pastiin jangan pake produk ini sendirian jadi tetep harus pake sunscreen dan bisa di set lagi pake ini. jadi produk ini emang diperuntukan buat reapply sunscreen yang mudah banget sihhh","1":"Sun powder dari N'pure ini bagus bangett, gaboong deh. Teksturnya lembut bgt dan benerbener melindungi kulit dari paparan sinar matahari, jadi kalo males pake sunscreen biasa bisa langsung pake ini yg super praktisss❤️❤️ sukak pwoll pokonya","2":"waw sumpah si ini sunscreen yang bener bener bagus banget, pertama kali nyoba emang langsung cocok di muka aku😍selain itu tekstur nya itu ringan dan cepat meresap di kulit dan juga sekali pake muka aku langsung glowing, beuh pokonya cinta banget sama sunscreen yang ini❤😍","3":"N'PURE Cica Beat The Sun Powder ini bener-bener menjawab kebingunganku kalau harus re-apply sunscreen dengan kondisi wajah bermakeup. Tekstur powdernya halus & nggak menyumbat pori ataupun menimbulkan jerawat. Tanpa whitecast, ringan di kulit dan menyerap minyak.","4":"Suka sama teksturnya powder dan aplikatornya brush. Ada SPF 30nya, membantu perlindungan UVA\/UVB. Recomendded! dan wajib direapply setiap dua jam sekali. Jadi pengen beli lagi kalo ini dah habis hehe. I love it sama NPURE produknya bagus².","5":"Aku agak pemilih kalo urusan sunscreen. Soalnya biasanya sunscreen itu lengket dan bikin ga nyaman. Tapi ini beda. Toner ini ga terlalu lengket, cepet ngeresap, ga bikin berasa pakai dempul juga. Dan yg paling penting ga nyumbat pori dan SPF tinggi. Tubenya juga lucu.","6":"Cocok banget untuk melindungi kulit dari paparan sinar matahari karena mengandung kandungan utama spf terus yang aku suka dia ga geser makeup di wajah jadi aman banget untuk ditimpa diatas makeup, selain itu karena dia bentuk powder bisa bantu matte in makeup yang terlalu dewy \/ oily.","7":"suka banget dengan inovasi sekeren ini. gak perlu lagi buat bingung untuk really sunscreen sekaligus touchup make up. spf nya 30 juga seneng banget. kalau reapply sunscreen bikin tetep stay flawless dan masih bikin cantik. mulifungsi banget, suka banget dah","8":"bagi aku dia bener bener unique because bayangin aja sunscrren sama bedak bisa jadi satu...dan yang lebih bagusnya lagi dia gabikin kukit bruntusan dan pas di apply dia gabikin kulit kita kliatan kayak berminyak gitu. Ooo ya aku saranin nih kalian wajib touch up 2 jam sekali","9":"Sumpah unik banget sunscreenya bentuk bedak gituu dan ada kuasnyaa apalagi spf 30 persenn mantul banget, di apkenya gk ribet dan bisa di apply berulangkali hehehhe kalian semua wajib punya karena praktis banget kaya pake bedak rekomen dan harganya terjangkau prahhhh","10":"pertama kali nyobain dan ternyata cocok di aku, ga bikin kusam padahal warnanya sedikit gelap dari kulitku hehe dan hasilnya matte aku suka bangetttt. trus kemasannya juga praktis cuman harus berkali kali gitu biar kliatan pake bedaknya hehehe","11":"sunscreen ternyaman yg pernahh aku cobainn sii guyss, dengan tekstur yang superrr ringann poll ga susah pokoknya di blend nyaa, sudah bpom no alcohol dan no fragrancee the bestttttttt ✅✅✅😊😊😊😊😊😊😊😊😊❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥💘❤️‍🔥💘💘❤️‍🔥❤️‍🔥❤️‍🔥💘❤️‍🔥❤️‍🔥💘❤️‍🔥💘💘💘💘💘","12":"Pertama kali nyobain sunscreen yang bentuknya powder aku sukaaa ini sih soalnya gampang di bawa kemana mana apa lagi buat reapply sunscreen pas udah makeup .menurut ku ini bneran bagusss jadinya makeup ga geser udah gitu bisa ngontrol minyak jugaaa","13":"Suka banget sama produk ini karena powdernya ringan banget di kulit. Cara pakainya juga mudah, hasil akhirnya di kulitku matte dan lumayan tahan lama. Kuasnya juga bagus, lembut, dan ga mudah rontok. Jadi gampang banget re apply sunscreen","14":"Baru kali ini nyobain sunscreen powder yang ringan membantu menyerap minyak berlebih, meminimalkan tampilan pori-pori,sekaligus mengurangi kilau minyak.Jadi gak perlu hapus makeup lagi jika mau apply sunscreen ❤️❤️❤️","15":"Ini sunscreen paling cocok buat aku yang kulit sensitive, ga lengket, ge bikin berminyak, dan ringan banget di wajah. Seriuss ini aku bakal repeat order ini terus kayanya karna secocok itu sama muka aku😩🤍 love banget sama cica beat te sun🤍🤍🤍","16":"bagus bangethdjdhdjjdjdjjsjdjdhhdhshshshshshshshshshsheheehhehehehdb jsjsjdjejej jejejejejjeje jejejejejejdjjd jejejejejejejejejjejeje jejejejejjeiee jejejejejeje jejejekekekkjejeejjeej nsjejejejejej jejejejejej","17":"powder suncreen pertama yang aku cobaa. sekali coba langsung ketagihan wkwk. soalnya cocok di kulit aku, suka sama teksturnya lembut dan ringan. finish looknya matte tapi tetep natural. luv banget! xx","18":"Akhirnya nemuin sunscreen super simple, garibet buat ngeapply, selain itu tekstur powdernya halus banget, seworth itu, ini bakalan jadi sunscreean andalang aku, thnk u N’pure udah ngeluarin produk Cica beat the sun powder ini, cocok banget di aku yang super mager.","19":"Demi apa sihh produk dr npure satu ini bener² baguss bgt.. buat ngatasin jerawat² aku yg sukaaa lama bgt sembuhnya.. cintaaa bgt sma produk ini..\nRecommended bgt buat kalian nihhhhh... Jerawat bisa bener² kering dalam waktu yg lebih cepat","20":"sukaaa suka sukaa bangett , hasilnya ga whitecast cepet nyerep dan ga buat wajah berminyaak \/lengket smaa sekalii , buat re apply jg okee bangett , harganyaa murah jgg 😍😍😍 superr recomended buat yg cari sunscreen no white cast , ga buat berminyak","21":"Buat kalian yang punya kulit jerawatan merah2 sini banget lah kalian wajib cobain sunscreen satu ini. Dia ga ada bau sma skali teksturnya cukup ringan & ga bikin risih lengket gitu finishnya kalian ga usah takut makeuo rusak pas mo re-aplly sunscreen krena ini gampang bngt di blend & cepat menyerap di kulit 🥰😍","22":"Sukaa bgtt sama sunscreen dari N'PURE cica beat the sun ini. Tekstur nya juga gampang di blend, gampang jugaa meresap dan ga lengket sama sekali.sudah bpom ,aman buat bu sui serta bebas dari bahan bahan berbahayaaa, udah spf 50+++ jugaa lohh😍💖💖💖","23":"Honest review dari aku ini sunscreen termasuk sunscreen yang unik banget karena bentuknya itu powder jadi memudahkan aku untuk re-touch make up, lumayan tahan lama dan tahan minyak, packagingnya juga simple dan mudah dibawa kemana mana","24":"Packaging nya bagus, lucu dan mudah dibawa kemana-mana, jadi ga ribet 😘 Tekturnya cream, ringan, ga bikin whitecast jdi ga ngedempul, gampang ngresap. Hasil akhirnya glowing, cocok untuk semua jenis kulit. Harganya juga affordable, bagus banget produknyaa ❤️❤️","25":"pliss ini sunscreen unik banget, apalagi aplikatornya brush yang memudahkan untuk re-apply dan touch up. hasil akhirnya matte dan lumayan tahan minyak, sesuai klaimnya aku re-apply setiap 2 jam sekali walaupun langsung aku timpa dia ga bikin wajah kusam.","26":"BAGUS BGT!!akhirnya bisa kebeli juga ini sunscreen😭 ngerasa beruntusan ilang dan glowing aja pake inituh bukan yang minyakan, cocok bgt buat kulit wajah aku yang normal to dry. Kaget pas beres ngeapply si cica beat sun ini, trs lanjut tone up cream, yang biasanya tone upnya susah diblend numpuk putih gitu skrg gampang bgt blendnya jadi rata putih glowing berkat si sunscreen ini😭❤ suka bgttttt","27":"suka banget pake sunscreen dari npure cica beat the sun krna bagus banget terlihat kerutan bekurang dan tambah cerah wajah setelah rutin pakai produk ini .. ga bikin lengket dan berminyak jg wajah setelah memakai rangkaian skincare lain","28":"sebelum pake yang powder aku pake yang ini dulu. setelah aku pake ga berat dan ga ninggalin whitecast sih. jadi ringan dan cepat menyerap gitu. best combo kalo di paduin sama yang powder. apalagi spf nya gede banget, no worry deh. tinggal apply yang powder","29":"asli sih ini sunscreen ter ga ribet, impressed banget sama npure! makasih puol udah ciptain sunscreen powder ini. bawa kemana-mana praktis juga. bisa re-apply tiap saat. jadi ga perlu worried make-up kenapa-napa ya kan hehe. hasilnya matte finish juga","30":"Ini adalah pertama kalinya gua coba pake product ini dan termyata sesuai ekspetasi. Emng sunscreenya bagus bgt, kulit bener terlindungi dari sinar matahari. Dan skrg ga perlu kawatir lagi klu pergi pergi, tinggal pakai dan ku bawa kemana mana","31":"bagus bget sih ini mana kandungan dan manfaatnya jga bagus BPOM, Halal, Teruji Secara Dermatologis, Bebas SLS, Bebas Paraben, Bebas Minyak Mineral, Bebas Alkohol, Bebas Alergen UE, Bahan Minimal, Bebas Pewangi jadi kalian wajib coba yaaa","32":"Produknya the best banget karna ini powder udah ada spf 30nya jadi mudah untuk reapply berkali kali, teksturnya powdernya juga halus, warnanya natural di muka dan hasilnya matte, packagingnya jg aman bisa di bawa kmna mna😉 aku recomended banget pokoknya ❤️❤️❤️","33":"sun cream nya bagus banget karna SPF 50++++ melindungi kita dari teriknya sinar matahari apalagi di siang siang itu bener bener panas banget dan bisa membuat kulit kusam bisa merah juga kan, setelah pake spf sun cream in bener-bener menjaga kulit kita dari paparan matahari melindungi banget trs bisa meng glowing kan muka kita juga tekstur nya ringan banget di wajah dan nyaman si menurut ku.🤗","34":"kaget banget ternyata sebagus itu. kulitku tuh kombinasi tapi masih aman banget gabikin berminyak cuma glowimg biasa aja terus gabuat kusam. cepet banget nyerepnya, bakal beli lagi ini mah wkwk padhaal harganya gamahal tapi kualitasnya oke banget","35":"Produk nya super bagus, ini selain pigmen di wajah juga ada spf nya 30++ super bagus bukan. Gak perlu repot-repot pakai sunscreen lagi bisa lgs ini 2in1 hihi. Aku suka banget pakai ini kalian wajib coba sih 🥰","36":"bagusss bangett produknya, cocok untuk semua jenis kulit jugaa loh, nggaa lengket dikulitt teksturnya, dan harganyaa juga ramah kantong bgt😝 pokoknyaaaa aku rekomend bangettttt buat kalian beli produk inii skrng jugaaaaa yaaaa😍💗💗💗💗","37":"baru kali ini cocok pakai sunscreen😭 biasanya over oily, tapi ini tuh cepet bgt nyerepnya, no whitecast, trus udah gitu finishnya bener2 bikin kulit makin glowing dong omg😚 skrg jadi sunscreen addict bgt berkat npure cica beat the sun, wajib re-purchase sih iniii❤️","38":"N’PURE CICA BEAT THE SUN sunscreen ☀️ Texturenya super light di kulit, nyaman dipake seharian, ga lengket, ga ninggalin whitecast, bikin muka jadi glowing tapi ga bikin greasy! ❤️ 💚 Dengan SPF 50 PA++++ sebagai UV Filter agent nya, sunscreen ini bakal mem-protect kita dari paparan sinar UV A & UV B💚 Kandungan 100% Natural Cica (Centella Asiatica) Leaf Water yang terdapat didalamnya juga bagus banget untuk menenangkan kulit kita setelah terpapar sinar matahari 💚 Chrysanthemum Extract, Chamomilla Extract, and Camellia Sinensis Leaf Extract didalamnya kaya akan antioksidan & anti-inflammatory, jadi bagus banget untuk kemerahan & meng-hidrasi kulit kita💚 BPOM, Halal, Dermatologically Tested, Bumil Busui Friendly, Free from : Paraben, SLS, Mineral Oil, Alcohol, Silicone, EU Allergen & Fragrance. Recommended 🥰✨","39":"Produk N'PURE emang paling dabest sih. Sunscreennya ini matte finish gitu, cocok banget buat aku yang males touch up dan reapply sunscreen pas lagi di luar rumah, hihi. Kandungannya juga gausah diragukan lagi. Worth to buy! 💚","40":"Sukaaa banget deh sama produk N'PURE yang satu ini Cica Beat the sun Powder ✨ cocok banget buat aku yg mager banget kalo reapply sunscreen tapi semenjak ada produk ini aku gak mager lagi karena gampang banget di reapply nya, dengan tekstur nya yg powder dan praktis banget buat di reapply 😍 wajib banget sih punya produk N'pure yg satu ini 😍 thankyou N'Pure ","41":"suka banget sama sunscreen dari Npure, karena ga bikin kulit jadi berminyak, ga bikin whitecast, selain itu juga non paraben, non alkohol & non fragrance. cocok banget buat kulit sensitif kayak aku~ udah ada spf 50 pa ++++ lagi terbaikkk 🥺✨","42":"Suka bangeeeet sama tekturnyaaa! aman buat wajahku yg sering jerawatan+bruntusan. Gabikin iritasi, ga berat sama sekali, efeknya glowing bund 😆 aman ditimpa sama makeup juga. Pas nge touch up juga enak banget walau diatas makeup tapi bisa menyerap kekulit. Selalu di repurchase 💕","43":"Senang bangettt akhirnya bisa nemuin suncreen yang gampang di apply berkali-kali tanpa harus hapus make-up duluuu, yg aku suka juga warna tekturnya tuh natural jadi cocok juga buat jenis kulit yang sawo matang kaya akuuu thank uuu N’PURE😍","44":"suka banget sama sunscreen ini, awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong, ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan.","45":"suka banget sama sunscreen ini, awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong, ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan.","46":"bener2 recommended banget deh. cocok banget di mukaku spfnya juga tinggi dan ga buat muka aku kering sama ga ada efect putih nya di mukaku dan yang aku suka lagi harganya juga ga mahal deh dengan punya banyak manfaat untuk sunscream. bener2 suka banget deh pokoknya.","47":"ini produk yg wajib dipake. harus punya.... pokoknya suka banget pakai sunscreen N' PURE ini.. bisa buat base makeup juga krna gak lengket di kulit trus cepet meresap.. harganya juga ramah dikantong... recomended deh pokoknya... next mau beli lagi...","48":"Sudah sebulanan ini aku pakai cica beat the sun N'PURE. Teksturnya pas tidak terlalu kental dan tidak lengket, nyaman di kulit.. Meresap cepat dan ada kandungan SPF 50 PA++++ (cukup tinggi) serta di kulitku no whitecast! Namun tips jika kulitmu berminyak, padukan dengan cica beat the sun powder yah!","49":"buat yang punya kulit kering pasti bakal suka sama produk ini, setelah dipake langsung auto glowing glass skin ala2 korea gitu tapi ga terasa lengket \/ greasy sama sekali. dan pastinya bikin kulit terasa lembab seharian. spf nya juga tinggi dan proteksi nya udh lengkap. cocok juga untuk dijadikan base makeup jdi lebih nempel dan mulus","50":"Teksturnya ringan banget dengan hasil matte finish, penolong banget buat wajah aku yg oily ini, ada SPF 30 nya pula😭 dan produknya juga praktis dibawa kemana\" dan bentuknya juga praktis banget gk ribet kalo mau reaply❤","51":"the finish looks good on my combi to dry skin! kalo pake ss emang suka yg glowwy finish dan ini ga bikin gerah sama sekaliii, gampang di blend jugaa dan minim oksidasii, tapi kayaknya oil controlnya kurang, tapi apply 3 kali sehari sekali udah enak banget, bakal repurchase sih!","52":"aaaaaa akhirnya ga worry lagi kalo lagi makeup harus reapply sunscreen, sangat amat membantu aku yang kerjanya makeup tapi ttp terpapar matahari. yang kerennya lagi, selain doi memproteksi kulit dari efek uva uvb, bisa sekalian touch up, makeup jadi matte dan flawless. must try❤️","53":"Aku suka sama sunscreen ini😍 Teksturnya gampang menyerap gak kental dan gak berat. Overall aku cocok, biasanya kalo gak cocok aku akan timbul jerawat, tapi ini gak, aku ngerasa juga wajah aku tetap terasa lembab💕 Terus package nya juga aku suka di ujung buka tutup nya bentuknya kayak plastik bening gitu yang buat jd unik aja. Gak tau pertama kali liat langsung wah lucu hehe🤗💕💕","54":"Ini highly recommended sih. Buat daily enak bgt simple, dipakenya ga ribet mana teksturnya enak bgt ringan😭🤍 Asli muka aku biasanya jam 12an gt udh oily, dipakein ini langsung nge-set lagi kaya baru pake make up🥲🤍","55":"selama pake produk ini , aku ngerasa kulit ku terlindungi ,,, karena jujur kulitku tipe yang suka sakit dan kemerahan disaat kena sinar matahari, dan karena kebanyakan sunscreen bertexture creamy bkin aku susah meratakan creamnya diwajah dan bkin sakit akhirnya aku stop pake, tapi setelah pake N'PURE AKU gak lagi khawatir karena lbh cepat meresap dan cpt bekerja di kulit wajah aku","56":"gilakkk sih produknya bagus bgt udah spf 50 PA+++ selain itu dri packagingnya simple bgt buat di bawa kemana2 kesan pertama pakai langsung memberi efek glowing pada kulitku serta teksturnya ringan bgtt. fix produknya npure emang bagus2 bgt apalagi yang cica beat the sun powder ini kalian harus cobaaaa 👍","57":"Terima kasih bgt buat N'Pure yg sudah bikin produk ini karena reapply sunscreen jadi mudah. Suka bgt sama sunscreen ini & pas buat aku yg suka pake makeup. Finish-nya matte, nggak geser makeup & gampang bgt pakenya.","58":"Nyaman digunain, bikin glowing diwajah gak kering dan adem di kulit. Wajib dipake buat klian yg sering aktifitas di luar ruangan haruuus bgt ini buat perlindungan yaaaaaaaaaaaaa😍😍😍😍😍😍😍😍😍😍😍😍😍","59":"Pertama kali coba sunscreen versi powder hasilnya matte dan natural, biasanya aku pakai di akhir setelah skincare-an atau makeup, selama 2 minggu kulitku ga menimbulkan reaksi negatif alias cocok. Super suka sama kemasannya yang unik, ringan dan praktis bisa di bawa kemana aja.","60":"yayyy! akhirnya aku nemuin sunscreen yang cocok banget di kulit aku! mudah di aaplikasikan, mudah di blend dan tidak lengket sama sekali! sunscreen ini alcohol free loh jadi aman banget untuk kulit sensitif seperti kulitku😭💖💖💖💖 bakal beli lagi sih kalo udah habis💖","61":"aku udah pake produk ini sekitar 2 bulan lebih. teksturnya aga sedikit cair gampang banget buat diblend dan yang paling aku suka itu adalah bikin muka jadi glowing banget.dan tentunya karena aman buat jerawat makanya aku cinta banget sama produk ini","62":"iiiii mampuy suka bgt sama sunscreen ini, bener2 nyaman di pakenya dan bikin wajah keliatan glowing sehat cerah 😍 teksturnya rada cair dan mudah di applikasiin. setiap pake ini ak ngerasa dia lumayan ada efek tone up tp ga bikin muka abu2 👌🏻 suka nih kalo cocok sama produk2 lokal, harganya jg masi masuk akal sesuai kualitas.","63":"5.0\nsunscreen terbaik menurut aku, dia gak bikin kulit berminyak gitu setelah diapply, trus gak bikin muka kita cepet minyakan, enak juga cepat meresap.. packagingnya praktis dan bisa dibawa kemana aja. Rekomen banget pokoknyaaa...harganya juga terjangkau . Manfaatnya juga juara","64":"OMG ini sunscreen terlembut yang pernah aku coba enak banget dikulit aku bikin kulit wajah aku lembab jujur suncreen npure cica beat the sun ini bagus banget dong melindungi dari sinar matahari apa lagi aku banyak banget kegiatan diluar sebelum aku beraktifitas aku pake dulu next abis mau beli lagi😍","65":"pengalaman pertamaku pake sunscreem powder dari n pure ini tuh bener bener sukaa banget , karna baru kali ini nemuin produk sunscreen yg powder dengan kemasan praktis untuk dibawa traveling. uda dilengkapi juga dengan spf 30 dan bisa dipake sebagai step ke 2 setelah sunscreen creamnya. mantul banget deh","66":"Lucu bgt Sunscreen Powder 😍 packagingnya retractable & aplikator brushnya lembut bgt! Warnanya beige tapi ga merubah warna kulit malah bikin kulit makin cerah 😍 Simple lagi kalo mau touch up tinggal tap puter2 kaya pake blussh on 😍 harganya jg affordable 💯","67":"Wow sumpah pertama kalinya cobain sunscreen bentuk powder!! so far i luv this product so much! Pertama untuk packagingnya retractable dan brushnya soft bangettt. Untuk tekstur sedikit powder but its okay bcs finishnya matte natural and no whitecast. Sun powder ini juga tetep menghidrasi kulit walau finishnya matte. Luv it🥰","68":"Baru pertama kali nyobain sun powder dan menurut aku feelsnya sama aja kayak kita pake loose powder gitu. Finishnya matte tapi di kulitku yg medium light dia ga kelihatan dempul dan jatuhnya natural banget, nyatu ke warna kulit asli. Butirannya super halus dan kuasnya juga jd ga buat muka terasa kegores. Kemasannya super mini jadi enak buat dibawa kemana-mana. Sayangnya karna dia sun powder, jd kurang efektif klw dipake single aja, harus pake sunscreen lotion dlu... Jadi jatuhnya produk ini tuh kayak ngeset riasan di bawahnya ama maksimalin proteksi. Lebh cocok dipake buat reapply apalagi pas makeup, jd ga takut makeupnya tergeser. So far aman aja sih di kulit aku dan worth to try👌 Tp krna harganya lumayan out of my budget, aku prefer belinya pas promo aja wkwk","69":"seneng banget akhirnya Nemu sunscreen powder yg slama ini aku cari2 ternyata npure punya produknya doomss ..sumpah ini bagus banget cocok banget dikulit aku yg super duper sensitif ..huhhh popoknya ini recomended deehhh...","70":"Baru kali ini punya sunscreen dalam bentuk powder apalagi aplikatornya Brush. Dan suka banget. Apalagi pas pakai makeup, Reapply jadi lebih praktis. matte finish dan bisa mengontrol minyak berlebih di wajah","71":"Pertama kali cobain sunscreen dan langsung suka 🥺 pas di blend bener-bener nyerap ke kulit dan bikin glowing dong , ringan juga di wajah , ini cocok banget buat yg dry skin ya soalnya habis pakai sunscreen NPURE ini wajahku jadi lembab , suka 💕","72":"suka banget sama sun powdernya, pacakgingnya kuat udah beberapa kali jatoh tapi masih kuat ga rusak untungnya, trus juga hasilnya matte bagus gitu ga ngegeser makeup sama skali sih.. trus efisien banget juga jadinya seneng dibawa kemana2","73":"Pertama kali beli karena sering banget lewat FYP T*kt*k aku, awal pemakaian ternyata ringan, gak ada whitecast, gak lengket juga. Nyaman banget dipake, gak bikin wajah tambah minyakan karena jenis kulitku yang oily masih aman dan nyaman dipake.","74":"baru kali ini cobain sun screen powder dari NPURE, dan kayanya baru NPURE yang keluarin produk kaya gini😍 emang bagus banget sih, bkn muka ga lepek dn lengket lgi klo diluar rumah , packagingnnya jg lucu gampang dibawa kemana2 ga makan tempat.❤️","75":"Ini powder yang terdebest banget sih menurutku. Selain ada spf nya, powder ini waktu di apply ke wajah tekstur nya ringan sama sekali dan ngurangin minyak diwajah jugaaa. Apalagi aku emang dari pagi s\/d sore aktivitasnya diluar teruuussssss. Kemasannya yang minimalis, bikin jadi gampang dibawa kemana-mana🥰 Bakalan jadi powder fav aku sih ini❤️‍🔥","76":"N'PURE Cica Beat The Sun Powder ini cocok banget untuk kulit yang berminyak seperti aku. seperti yang kita tau, re-apply sunscreen itu penting banget apalagi kalo sering kegiatan di outdoor.\nProduk ini praktis banget sih karna gampang banget dibawa kemana-mana juga pas di re-apply mudah banget karna tinggal diusap di wajah dan sekalipun muka kita masih ada make-up nya,tidak buat make-up kita bergeser🥰untuk packaging nya, Sunscreen powder dari N’PURE ini dikemas dalam tabung plastik mini berwarna hijau emerald. Bagian bawah tabungnya bening sehingga sunscreen powder-nya kelihatan. Bagian atas tabung disambungkan dengan brush (kuas) warna cream. Kuas ini lembut banget, sehingga mudah digunakan untuk seluruh bagian wajah. kandungan dalam produk ini terdiri dari ada Titanium Dioxide, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Natural Centella Asiatica Leaf Water, Rice bran oil dan Vitamin E. Dan produk ini memiliki beragam manfaaf, yaitu memberi perlindungan maksimal terhadap efek buruk sinar matahari pada kulit wajah, dapat menangkal sinar UVA maupun UVB secara efektif yang berpotensi dapat merusak kulit, dapat melindungi kulit dari kerusakan karena paparan sinar matahari salah satunya yaitu sunburn, dapat menenangkan kulit setelah beraktivitas di bawah sinar mataharini, dan untuk menghidrasi dan menutrisi kulit wajah secara maksimal. N'PURE CICA BEAT THE SUN POWDER ini bersifat non-comedogenic, jadi aman untuk kamu yang punya kulit sensitif.😍","77":"Sesuka itu sama powder dari n’pure , favorite banget sih inimah , teksturnya juga lembut gtuh loh ,cocok banget buat kulit berminyak kaya aku , garibet dibawa kemana sesimple itu , pokoknya aku sih suka banget 😍 emng deh produk n’pure gapernah gagal ❤️","78":"aku nyobain ini karena fyp mulu kan di tiktok. nah penasaran aku langsung beli... kaget juga ada sunscreen bentuk powder, pertama kali make seneng banget karena gaperlu hapus makeup sih kalau mau reapply sunscreen lagi, hasilnya matte di muka aku bisa banget buat ngunci minyakkk dan makeup tetap on pointtt, terus praktis buat dibawa kemana mana, cara makenya sempet bingung tapi liat video video tutorial jadi bisa sih... ini sunscreen membantu aku bangettt buat sehari hariii❤️😍","79":"teksturnya agak cair, warna putih standar produk sunscreen, cepat menyerap, baunya hampir gada, agak whitecast di awalnya jadi diratain aja. sering dibiarin sampe 14 jam dan muka agak berminyak. tapi overall tidak mengecewakan sih...","80":"akhirnya beli produk ini pas banget lagi sale juga di e-commerce. niat beli produk ini emang buat reapply sunscreen through out the day. buat temen temen yang mau pake pastiin jangan pake produk ini sendirian jadi tetep harus pake sunscreen dan bisa di set lagi pake ini. jadi produk ini emang diperuntukan buat reapply sunscreen yang mudah banget sihhh","81":"Sun powder dari N'pure ini bagus bangett, gaboong deh. Teksturnya lembut bgt dan benerbener melindungi kulit dari paparan sinar matahari, jadi kalo males pake sunscreen biasa bisa langsung pake ini yg super praktisss❤️❤️ sukak pwoll pokonya","82":"waw sumpah si ini sunscreen yang bener bener bagus banget, pertama kali nyoba emang langsung cocok di muka aku😍selain itu tekstur nya itu ringan dan cepat meresap di kulit dan juga sekali pake muka aku langsung glowing, beuh pokonya cinta banget sama sunscreen yang ini❤😍","83":"N'PURE Cica Beat The Sun Powder ini bener-bener menjawab kebingunganku kalau harus re-apply sunscreen dengan kondisi wajah bermakeup. Tekstur powdernya halus & nggak menyumbat pori ataupun menimbulkan jerawat. Tanpa whitecast, ringan di kulit dan menyerap minyak.","84":"Suka sama teksturnya powder dan aplikatornya brush. Ada SPF 30nya, membantu perlindungan UVA\/UVB. Recomendded! dan wajib direapply setiap dua jam sekali. Jadi pengen beli lagi kalo ini dah habis hehe. I love it sama NPURE produknya bagus².","85":"Aku agak pemilih kalo urusan sunscreen. Soalnya biasanya sunscreen itu lengket dan bikin ga nyaman. Tapi ini beda. Toner ini ga terlalu lengket, cepet ngeresap, ga bikin berasa pakai dempul juga. Dan yg paling penting ga nyumbat pori dan SPF tinggi. Tubenya juga lucu.","86":"Cocok banget untuk melindungi kulit dari paparan sinar matahari karena mengandung kandungan utama spf terus yang aku suka dia ga geser makeup di wajah jadi aman banget untuk ditimpa diatas makeup, selain itu karena dia bentuk powder bisa bantu matte in makeup yang terlalu dewy \/ oily.","87":"suka banget dengan inovasi sekeren ini. gak perlu lagi buat bingung untuk really sunscreen sekaligus touchup make up. spf nya 30 juga seneng banget. kalau reapply sunscreen bikin tetep stay flawless dan masih bikin cantik. mulifungsi banget, suka banget dah","88":"bagi aku dia bener bener unique because bayangin aja sunscrren sama bedak bisa jadi satu...dan yang lebih bagusnya lagi dia gabikin kukit bruntusan dan pas di apply dia gabikin kulit kita kliatan kayak berminyak gitu. Ooo ya aku saranin nih kalian wajib touch up 2 jam sekali","89":"Sumpah unik banget sunscreenya bentuk bedak gituu dan ada kuasnyaa apalagi spf 30 persenn mantul banget, di apkenya gk ribet dan bisa di apply berulangkali hehehhe kalian semua wajib punya karena praktis banget kaya pake bedak rekomen dan harganya terjangkau prahhhh","90":"pertama kali nyobain dan ternyata cocok di aku, ga bikin kusam padahal warnanya sedikit gelap dari kulitku hehe dan hasilnya matte aku suka bangetttt. trus kemasannya juga praktis cuman harus berkali kali gitu biar kliatan pake bedaknya hehehe","91":"sunscreen ternyaman yg pernahh aku cobainn sii guyss, dengan tekstur yang superrr ringann poll ga susah pokoknya di blend nyaa, sudah bpom no alcohol dan no fragrancee the bestttttttt ✅✅✅😊😊😊😊😊😊😊😊😊❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥💘❤️‍🔥💘💘❤️‍🔥❤️‍🔥❤️‍🔥💘❤️‍🔥❤️‍🔥💘❤️‍🔥💘💘💘💘💘","92":"Pertama kali nyobain sunscreen yang bentuknya powder aku sukaaa ini sih soalnya gampang di bawa kemana mana apa lagi buat reapply sunscreen pas udah makeup .menurut ku ini bneran bagusss jadinya makeup ga geser udah gitu bisa ngontrol minyak jugaaa","93":"Suka banget sama produk ini karena powdernya ringan banget di kulit. Cara pakainya juga mudah, hasil akhirnya di kulitku matte dan lumayan tahan lama. Kuasnya juga bagus, lembut, dan ga mudah rontok. Jadi gampang banget re apply sunscreen","94":"Baru kali ini nyobain sunscreen powder yang ringan membantu menyerap minyak berlebih, meminimalkan tampilan pori-pori,sekaligus mengurangi kilau minyak.Jadi gak perlu hapus makeup lagi jika mau apply sunscreen ❤️❤️❤️","95":"Ini sunscreen paling cocok buat aku yang kulit sensitive, ga lengket, ge bikin berminyak, dan ringan banget di wajah. Seriuss ini aku bakal repeat order ini terus kayanya karna secocok itu sama muka aku😩🤍 love banget sama cica beat te sun🤍🤍🤍","96":"bagus bangethdjdhdjjdjdjjsjdjdhhdhshshshshshshshshshsheheehhehehehdb jsjsjdjejej jejejejejjeje jejejejejejdjjd jejejejejejejejejjejeje jejejejejjeiee jejejejejeje jejejekekekkjejeejjeej nsjejejejejej jejejejejej","97":"powder suncreen pertama yang aku cobaa. sekali coba langsung ketagihan wkwk. soalnya cocok di kulit aku, suka sama teksturnya lembut dan ringan. finish looknya matte tapi tetep natural. luv banget! xx","98":"Akhirnya nemuin sunscreen super simple, garibet buat ngeapply, selain itu tekstur powdernya halus banget, seworth itu, ini bakalan jadi sunscreean andalang aku, thnk u N’pure udah ngeluarin produk Cica beat the sun powder ini, cocok banget di aku yang super mager.","99":"Demi apa sihh produk dr npure satu ini bener² baguss bgt.. buat ngatasin jerawat² aku yg sukaaa lama bgt sembuhnya.. cintaaa bgt sma produk ini..\nRecommended bgt buat kalian nihhhhh... Jerawat bisa bener² kering dalam waktu yg lebih cepat","100":"sukaaa suka sukaa bangett , hasilnya ga whitecast cepet nyerep dan ga buat wajah berminyaak \/lengket smaa sekalii , buat re apply jg okee bangett , harganyaa murah jgg 😍😍😍 superr recomended buat yg cari sunscreen no white cast , ga buat berminyak","101":"Buat kalian yang punya kulit jerawatan merah2 sini banget lah kalian wajib cobain sunscreen satu ini. Dia ga ada bau sma skali teksturnya cukup ringan & ga bikin risih lengket gitu finishnya kalian ga usah takut makeuo rusak pas mo re-aplly sunscreen krena ini gampang bngt di blend & cepat menyerap di kulit 🥰😍","102":"Sukaa bgtt sama sunscreen dari N'PURE cica beat the sun ini. Tekstur nya juga gampang di blend, gampang jugaa meresap dan ga lengket sama sekali.sudah bpom ,aman buat bu sui serta bebas dari bahan bahan berbahayaaa, udah spf 50+++ jugaa lohh😍💖💖💖","103":"Honest review dari aku ini sunscreen termasuk sunscreen yang unik banget karena bentuknya itu powder jadi memudahkan aku untuk re-touch make up, lumayan tahan lama dan tahan minyak, packagingnya juga simple dan mudah dibawa kemana mana","104":"Packaging nya bagus, lucu dan mudah dibawa kemana-mana, jadi ga ribet 😘 Tekturnya cream, ringan, ga bikin whitecast jdi ga ngedempul, gampang ngresap. Hasil akhirnya glowing, cocok untuk semua jenis kulit. Harganya juga affordable, bagus banget produknyaa ❤️❤️","105":"pliss ini sunscreen unik banget, apalagi aplikatornya brush yang memudahkan untuk re-apply dan touch up. hasil akhirnya matte dan lumayan tahan minyak, sesuai klaimnya aku re-apply setiap 2 jam sekali walaupun langsung aku timpa dia ga bikin wajah kusam.","106":"BAGUS BGT!!akhirnya bisa kebeli juga ini sunscreen😭 ngerasa beruntusan ilang dan glowing aja pake inituh bukan yang minyakan, cocok bgt buat kulit wajah aku yang normal to dry. Kaget pas beres ngeapply si cica beat sun ini, trs lanjut tone up cream, yang biasanya tone upnya susah diblend numpuk putih gitu skrg gampang bgt blendnya jadi rata putih glowing berkat si sunscreen ini😭❤ suka bgttttt","107":"suka banget pake sunscreen dari npure cica beat the sun krna bagus banget terlihat kerutan bekurang dan tambah cerah wajah setelah rutin pakai produk ini .. ga bikin lengket dan berminyak jg wajah setelah memakai rangkaian skincare lain","108":"sebelum pake yang powder aku pake yang ini dulu. setelah aku pake ga berat dan ga ninggalin whitecast sih. jadi ringan dan cepat menyerap gitu. best combo kalo di paduin sama yang powder. apalagi spf nya gede banget, no worry deh. tinggal apply yang powder","109":"asli sih ini sunscreen ter ga ribet, impressed banget sama npure! makasih puol udah ciptain sunscreen powder ini. bawa kemana-mana praktis juga. bisa re-apply tiap saat. jadi ga perlu worried make-up kenapa-napa ya kan hehe. hasilnya matte finish juga","110":"Ini adalah pertama kalinya gua coba pake product ini dan termyata sesuai ekspetasi. Emng sunscreenya bagus bgt, kulit bener terlindungi dari sinar matahari. Dan skrg ga perlu kawatir lagi klu pergi pergi, tinggal pakai dan ku bawa kemana mana","111":"bagus bget sih ini mana kandungan dan manfaatnya jga bagus BPOM, Halal, Teruji Secara Dermatologis, Bebas SLS, Bebas Paraben, Bebas Minyak Mineral, Bebas Alkohol, Bebas Alergen UE, Bahan Minimal, Bebas Pewangi jadi kalian wajib coba yaaa","112":"Produknya the best banget karna ini powder udah ada spf 30nya jadi mudah untuk reapply berkali kali, teksturnya powdernya juga halus, warnanya natural di muka dan hasilnya matte, packagingnya jg aman bisa di bawa kmna mna😉 aku recomended banget pokoknya ❤️❤️❤️","113":"sun cream nya bagus banget karna SPF 50++++ melindungi kita dari teriknya sinar matahari apalagi di siang siang itu bener bener panas banget dan bisa membuat kulit kusam bisa merah juga kan, setelah pake spf sun cream in bener-bener menjaga kulit kita dari paparan matahari melindungi banget trs bisa meng glowing kan muka kita juga tekstur nya ringan banget di wajah dan nyaman si menurut ku.🤗","114":"kaget banget ternyata sebagus itu. kulitku tuh kombinasi tapi masih aman banget gabikin berminyak cuma glowimg biasa aja terus gabuat kusam. cepet banget nyerepnya, bakal beli lagi ini mah wkwk padhaal harganya gamahal tapi kualitasnya oke banget","115":"Produk nya super bagus, ini selain pigmen di wajah juga ada spf nya 30++ super bagus bukan. Gak perlu repot-repot pakai sunscreen lagi bisa lgs ini 2in1 hihi. Aku suka banget pakai ini kalian wajib coba sih 🥰","116":"bagusss bangett produknya, cocok untuk semua jenis kulit jugaa loh, nggaa lengket dikulitt teksturnya, dan harganyaa juga ramah kantong bgt😝 pokoknyaaaa aku rekomend bangettttt buat kalian beli produk inii skrng jugaaaaa yaaaa😍💗💗💗💗","117":"baru kali ini cocok pakai sunscreen😭 biasanya over oily, tapi ini tuh cepet bgt nyerepnya, no whitecast, trus udah gitu finishnya bener2 bikin kulit makin glowing dong omg😚 skrg jadi sunscreen addict bgt berkat npure cica beat the sun, wajib re-purchase sih iniii❤️","118":"N’PURE CICA BEAT THE SUN sunscreen ☀️ Texturenya super light di kulit, nyaman dipake seharian, ga lengket, ga ninggalin whitecast, bikin muka jadi glowing tapi ga bikin greasy! ❤️ 💚 Dengan SPF 50 PA++++ sebagai UV Filter agent nya, sunscreen ini bakal mem-protect kita dari paparan sinar UV A & UV B💚 Kandungan 100% Natural Cica (Centella Asiatica) Leaf Water yang terdapat didalamnya juga bagus banget untuk menenangkan kulit kita setelah terpapar sinar matahari 💚 Chrysanthemum Extract, Chamomilla Extract, and Camellia Sinensis Leaf Extract didalamnya kaya akan antioksidan & anti-inflammatory, jadi bagus banget untuk kemerahan & meng-hidrasi kulit kita💚 BPOM, Halal, Dermatologically Tested, Bumil Busui Friendly, Free from : Paraben, SLS, Mineral Oil, Alcohol, Silicone, EU Allergen & Fragrance. Recommended 🥰✨","119":"Produk N'PURE emang paling dabest sih. Sunscreennya ini matte finish gitu, cocok banget buat aku yang males touch up dan reapply sunscreen pas lagi di luar rumah, hihi. Kandungannya juga gausah diragukan lagi. Worth to buy! 💚","120":"Sukaaa banget deh sama produk N'PURE yang satu ini Cica Beat the sun Powder ✨ cocok banget buat aku yg mager banget kalo reapply sunscreen tapi semenjak ada produk ini aku gak mager lagi karena gampang banget di reapply nya, dengan tekstur nya yg powder dan praktis banget buat di reapply 😍 wajib banget sih punya produk N'pure yg satu ini 😍 thankyou N'Pure ","121":"suka banget sama sunscreen dari Npure, karena ga bikin kulit jadi berminyak, ga bikin whitecast, selain itu juga non paraben, non alkohol & non fragrance. cocok banget buat kulit sensitif kayak aku~ udah ada spf 50 pa ++++ lagi terbaikkk 🥺✨","122":"Suka bangeeeet sama tekturnyaaa! aman buat wajahku yg sering jerawatan+bruntusan. Gabikin iritasi, ga berat sama sekali, efeknya glowing bund 😆 aman ditimpa sama makeup juga. Pas nge touch up juga enak banget walau diatas makeup tapi bisa menyerap kekulit. Selalu di repurchase 💕","123":"Senang bangettt akhirnya bisa nemuin suncreen yang gampang di apply berkali-kali tanpa harus hapus make-up duluuu, yg aku suka juga warna tekturnya tuh natural jadi cocok juga buat jenis kulit yang sawo matang kaya akuuu thank uuu N’PURE😍","124":"suka banget sama sunscreen ini, awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong, ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan.","125":"suka banget sama sunscreen ini, awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong, ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan.","126":"bener2 recommended banget deh. cocok banget di mukaku spfnya juga tinggi dan ga buat muka aku kering sama ga ada efect putih nya di mukaku dan yang aku suka lagi harganya juga ga mahal deh dengan punya banyak manfaat untuk sunscream. bener2 suka banget deh pokoknya.","127":"ini produk yg wajib dipake. harus punya.... pokoknya suka banget pakai sunscreen N' PURE ini.. bisa buat base makeup juga krna gak lengket di kulit trus cepet meresap.. harganya juga ramah dikantong... recomended deh pokoknya... next mau beli lagi...","128":"Sudah sebulanan ini aku pakai cica beat the sun N'PURE. Teksturnya pas tidak terlalu kental dan tidak lengket, nyaman di kulit.. Meresap cepat dan ada kandungan SPF 50 PA++++ (cukup tinggi) serta di kulitku no whitecast! Namun tips jika kulitmu berminyak, padukan dengan cica beat the sun powder yah!","129":"buat yang punya kulit kering pasti bakal suka sama produk ini, setelah dipake langsung auto glowing glass skin ala2 korea gitu tapi ga terasa lengket \/ greasy sama sekali. dan pastinya bikin kulit terasa lembab seharian. spf nya juga tinggi dan proteksi nya udh lengkap. cocok juga untuk dijadikan base makeup jdi lebih nempel dan mulus","130":"Teksturnya ringan banget dengan hasil matte finish, penolong banget buat wajah aku yg oily ini, ada SPF 30 nya pula😭 dan produknya juga praktis dibawa kemana\" dan bentuknya juga praktis banget gk ribet kalo mau reaply❤","131":"the finish looks good on my combi to dry skin! kalo pake ss emang suka yg glowwy finish dan ini ga bikin gerah sama sekaliii, gampang di blend jugaa dan minim oksidasii, tapi kayaknya oil controlnya kurang, tapi apply 3 kali sehari sekali udah enak banget, bakal repurchase sih!","132":"aaaaaa akhirnya ga worry lagi kalo lagi makeup harus reapply sunscreen, sangat amat membantu aku yang kerjanya makeup tapi ttp terpapar matahari. yang kerennya lagi, selain doi memproteksi kulit dari efek uva uvb, bisa sekalian touch up, makeup jadi matte dan flawless. must try❤️","133":"Aku suka sama sunscreen ini😍 Teksturnya gampang menyerap gak kental dan gak berat. Overall aku cocok, biasanya kalo gak cocok aku akan timbul jerawat, tapi ini gak, aku ngerasa juga wajah aku tetap terasa lembab💕 Terus package nya juga aku suka di ujung buka tutup nya bentuknya kayak plastik bening gitu yang buat jd unik aja. Gak tau pertama kali liat langsung wah lucu hehe🤗💕💕","134":"Ini highly recommended sih. Buat daily enak bgt simple, dipakenya ga ribet mana teksturnya enak bgt ringan😭🤍 Asli muka aku biasanya jam 12an gt udh oily, dipakein ini langsung nge-set lagi kaya baru pake make up🥲🤍","135":"selama pake produk ini , aku ngerasa kulit ku terlindungi ,,, karena jujur kulitku tipe yang suka sakit dan kemerahan disaat kena sinar matahari, dan karena kebanyakan sunscreen bertexture creamy bkin aku susah meratakan creamnya diwajah dan bkin sakit akhirnya aku stop pake, tapi setelah pake N'PURE AKU gak lagi khawatir karena lbh cepat meresap dan cpt bekerja di kulit wajah aku","136":"gilakkk sih produknya bagus bgt udah spf 50 PA+++ selain itu dri packagingnya simple bgt buat di bawa kemana2 kesan pertama pakai langsung memberi efek glowing pada kulitku serta teksturnya ringan bgtt. fix produknya npure emang bagus2 bgt apalagi yang cica beat the sun powder ini kalian harus cobaaaa 👍","137":"Nyaman digunain, bikin glowing diwajah gak kering dan adem di kulit. Wajib dipake buat klian yg sering aktifitas di luar ruangan haruuus bgt ini buat perlindungan yaaaaaaaaaaaaa😍😍😍😍😍😍😍😍😍😍😍😍😍","138":"Terima kasih bgt buat N'Pure yg sudah bikin produk ini karena reapply sunscreen jadi mudah. Suka bgt sama sunscreen ini & pas buat aku yg suka pake makeup. Finish-nya matte, nggak geser makeup & gampang bgt pakenya.","139":"Pertama kali coba sunscreen versi powder hasilnya matte dan natural, biasanya aku pakai di akhir setelah skincare-an atau makeup, selama 2 minggu kulitku ga menimbulkan reaksi negatif alias cocok. Super suka sama kemasannya yang unik, ringan dan praktis bisa di bawa kemana aja.","140":"yayyy! akhirnya aku nemuin sunscreen yang cocok banget di kulit aku! mudah di aaplikasikan, mudah di blend dan tidak lengket sama sekali! sunscreen ini alcohol free loh jadi aman banget untuk kulit sensitif seperti kulitku😭💖💖💖💖 bakal beli lagi sih kalo udah habis💖","141":"aku udah pake produk ini sekitar 2 bulan lebih. teksturnya aga sedikit cair gampang banget buat diblend dan yang paling aku suka itu adalah bikin muka jadi glowing banget.dan tentunya karena aman buat jerawat makanya aku cinta banget sama produk ini","142":"iiiii mampuy suka bgt sama sunscreen ini, bener2 nyaman di pakenya dan bikin wajah keliatan glowing sehat cerah 😍 teksturnya rada cair dan mudah di applikasiin. setiap pake ini ak ngerasa dia lumayan ada efek tone up tp ga bikin muka abu2 👌🏻 suka nih kalo cocok sama produk2 lokal, harganya jg masi masuk akal sesuai kualitas.","143":"5.0\nsunscreen terbaik menurut aku, dia gak bikin kulit berminyak gitu setelah diapply, trus gak bikin muka kita cepet minyakan, enak juga cepat meresap.. packagingnya praktis dan bisa dibawa kemana aja. Rekomen banget pokoknyaaa...harganya juga terjangkau . Manfaatnya juga juara","144":"OMG ini sunscreen terlembut yang pernah aku coba enak banget dikulit aku bikin kulit wajah aku lembab jujur suncreen npure cica beat the sun ini bagus banget dong melindungi dari sinar matahari apa lagi aku banyak banget kegiatan diluar sebelum aku beraktifitas aku pake dulu next abis mau beli lagi😍","145":"pengalaman pertamaku pake sunscreem powder dari n pure ini tuh bener bener sukaa banget , karna baru kali ini nemuin produk sunscreen yg powder dengan kemasan praktis untuk dibawa traveling. uda dilengkapi juga dengan spf 30 dan bisa dipake sebagai step ke 2 setelah sunscreen creamnya. mantul banget deh","146":"Lucu bgt Sunscreen Powder 😍 packagingnya retractable & aplikator brushnya lembut bgt! Warnanya beige tapi ga merubah warna kulit malah bikin kulit makin cerah 😍 Simple lagi kalo mau touch up tinggal tap puter2 kaya pake blussh on 😍 harganya jg affordable 💯","147":"Wow sumpah pertama kalinya cobain sunscreen bentuk powder!! so far i luv this product so much! Pertama untuk packagingnya retractable dan brushnya soft bangettt. Untuk tekstur sedikit powder but its okay bcs finishnya matte natural and no whitecast. Sun powder ini juga tetep menghidrasi kulit walau finishnya matte. Luv it🥰","148":"Baru pertama kali nyobain sun powder dan menurut aku feelsnya sama aja kayak kita pake loose powder gitu. Finishnya matte tapi di kulitku yg medium light dia ga kelihatan dempul dan jatuhnya natural banget, nyatu ke warna kulit asli. Butirannya super halus dan kuasnya juga jd ga buat muka terasa kegores. Kemasannya super mini jadi enak buat dibawa kemana-mana. Sayangnya karna dia sun powder, jd kurang efektif klw dipake single aja, harus pake sunscreen lotion dlu... Jadi jatuhnya produk ini tuh kayak ngeset riasan di bawahnya ama maksimalin proteksi. Lebh cocok dipake buat reapply apalagi pas makeup, jd ga takut makeupnya tergeser. So far aman aja sih di kulit aku dan worth to try👌 Tp krna harganya lumayan out of my budget, aku prefer belinya pas promo aja wkwk","149":"seneng banget akhirnya Nemu sunscreen powder yg slama ini aku cari2 ternyata npure punya produknya doomss ..sumpah ini bagus banget cocok banget dikulit aku yg super duper sensitif ..huhhh popoknya ini recomended deehhh...","150":"Baru kali ini punya sunscreen dalam bentuk powder apalagi aplikatornya Brush. Dan suka banget. Apalagi pas pakai makeup, Reapply jadi lebih praktis. matte finish dan bisa mengontrol minyak berlebih di wajah","151":"suka banget sama sun powdernya, pacakgingnya kuat udah beberapa kali jatoh tapi masih kuat ga rusak untungnya, trus juga hasilnya matte bagus gitu ga ngegeser makeup sama skali sih.. trus efisien banget juga jadinya seneng dibawa kemana2","152":"Pertama kali cobain sunscreen dan langsung suka 🥺 pas di blend bener-bener nyerap ke kulit dan bikin glowing dong , ringan juga di wajah , ini cocok banget buat yg dry skin ya soalnya habis pakai sunscreen NPURE ini wajahku jadi lembab , suka 💕","153":"Pertama kali beli karena sering banget lewat FYP T*kt*k aku, awal pemakaian ternyata ringan, gak ada whitecast, gak lengket juga. Nyaman banget dipake, gak bikin wajah tambah minyakan karena jenis kulitku yang oily masih aman dan nyaman dipake.","154":"baru kali ini cobain sun screen powder dari NPURE, dan kayanya baru NPURE yang keluarin produk kaya gini😍 emang bagus banget sih, bkn muka ga lepek dn lengket lgi klo diluar rumah , packagingnnya jg lucu gampang dibawa kemana2 ga makan tempat.❤️","155":"Ini powder yang terdebest banget sih menurutku. Selain ada spf nya, powder ini waktu di apply ke wajah tekstur nya ringan sama sekali dan ngurangin minyak diwajah jugaaa. Apalagi aku emang dari pagi s\/d sore aktivitasnya diluar teruuussssss. Kemasannya yang minimalis, bikin jadi gampang dibawa kemana-mana🥰 Bakalan jadi powder fav aku sih ini❤️‍🔥","156":"N'PURE Cica Beat The Sun Powder ini cocok banget untuk kulit yang berminyak seperti aku. seperti yang kita tau, re-apply sunscreen itu penting banget apalagi kalo sering kegiatan di outdoor.\nProduk ini praktis banget sih karna gampang banget dibawa kemana-mana juga pas di re-apply mudah banget karna tinggal diusap di wajah dan sekalipun muka kita masih ada make-up nya,tidak buat make-up kita bergeser🥰untuk packaging nya, Sunscreen powder dari N’PURE ini dikemas dalam tabung plastik mini berwarna hijau emerald. Bagian bawah tabungnya bening sehingga sunscreen powder-nya kelihatan. Bagian atas tabung disambungkan dengan brush (kuas) warna cream. Kuas ini lembut banget, sehingga mudah digunakan untuk seluruh bagian wajah. kandungan dalam produk ini terdiri dari ada Titanium Dioxide, Ethylhexyl Salicylate, Ethylhexyl Methoxycinnamate, Natural Centella Asiatica Leaf Water, Rice bran oil dan Vitamin E. Dan produk ini memiliki beragam manfaaf, yaitu memberi perlindungan maksimal terhadap efek buruk sinar matahari pada kulit wajah, dapat menangkal sinar UVA maupun UVB secara efektif yang berpotensi dapat merusak kulit, dapat melindungi kulit dari kerusakan karena paparan sinar matahari salah satunya yaitu sunburn, dapat menenangkan kulit setelah beraktivitas di bawah sinar mataharini, dan untuk menghidrasi dan menutrisi kulit wajah secara maksimal. N'PURE CICA BEAT THE SUN POWDER ini bersifat non-comedogenic, jadi aman untuk kamu yang punya kulit sensitif.😍","157":"Sesuka itu sama powder dari n’pure , favorite banget sih inimah , teksturnya juga lembut gtuh loh ,cocok banget buat kulit berminyak kaya aku , garibet dibawa kemana sesimple itu , pokoknya aku sih suka banget 😍 emng deh produk n’pure gapernah gagal ❤️","158":"aku nyobain ini karena fyp mulu kan di tiktok. nah penasaran aku langsung beli... kaget juga ada sunscreen bentuk powder, pertama kali make seneng banget karena gaperlu hapus makeup sih kalau mau reapply sunscreen lagi, hasilnya matte di muka aku bisa banget buat ngunci minyakkk dan makeup tetap on pointtt, terus praktis buat dibawa kemana mana, cara makenya sempet bingung tapi liat video video tutorial jadi bisa sih... ini sunscreen membantu aku bangettt buat sehari hariii❤️😍","159":"teksturnya agak cair, warna putih standar produk sunscreen, cepat menyerap, baunya hampir gada, agak whitecast di awalnya jadi diratain aja. sering dibiarin sampe 14 jam dan muka agak berminyak. tapi overall tidak mengecewakan sih..."},"Pre #1":{"0":"akhirnya beli produk ini pas banget lagi sale juga di e-commerce. niat beli produk ini emang buat reapply sunscreen through out the day. buat temen temen yang mau pake pastiin jangan pake produk ini sendirian jadi tetep harus pake sunscreen dan bisa di set lagi pake ini. jadi produk ini emang diperuntukan buat reapply sunscreen yang mudah banget sihhh","1":"sun powder dari n'pure ini bagus bangett, gaboong deh. teksturnya lembut bgt dan benerbener melindungi kulit dari paparan sinar matahari, jadi kalo males pake sunscreen biasa bisa langsung pake ini yg super praktisss❤️❤️ sukak pwoll pokonya","2":"waw sumpah si ini sunscreen yang bener bener bagus banget, pertama kali nyoba emang langsung cocok di muka aku😍selain itu tekstur nya itu ringan dan cepat meresap di kulit dan juga sekali pake muka aku langsung glowing, beuh pokonya cinta banget sama sunscreen yang ini❤😍","3":"n'pure cica beat the sun powder ini bener-bener menjawab kebingunganku kalau harus re-apply sunscreen dengan kondisi wajah bermakeup. tekstur powdernya halus & nggak menyumbat pori ataupun menimbulkan jerawat. tanpa whitecast, ringan di kulit dan menyerap minyak.","4":"suka sama teksturnya powder dan aplikatornya brush. ada spf 30nya, membantu perlindungan uva\/uvb. recomendded! dan wajib direapply setiap dua jam sekali. jadi pengen beli lagi kalo ini dah habis hehe. i love it sama npure produknya bagus².","5":"aku agak pemilih kalo urusan sunscreen. soalnya biasanya sunscreen itu lengket dan bikin ga nyaman. tapi ini beda. toner ini ga terlalu lengket, cepet ngeresap, ga bikin berasa pakai dempul juga. dan yg paling penting ga nyumbat pori dan spf tinggi. tubenya juga lucu.","6":"cocok banget untuk melindungi kulit dari paparan sinar matahari karena mengandung kandungan utama spf terus yang aku suka dia ga geser makeup di wajah jadi aman banget untuk ditimpa diatas makeup, selain itu karena dia bentuk powder bisa bantu matte in makeup yang terlalu dewy \/ oily.","7":"suka banget dengan inovasi sekeren ini. gak perlu lagi buat bingung untuk really sunscreen sekaligus touchup make up. spf nya 30 juga seneng banget. kalau reapply sunscreen bikin tetep stay flawless dan masih bikin cantik. mulifungsi banget, suka banget dah","8":"bagi aku dia bener bener unique because bayangin aja sunscrren sama bedak bisa jadi satu...dan yang lebih bagusnya lagi dia gabikin kukit bruntusan dan pas di apply dia gabikin kulit kita kliatan kayak berminyak gitu. ooo ya aku saranin nih kalian wajib touch up 2 jam sekali","9":"sumpah unik banget sunscreenya bentuk bedak gituu dan ada kuasnyaa apalagi spf 30 persenn mantul banget, di apkenya gk ribet dan bisa di apply berulangkali hehehhe kalian semua wajib punya karena praktis banget kaya pake bedak rekomen dan harganya terjangkau prahhhh","10":"pertama kali nyobain dan ternyata cocok di aku, ga bikin kusam padahal warnanya sedikit gelap dari kulitku hehe dan hasilnya matte aku suka bangetttt. trus kemasannya juga praktis cuman harus berkali kali gitu biar kliatan pake bedaknya hehehe","11":"sunscreen ternyaman yg pernahh aku cobainn sii guyss, dengan tekstur yang superrr ringann poll ga susah pokoknya di blend nyaa, sudah bpom no alcohol dan no fragrancee the bestttttttt ✅✅✅😊😊😊😊😊😊😊😊😊❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥💘❤️‍🔥💘💘❤️‍🔥❤️‍🔥❤️‍🔥💘❤️‍🔥❤️‍🔥💘❤️‍🔥💘💘💘💘💘","12":"pertama kali nyobain sunscreen yang bentuknya powder aku sukaaa ini sih soalnya gampang di bawa kemana mana apa lagi buat reapply sunscreen pas udah makeup .menurut ku ini bneran bagusss jadinya makeup ga geser udah gitu bisa ngontrol minyak jugaaa","13":"suka banget sama produk ini karena powdernya ringan banget di kulit. cara pakainya juga mudah, hasil akhirnya di kulitku matte dan lumayan tahan lama. kuasnya juga bagus, lembut, dan ga mudah rontok. jadi gampang banget re apply sunscreen","14":"baru kali ini nyobain sunscreen powder yang ringan membantu menyerap minyak berlebih, meminimalkan tampilan pori-pori,sekaligus mengurangi kilau minyak.jadi gak perlu hapus makeup lagi jika mau apply sunscreen ❤️❤️❤️","15":"ini sunscreen paling cocok buat aku yang kulit sensitive, ga lengket, ge bikin berminyak, dan ringan banget di wajah. seriuss ini aku bakal repeat order ini terus kayanya karna secocok itu sama muka aku😩🤍 love banget sama cica beat te sun🤍🤍🤍","16":"bagus bangethdjdhdjjdjdjjsjdjdhhdhshshshshshshshshshsheheehhehehehdb jsjsjdjejej jejejejejjeje jejejejejejdjjd jejejejejejejejejjejeje jejejejejjeiee jejejejejeje jejejekekekkjejeejjeej nsjejejejejej jejejejejej","17":"powder suncreen pertama yang aku cobaa. sekali coba langsung ketagihan wkwk. soalnya cocok di kulit aku, suka sama teksturnya lembut dan ringan. finish looknya matte tapi tetep natural. luv banget! xx","18":"akhirnya nemuin sunscreen super simple, garibet buat ngeapply, selain itu tekstur powdernya halus banget, seworth itu, ini bakalan jadi sunscreean andalang aku, thnk u n’pure udah ngeluarin produk cica beat the sun powder ini, cocok banget di aku yang super mager.","19":"demi apa sihh produk dr npure satu ini bener² baguss bgt.. buat ngatasin jerawat² aku yg sukaaa lama bgt sembuhnya.. cintaaa bgt sma produk ini..\nrecommended bgt buat kalian nihhhhh... jerawat bisa bener² kering dalam waktu yg lebih cepat","20":"sukaaa suka sukaa bangett , hasilnya ga whitecast cepet nyerep dan ga buat wajah berminyaak \/lengket smaa sekalii , buat re apply jg okee bangett , harganyaa murah jgg 😍😍😍 superr recomended buat yg cari sunscreen no white cast , ga buat berminyak","21":"buat kalian yang punya kulit jerawatan merah2 sini banget lah kalian wajib cobain sunscreen satu ini. dia ga ada bau sma skali teksturnya cukup ringan & ga bikin risih lengket gitu finishnya kalian ga usah takut makeuo rusak pas mo re-aplly sunscreen krena ini gampang bngt di blend & cepat menyerap di kulit 🥰😍","22":"sukaa bgtt sama sunscreen dari n'pure cica beat the sun ini. tekstur nya juga gampang di blend, gampang jugaa meresap dan ga lengket sama sekali.sudah bpom ,aman buat bu sui serta bebas dari bahan bahan berbahayaaa, udah spf 50+++ jugaa lohh😍💖💖💖","23":"honest review dari aku ini sunscreen termasuk sunscreen yang unik banget karena bentuknya itu powder jadi memudahkan aku untuk re-touch make up, lumayan tahan lama dan tahan minyak, packagingnya juga simple dan mudah dibawa kemana mana","24":"packaging nya bagus, lucu dan mudah dibawa kemana-mana, jadi ga ribet 😘 tekturnya cream, ringan, ga bikin whitecast jdi ga ngedempul, gampang ngresap. hasil akhirnya glowing, cocok untuk semua jenis kulit. harganya juga affordable, bagus banget produknyaa ❤️❤️","25":"pliss ini sunscreen unik banget, apalagi aplikatornya brush yang memudahkan untuk re-apply dan touch up. hasil akhirnya matte dan lumayan tahan minyak, sesuai klaimnya aku re-apply setiap 2 jam sekali walaupun langsung aku timpa dia ga bikin wajah kusam.","26":"bagus bgt!!akhirnya bisa kebeli juga ini sunscreen😭 ngerasa beruntusan ilang dan glowing aja pake inituh bukan yang minyakan, cocok bgt buat kulit wajah aku yang normal to dry. kaget pas beres ngeapply si cica beat sun ini, trs lanjut tone up cream, yang biasanya tone upnya susah diblend numpuk putih gitu skrg gampang bgt blendnya jadi rata putih glowing berkat si sunscreen ini😭❤ suka bgttttt","27":"suka banget pake sunscreen dari npure cica beat the sun krna bagus banget terlihat kerutan bekurang dan tambah cerah wajah setelah rutin pakai produk ini .. ga bikin lengket dan berminyak jg wajah setelah memakai rangkaian skincare lain","28":"sebelum pake yang powder aku pake yang ini dulu. setelah aku pake ga berat dan ga ninggalin whitecast sih. jadi ringan dan cepat menyerap gitu. best combo kalo di paduin sama yang powder. apalagi spf nya gede banget, no worry deh. tinggal apply yang powder","29":"asli sih ini sunscreen ter ga ribet, impressed banget sama npure! makasih puol udah ciptain sunscreen powder ini. bawa kemana-mana praktis juga. bisa re-apply tiap saat. jadi ga perlu worried make-up kenapa-napa ya kan hehe. hasilnya matte finish juga","30":"ini adalah pertama kalinya gua coba pake product ini dan termyata sesuai ekspetasi. emng sunscreenya bagus bgt, kulit bener terlindungi dari sinar matahari. dan skrg ga perlu kawatir lagi klu pergi pergi, tinggal pakai dan ku bawa kemana mana","31":"bagus bget sih ini mana kandungan dan manfaatnya jga bagus bpom, halal, teruji secara dermatologis, bebas sls, bebas paraben, bebas minyak mineral, bebas alkohol, bebas alergen ue, bahan minimal, bebas pewangi jadi kalian wajib coba yaaa","32":"produknya the best banget karna ini powder udah ada spf 30nya jadi mudah untuk reapply berkali kali, teksturnya powdernya juga halus, warnanya natural di muka dan hasilnya matte, packagingnya jg aman bisa di bawa kmna mna😉 aku recomended banget pokoknya ❤️❤️❤️","33":"sun cream nya bagus banget karna spf 50++++ melindungi kita dari teriknya sinar matahari apalagi di siang siang itu bener bener panas banget dan bisa membuat kulit kusam bisa merah juga kan, setelah pake spf sun cream in bener-bener menjaga kulit kita dari paparan matahari melindungi banget trs bisa meng glowing kan muka kita juga tekstur nya ringan banget di wajah dan nyaman si menurut ku.🤗","34":"kaget banget ternyata sebagus itu. kulitku tuh kombinasi tapi masih aman banget gabikin berminyak cuma glowimg biasa aja terus gabuat kusam. cepet banget nyerepnya, bakal beli lagi ini mah wkwk padhaal harganya gamahal tapi kualitasnya oke banget","35":"produk nya super bagus, ini selain pigmen di wajah juga ada spf nya 30++ super bagus bukan. gak perlu repot-repot pakai sunscreen lagi bisa lgs ini 2in1 hihi. aku suka banget pakai ini kalian wajib coba sih 🥰","36":"bagusss bangett produknya, cocok untuk semua jenis kulit jugaa loh, nggaa lengket dikulitt teksturnya, dan harganyaa juga ramah kantong bgt😝 pokoknyaaaa aku rekomend bangettttt buat kalian beli produk inii skrng jugaaaaa yaaaa😍💗💗💗💗","37":"baru kali ini cocok pakai sunscreen😭 biasanya over oily, tapi ini tuh cepet bgt nyerepnya, no whitecast, trus udah gitu finishnya bener2 bikin kulit makin glowing dong omg😚 skrg jadi sunscreen addict bgt berkat npure cica beat the sun, wajib re-purchase sih iniii❤️","38":"n’pure cica beat the sun sunscreen ☀️ texturenya super light di kulit, nyaman dipake seharian, ga lengket, ga ninggalin whitecast, bikin muka jadi glowing tapi ga bikin greasy! ❤️ 💚 dengan spf 50 pa++++ sebagai uv filter agent nya, sunscreen ini bakal mem-protect kita dari paparan sinar uv a & uv b💚 kandungan 100% natural cica (centella asiatica) leaf water yang terdapat didalamnya juga bagus banget untuk menenangkan kulit kita setelah terpapar sinar matahari 💚 chrysanthemum extract, chamomilla extract, and camellia sinensis leaf extract didalamnya kaya akan antioksidan & anti-inflammatory, jadi bagus banget untuk kemerahan & meng-hidrasi kulit kita💚 bpom, halal, dermatologically tested, bumil busui friendly, free from : paraben, sls, mineral oil, alcohol, silicone, eu allergen & fragrance. recommended 🥰✨","39":"produk n'pure emang paling dabest sih. sunscreennya ini matte finish gitu, cocok banget buat aku yang males touch up dan reapply sunscreen pas lagi di luar rumah, hihi. kandungannya juga gausah diragukan lagi. worth to buy! 💚","40":"sukaaa banget deh sama produk n'pure yang satu ini cica beat the sun powder ✨ cocok banget buat aku yg mager banget kalo reapply sunscreen tapi semenjak ada produk ini aku gak mager lagi karena gampang banget di reapply nya, dengan tekstur nya yg powder dan praktis banget buat di reapply 😍 wajib banget sih punya produk n'pure yg satu ini 😍 thankyou n'pure ","41":"suka banget sama sunscreen dari npure, karena ga bikin kulit jadi berminyak, ga bikin whitecast, selain itu juga non paraben, non alkohol & non fragrance. cocok banget buat kulit sensitif kayak aku~ udah ada spf 50 pa ++++ lagi terbaikkk 🥺✨","42":"suka bangeeeet sama tekturnyaaa! aman buat wajahku yg sering jerawatan+bruntusan. gabikin iritasi, ga berat sama sekali, efeknya glowing bund 😆 aman ditimpa sama makeup juga. pas nge touch up juga enak banget walau diatas makeup tapi bisa menyerap kekulit. selalu di repurchase 💕","43":"senang bangettt akhirnya bisa nemuin suncreen yang gampang di apply berkali-kali tanpa harus hapus make-up duluuu, yg aku suka juga warna tekturnya tuh natural jadi cocok juga buat jenis kulit yang sawo matang kaya akuuu thank uuu n’pure😍","44":"suka banget sama sunscreen ini, awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong, ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan.","45":"suka banget sama sunscreen ini, awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong, ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan.","46":"bener2 recommended banget deh. cocok banget di mukaku spfnya juga tinggi dan ga buat muka aku kering sama ga ada efect putih nya di mukaku dan yang aku suka lagi harganya juga ga mahal deh dengan punya banyak manfaat untuk sunscream. bener2 suka banget deh pokoknya.","47":"ini produk yg wajib dipake. harus punya.... pokoknya suka banget pakai sunscreen n' pure ini.. bisa buat base makeup juga krna gak lengket di kulit trus cepet meresap.. harganya juga ramah dikantong... recomended deh pokoknya... next mau beli lagi...","48":"sudah sebulanan ini aku pakai cica beat the sun n'pure. teksturnya pas tidak terlalu kental dan tidak lengket, nyaman di kulit.. meresap cepat dan ada kandungan spf 50 pa++++ (cukup tinggi) serta di kulitku no whitecast! namun tips jika kulitmu berminyak, padukan dengan cica beat the sun powder yah!","49":"buat yang punya kulit kering pasti bakal suka sama produk ini, setelah dipake langsung auto glowing glass skin ala2 korea gitu tapi ga terasa lengket \/ greasy sama sekali. dan pastinya bikin kulit terasa lembab seharian. spf nya juga tinggi dan proteksi nya udh lengkap. cocok juga untuk dijadikan base makeup jdi lebih nempel dan mulus","50":"teksturnya ringan banget dengan hasil matte finish, penolong banget buat wajah aku yg oily ini, ada spf 30 nya pula😭 dan produknya juga praktis dibawa kemana\" dan bentuknya juga praktis banget gk ribet kalo mau reaply❤","51":"the finish looks good on my combi to dry skin! kalo pake ss emang suka yg glowwy finish dan ini ga bikin gerah sama sekaliii, gampang di blend jugaa dan minim oksidasii, tapi kayaknya oil controlnya kurang, tapi apply 3 kali sehari sekali udah enak banget, bakal repurchase sih!","52":"aaaaaa akhirnya ga worry lagi kalo lagi makeup harus reapply sunscreen, sangat amat membantu aku yang kerjanya makeup tapi ttp terpapar matahari. yang kerennya lagi, selain doi memproteksi kulit dari efek uva uvb, bisa sekalian touch up, makeup jadi matte dan flawless. must try❤️","53":"aku suka sama sunscreen ini😍 teksturnya gampang menyerap gak kental dan gak berat. overall aku cocok, biasanya kalo gak cocok aku akan timbul jerawat, tapi ini gak, aku ngerasa juga wajah aku tetap terasa lembab💕 terus package nya juga aku suka di ujung buka tutup nya bentuknya kayak plastik bening gitu yang buat jd unik aja. gak tau pertama kali liat langsung wah lucu hehe🤗💕💕","54":"ini highly recommended sih. buat daily enak bgt simple, dipakenya ga ribet mana teksturnya enak bgt ringan😭🤍 asli muka aku biasanya jam 12an gt udh oily, dipakein ini langsung nge-set lagi kaya baru pake make up🥲🤍","55":"selama pake produk ini , aku ngerasa kulit ku terlindungi ,,, karena jujur kulitku tipe yang suka sakit dan kemerahan disaat kena sinar matahari, dan karena kebanyakan sunscreen bertexture creamy bkin aku susah meratakan creamnya diwajah dan bkin sakit akhirnya aku stop pake, tapi setelah pake n'pure aku gak lagi khawatir karena lbh cepat meresap dan cpt bekerja di kulit wajah aku","56":"gilakkk sih produknya bagus bgt udah spf 50 pa+++ selain itu dri packagingnya simple bgt buat di bawa kemana2 kesan pertama pakai langsung memberi efek glowing pada kulitku serta teksturnya ringan bgtt. fix produknya npure emang bagus2 bgt apalagi yang cica beat the sun powder ini kalian harus cobaaaa 👍","57":"terima kasih bgt buat n'pure yg sudah bikin produk ini karena reapply sunscreen jadi mudah. suka bgt sama sunscreen ini & pas buat aku yg suka pake makeup. finish-nya matte, nggak geser makeup & gampang bgt pakenya.","58":"nyaman digunain, bikin glowing diwajah gak kering dan adem di kulit. wajib dipake buat klian yg sering aktifitas di luar ruangan haruuus bgt ini buat perlindungan yaaaaaaaaaaaaa😍😍😍😍😍😍😍😍😍😍😍😍😍","59":"pertama kali coba sunscreen versi powder hasilnya matte dan natural, biasanya aku pakai di akhir setelah skincare-an atau makeup, selama 2 minggu kulitku ga menimbulkan reaksi negatif alias cocok. super suka sama kemasannya yang unik, ringan dan praktis bisa di bawa kemana aja.","60":"yayyy! akhirnya aku nemuin sunscreen yang cocok banget di kulit aku! mudah di aaplikasikan, mudah di blend dan tidak lengket sama sekali! sunscreen ini alcohol free loh jadi aman banget untuk kulit sensitif seperti kulitku😭💖💖💖💖 bakal beli lagi sih kalo udah habis💖","61":"aku udah pake produk ini sekitar 2 bulan lebih. teksturnya aga sedikit cair gampang banget buat diblend dan yang paling aku suka itu adalah bikin muka jadi glowing banget.dan tentunya karena aman buat jerawat makanya aku cinta banget sama produk ini","62":"iiiii mampuy suka bgt sama sunscreen ini, bener2 nyaman di pakenya dan bikin wajah keliatan glowing sehat cerah 😍 teksturnya rada cair dan mudah di applikasiin. setiap pake ini ak ngerasa dia lumayan ada efek tone up tp ga bikin muka abu2 👌🏻 suka nih kalo cocok sama produk2 lokal, harganya jg masi masuk akal sesuai kualitas.","63":"5.0\nsunscreen terbaik menurut aku, dia gak bikin kulit berminyak gitu setelah diapply, trus gak bikin muka kita cepet minyakan, enak juga cepat meresap.. packagingnya praktis dan bisa dibawa kemana aja. rekomen banget pokoknyaaa...harganya juga terjangkau . manfaatnya juga juara","64":"omg ini sunscreen terlembut yang pernah aku coba enak banget dikulit aku bikin kulit wajah aku lembab jujur suncreen npure cica beat the sun ini bagus banget dong melindungi dari sinar matahari apa lagi aku banyak banget kegiatan diluar sebelum aku beraktifitas aku pake dulu next abis mau beli lagi😍","65":"pengalaman pertamaku pake sunscreem powder dari n pure ini tuh bener bener sukaa banget , karna baru kali ini nemuin produk sunscreen yg powder dengan kemasan praktis untuk dibawa traveling. uda dilengkapi juga dengan spf 30 dan bisa dipake sebagai step ke 2 setelah sunscreen creamnya. mantul banget deh","66":"lucu bgt sunscreen powder 😍 packagingnya retractable & aplikator brushnya lembut bgt! warnanya beige tapi ga merubah warna kulit malah bikin kulit makin cerah 😍 simple lagi kalo mau touch up tinggal tap puter2 kaya pake blussh on 😍 harganya jg affordable 💯","67":"wow sumpah pertama kalinya cobain sunscreen bentuk powder!! so far i luv this product so much! pertama untuk packagingnya retractable dan brushnya soft bangettt. untuk tekstur sedikit powder but its okay bcs finishnya matte natural and no whitecast. sun powder ini juga tetep menghidrasi kulit walau finishnya matte. luv it🥰","68":"baru pertama kali nyobain sun powder dan menurut aku feelsnya sama aja kayak kita pake loose powder gitu. finishnya matte tapi di kulitku yg medium light dia ga kelihatan dempul dan jatuhnya natural banget, nyatu ke warna kulit asli. butirannya super halus dan kuasnya juga jd ga buat muka terasa kegores. kemasannya super mini jadi enak buat dibawa kemana-mana. sayangnya karna dia sun powder, jd kurang efektif klw dipake single aja, harus pake sunscreen lotion dlu... jadi jatuhnya produk ini tuh kayak ngeset riasan di bawahnya ama maksimalin proteksi. lebh cocok dipake buat reapply apalagi pas makeup, jd ga takut makeupnya tergeser. so far aman aja sih di kulit aku dan worth to try👌 tp krna harganya lumayan out of my budget, aku prefer belinya pas promo aja wkwk","69":"seneng banget akhirnya nemu sunscreen powder yg slama ini aku cari2 ternyata npure punya produknya doomss ..sumpah ini bagus banget cocok banget dikulit aku yg super duper sensitif ..huhhh popoknya ini recomended deehhh...","70":"baru kali ini punya sunscreen dalam bentuk powder apalagi aplikatornya brush. dan suka banget. apalagi pas pakai makeup, reapply jadi lebih praktis. matte finish dan bisa mengontrol minyak berlebih di wajah","71":"pertama kali cobain sunscreen dan langsung suka 🥺 pas di blend bener-bener nyerap ke kulit dan bikin glowing dong , ringan juga di wajah , ini cocok banget buat yg dry skin ya soalnya habis pakai sunscreen npure ini wajahku jadi lembab , suka 💕","72":"suka banget sama sun powdernya, pacakgingnya kuat udah beberapa kali jatoh tapi masih kuat ga rusak untungnya, trus juga hasilnya matte bagus gitu ga ngegeser makeup sama skali sih.. trus efisien banget juga jadinya seneng dibawa kemana2","73":"pertama kali beli karena sering banget lewat fyp t*kt*k aku, awal pemakaian ternyata ringan, gak ada whitecast, gak lengket juga. nyaman banget dipake, gak bikin wajah tambah minyakan karena jenis kulitku yang oily masih aman dan nyaman dipake.","74":"baru kali ini cobain sun screen powder dari npure, dan kayanya baru npure yang keluarin produk kaya gini😍 emang bagus banget sih, bkn muka ga lepek dn lengket lgi klo diluar rumah , packagingnnya jg lucu gampang dibawa kemana2 ga makan tempat.❤️","75":"ini powder yang terdebest banget sih menurutku. selain ada spf nya, powder ini waktu di apply ke wajah tekstur nya ringan sama sekali dan ngurangin minyak diwajah jugaaa. apalagi aku emang dari pagi s\/d sore aktivitasnya diluar teruuussssss. kemasannya yang minimalis, bikin jadi gampang dibawa kemana-mana🥰 bakalan jadi powder fav aku sih ini❤️‍🔥","76":"n'pure cica beat the sun powder ini cocok banget untuk kulit yang berminyak seperti aku. seperti yang kita tau, re-apply sunscreen itu penting banget apalagi kalo sering kegiatan di outdoor.\nproduk ini praktis banget sih karna gampang banget dibawa kemana-mana juga pas di re-apply mudah banget karna tinggal diusap di wajah dan sekalipun muka kita masih ada make-up nya,tidak buat make-up kita bergeser🥰untuk packaging nya, sunscreen powder dari n’pure ini dikemas dalam tabung plastik mini berwarna hijau emerald. bagian bawah tabungnya bening sehingga sunscreen powder-nya kelihatan. bagian atas tabung disambungkan dengan brush (kuas) warna cream. kuas ini lembut banget, sehingga mudah digunakan untuk seluruh bagian wajah. kandungan dalam produk ini terdiri dari ada titanium dioxide, ethylhexyl salicylate, ethylhexyl methoxycinnamate, natural centella asiatica leaf water, rice bran oil dan vitamin e. dan produk ini memiliki beragam manfaaf, yaitu memberi perlindungan maksimal terhadap efek buruk sinar matahari pada kulit wajah, dapat menangkal sinar uva maupun uvb secara efektif yang berpotensi dapat merusak kulit, dapat melindungi kulit dari kerusakan karena paparan sinar matahari salah satunya yaitu sunburn, dapat menenangkan kulit setelah beraktivitas di bawah sinar mataharini, dan untuk menghidrasi dan menutrisi kulit wajah secara maksimal. n'pure cica beat the sun powder ini bersifat non-comedogenic, jadi aman untuk kamu yang punya kulit sensitif.😍","77":"sesuka itu sama powder dari n’pure , favorite banget sih inimah , teksturnya juga lembut gtuh loh ,cocok banget buat kulit berminyak kaya aku , garibet dibawa kemana sesimple itu , pokoknya aku sih suka banget 😍 emng deh produk n’pure gapernah gagal ❤️","78":"aku nyobain ini karena fyp mulu kan di tiktok. nah penasaran aku langsung beli... kaget juga ada sunscreen bentuk powder, pertama kali make seneng banget karena gaperlu hapus makeup sih kalau mau reapply sunscreen lagi, hasilnya matte di muka aku bisa banget buat ngunci minyakkk dan makeup tetap on pointtt, terus praktis buat dibawa kemana mana, cara makenya sempet bingung tapi liat video video tutorial jadi bisa sih... ini sunscreen membantu aku bangettt buat sehari hariii❤️😍","79":"teksturnya agak cair, warna putih standar produk sunscreen, cepat menyerap, baunya hampir gada, agak whitecast di awalnya jadi diratain aja. sering dibiarin sampe 14 jam dan muka agak berminyak. tapi overall tidak mengecewakan sih...","80":"akhirnya beli produk ini pas banget lagi sale juga di e-commerce. niat beli produk ini emang buat reapply sunscreen through out the day. buat temen temen yang mau pake pastiin jangan pake produk ini sendirian jadi tetep harus pake sunscreen dan bisa di set lagi pake ini. jadi produk ini emang diperuntukan buat reapply sunscreen yang mudah banget sihhh","81":"sun powder dari n'pure ini bagus bangett, gaboong deh. teksturnya lembut bgt dan benerbener melindungi kulit dari paparan sinar matahari, jadi kalo males pake sunscreen biasa bisa langsung pake ini yg super praktisss❤️❤️ sukak pwoll pokonya","82":"waw sumpah si ini sunscreen yang bener bener bagus banget, pertama kali nyoba emang langsung cocok di muka aku😍selain itu tekstur nya itu ringan dan cepat meresap di kulit dan juga sekali pake muka aku langsung glowing, beuh pokonya cinta banget sama sunscreen yang ini❤😍","83":"n'pure cica beat the sun powder ini bener-bener menjawab kebingunganku kalau harus re-apply sunscreen dengan kondisi wajah bermakeup. tekstur powdernya halus & nggak menyumbat pori ataupun menimbulkan jerawat. tanpa whitecast, ringan di kulit dan menyerap minyak.","84":"suka sama teksturnya powder dan aplikatornya brush. ada spf 30nya, membantu perlindungan uva\/uvb. recomendded! dan wajib direapply setiap dua jam sekali. jadi pengen beli lagi kalo ini dah habis hehe. i love it sama npure produknya bagus².","85":"aku agak pemilih kalo urusan sunscreen. soalnya biasanya sunscreen itu lengket dan bikin ga nyaman. tapi ini beda. toner ini ga terlalu lengket, cepet ngeresap, ga bikin berasa pakai dempul juga. dan yg paling penting ga nyumbat pori dan spf tinggi. tubenya juga lucu.","86":"cocok banget untuk melindungi kulit dari paparan sinar matahari karena mengandung kandungan utama spf terus yang aku suka dia ga geser makeup di wajah jadi aman banget untuk ditimpa diatas makeup, selain itu karena dia bentuk powder bisa bantu matte in makeup yang terlalu dewy \/ oily.","87":"suka banget dengan inovasi sekeren ini. gak perlu lagi buat bingung untuk really sunscreen sekaligus touchup make up. spf nya 30 juga seneng banget. kalau reapply sunscreen bikin tetep stay flawless dan masih bikin cantik. mulifungsi banget, suka banget dah","88":"bagi aku dia bener bener unique because bayangin aja sunscrren sama bedak bisa jadi satu...dan yang lebih bagusnya lagi dia gabikin kukit bruntusan dan pas di apply dia gabikin kulit kita kliatan kayak berminyak gitu. ooo ya aku saranin nih kalian wajib touch up 2 jam sekali","89":"sumpah unik banget sunscreenya bentuk bedak gituu dan ada kuasnyaa apalagi spf 30 persenn mantul banget, di apkenya gk ribet dan bisa di apply berulangkali hehehhe kalian semua wajib punya karena praktis banget kaya pake bedak rekomen dan harganya terjangkau prahhhh","90":"pertama kali nyobain dan ternyata cocok di aku, ga bikin kusam padahal warnanya sedikit gelap dari kulitku hehe dan hasilnya matte aku suka bangetttt. trus kemasannya juga praktis cuman harus berkali kali gitu biar kliatan pake bedaknya hehehe","91":"sunscreen ternyaman yg pernahh aku cobainn sii guyss, dengan tekstur yang superrr ringann poll ga susah pokoknya di blend nyaa, sudah bpom no alcohol dan no fragrancee the bestttttttt ✅✅✅😊😊😊😊😊😊😊😊😊❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥💘❤️‍🔥💘💘❤️‍🔥❤️‍🔥❤️‍🔥💘❤️‍🔥❤️‍🔥💘❤️‍🔥💘💘💘💘💘","92":"pertama kali nyobain sunscreen yang bentuknya powder aku sukaaa ini sih soalnya gampang di bawa kemana mana apa lagi buat reapply sunscreen pas udah makeup .menurut ku ini bneran bagusss jadinya makeup ga geser udah gitu bisa ngontrol minyak jugaaa","93":"suka banget sama produk ini karena powdernya ringan banget di kulit. cara pakainya juga mudah, hasil akhirnya di kulitku matte dan lumayan tahan lama. kuasnya juga bagus, lembut, dan ga mudah rontok. jadi gampang banget re apply sunscreen","94":"baru kali ini nyobain sunscreen powder yang ringan membantu menyerap minyak berlebih, meminimalkan tampilan pori-pori,sekaligus mengurangi kilau minyak.jadi gak perlu hapus makeup lagi jika mau apply sunscreen ❤️❤️❤️","95":"ini sunscreen paling cocok buat aku yang kulit sensitive, ga lengket, ge bikin berminyak, dan ringan banget di wajah. seriuss ini aku bakal repeat order ini terus kayanya karna secocok itu sama muka aku😩🤍 love banget sama cica beat te sun🤍🤍🤍","96":"bagus bangethdjdhdjjdjdjjsjdjdhhdhshshshshshshshshshsheheehhehehehdb jsjsjdjejej jejejejejjeje jejejejejejdjjd jejejejejejejejejjejeje jejejejejjeiee jejejejejeje jejejekekekkjejeejjeej nsjejejejejej jejejejejej","97":"powder suncreen pertama yang aku cobaa. sekali coba langsung ketagihan wkwk. soalnya cocok di kulit aku, suka sama teksturnya lembut dan ringan. finish looknya matte tapi tetep natural. luv banget! xx","98":"akhirnya nemuin sunscreen super simple, garibet buat ngeapply, selain itu tekstur powdernya halus banget, seworth itu, ini bakalan jadi sunscreean andalang aku, thnk u n’pure udah ngeluarin produk cica beat the sun powder ini, cocok banget di aku yang super mager.","99":"demi apa sihh produk dr npure satu ini bener² baguss bgt.. buat ngatasin jerawat² aku yg sukaaa lama bgt sembuhnya.. cintaaa bgt sma produk ini..\nrecommended bgt buat kalian nihhhhh... jerawat bisa bener² kering dalam waktu yg lebih cepat","100":"sukaaa suka sukaa bangett , hasilnya ga whitecast cepet nyerep dan ga buat wajah berminyaak \/lengket smaa sekalii , buat re apply jg okee bangett , harganyaa murah jgg 😍😍😍 superr recomended buat yg cari sunscreen no white cast , ga buat berminyak","101":"buat kalian yang punya kulit jerawatan merah2 sini banget lah kalian wajib cobain sunscreen satu ini. dia ga ada bau sma skali teksturnya cukup ringan & ga bikin risih lengket gitu finishnya kalian ga usah takut makeuo rusak pas mo re-aplly sunscreen krena ini gampang bngt di blend & cepat menyerap di kulit 🥰😍","102":"sukaa bgtt sama sunscreen dari n'pure cica beat the sun ini. tekstur nya juga gampang di blend, gampang jugaa meresap dan ga lengket sama sekali.sudah bpom ,aman buat bu sui serta bebas dari bahan bahan berbahayaaa, udah spf 50+++ jugaa lohh😍💖💖💖","103":"honest review dari aku ini sunscreen termasuk sunscreen yang unik banget karena bentuknya itu powder jadi memudahkan aku untuk re-touch make up, lumayan tahan lama dan tahan minyak, packagingnya juga simple dan mudah dibawa kemana mana","104":"packaging nya bagus, lucu dan mudah dibawa kemana-mana, jadi ga ribet 😘 tekturnya cream, ringan, ga bikin whitecast jdi ga ngedempul, gampang ngresap. hasil akhirnya glowing, cocok untuk semua jenis kulit. harganya juga affordable, bagus banget produknyaa ❤️❤️","105":"pliss ini sunscreen unik banget, apalagi aplikatornya brush yang memudahkan untuk re-apply dan touch up. hasil akhirnya matte dan lumayan tahan minyak, sesuai klaimnya aku re-apply setiap 2 jam sekali walaupun langsung aku timpa dia ga bikin wajah kusam.","106":"bagus bgt!!akhirnya bisa kebeli juga ini sunscreen😭 ngerasa beruntusan ilang dan glowing aja pake inituh bukan yang minyakan, cocok bgt buat kulit wajah aku yang normal to dry. kaget pas beres ngeapply si cica beat sun ini, trs lanjut tone up cream, yang biasanya tone upnya susah diblend numpuk putih gitu skrg gampang bgt blendnya jadi rata putih glowing berkat si sunscreen ini😭❤ suka bgttttt","107":"suka banget pake sunscreen dari npure cica beat the sun krna bagus banget terlihat kerutan bekurang dan tambah cerah wajah setelah rutin pakai produk ini .. ga bikin lengket dan berminyak jg wajah setelah memakai rangkaian skincare lain","108":"sebelum pake yang powder aku pake yang ini dulu. setelah aku pake ga berat dan ga ninggalin whitecast sih. jadi ringan dan cepat menyerap gitu. best combo kalo di paduin sama yang powder. apalagi spf nya gede banget, no worry deh. tinggal apply yang powder","109":"asli sih ini sunscreen ter ga ribet, impressed banget sama npure! makasih puol udah ciptain sunscreen powder ini. bawa kemana-mana praktis juga. bisa re-apply tiap saat. jadi ga perlu worried make-up kenapa-napa ya kan hehe. hasilnya matte finish juga","110":"ini adalah pertama kalinya gua coba pake product ini dan termyata sesuai ekspetasi. emng sunscreenya bagus bgt, kulit bener terlindungi dari sinar matahari. dan skrg ga perlu kawatir lagi klu pergi pergi, tinggal pakai dan ku bawa kemana mana","111":"bagus bget sih ini mana kandungan dan manfaatnya jga bagus bpom, halal, teruji secara dermatologis, bebas sls, bebas paraben, bebas minyak mineral, bebas alkohol, bebas alergen ue, bahan minimal, bebas pewangi jadi kalian wajib coba yaaa","112":"produknya the best banget karna ini powder udah ada spf 30nya jadi mudah untuk reapply berkali kali, teksturnya powdernya juga halus, warnanya natural di muka dan hasilnya matte, packagingnya jg aman bisa di bawa kmna mna😉 aku recomended banget pokoknya ❤️❤️❤️","113":"sun cream nya bagus banget karna spf 50++++ melindungi kita dari teriknya sinar matahari apalagi di siang siang itu bener bener panas banget dan bisa membuat kulit kusam bisa merah juga kan, setelah pake spf sun cream in bener-bener menjaga kulit kita dari paparan matahari melindungi banget trs bisa meng glowing kan muka kita juga tekstur nya ringan banget di wajah dan nyaman si menurut ku.🤗","114":"kaget banget ternyata sebagus itu. kulitku tuh kombinasi tapi masih aman banget gabikin berminyak cuma glowimg biasa aja terus gabuat kusam. cepet banget nyerepnya, bakal beli lagi ini mah wkwk padhaal harganya gamahal tapi kualitasnya oke banget","115":"produk nya super bagus, ini selain pigmen di wajah juga ada spf nya 30++ super bagus bukan. gak perlu repot-repot pakai sunscreen lagi bisa lgs ini 2in1 hihi. aku suka banget pakai ini kalian wajib coba sih 🥰","116":"bagusss bangett produknya, cocok untuk semua jenis kulit jugaa loh, nggaa lengket dikulitt teksturnya, dan harganyaa juga ramah kantong bgt😝 pokoknyaaaa aku rekomend bangettttt buat kalian beli produk inii skrng jugaaaaa yaaaa😍💗💗💗💗","117":"baru kali ini cocok pakai sunscreen😭 biasanya over oily, tapi ini tuh cepet bgt nyerepnya, no whitecast, trus udah gitu finishnya bener2 bikin kulit makin glowing dong omg😚 skrg jadi sunscreen addict bgt berkat npure cica beat the sun, wajib re-purchase sih iniii❤️","118":"n’pure cica beat the sun sunscreen ☀️ texturenya super light di kulit, nyaman dipake seharian, ga lengket, ga ninggalin whitecast, bikin muka jadi glowing tapi ga bikin greasy! ❤️ 💚 dengan spf 50 pa++++ sebagai uv filter agent nya, sunscreen ini bakal mem-protect kita dari paparan sinar uv a & uv b💚 kandungan 100% natural cica (centella asiatica) leaf water yang terdapat didalamnya juga bagus banget untuk menenangkan kulit kita setelah terpapar sinar matahari 💚 chrysanthemum extract, chamomilla extract, and camellia sinensis leaf extract didalamnya kaya akan antioksidan & anti-inflammatory, jadi bagus banget untuk kemerahan & meng-hidrasi kulit kita💚 bpom, halal, dermatologically tested, bumil busui friendly, free from : paraben, sls, mineral oil, alcohol, silicone, eu allergen & fragrance. recommended 🥰✨","119":"produk n'pure emang paling dabest sih. sunscreennya ini matte finish gitu, cocok banget buat aku yang males touch up dan reapply sunscreen pas lagi di luar rumah, hihi. kandungannya juga gausah diragukan lagi. worth to buy! 💚","120":"sukaaa banget deh sama produk n'pure yang satu ini cica beat the sun powder ✨ cocok banget buat aku yg mager banget kalo reapply sunscreen tapi semenjak ada produk ini aku gak mager lagi karena gampang banget di reapply nya, dengan tekstur nya yg powder dan praktis banget buat di reapply 😍 wajib banget sih punya produk n'pure yg satu ini 😍 thankyou n'pure ","121":"suka banget sama sunscreen dari npure, karena ga bikin kulit jadi berminyak, ga bikin whitecast, selain itu juga non paraben, non alkohol & non fragrance. cocok banget buat kulit sensitif kayak aku~ udah ada spf 50 pa ++++ lagi terbaikkk 🥺✨","122":"suka bangeeeet sama tekturnyaaa! aman buat wajahku yg sering jerawatan+bruntusan. gabikin iritasi, ga berat sama sekali, efeknya glowing bund 😆 aman ditimpa sama makeup juga. pas nge touch up juga enak banget walau diatas makeup tapi bisa menyerap kekulit. selalu di repurchase 💕","123":"senang bangettt akhirnya bisa nemuin suncreen yang gampang di apply berkali-kali tanpa harus hapus make-up duluuu, yg aku suka juga warna tekturnya tuh natural jadi cocok juga buat jenis kulit yang sawo matang kaya akuuu thank uuu n’pure😍","124":"suka banget sama sunscreen ini, awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong, ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan.","125":"suka banget sama sunscreen ini, awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong, ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan.","126":"bener2 recommended banget deh. cocok banget di mukaku spfnya juga tinggi dan ga buat muka aku kering sama ga ada efect putih nya di mukaku dan yang aku suka lagi harganya juga ga mahal deh dengan punya banyak manfaat untuk sunscream. bener2 suka banget deh pokoknya.","127":"ini produk yg wajib dipake. harus punya.... pokoknya suka banget pakai sunscreen n' pure ini.. bisa buat base makeup juga krna gak lengket di kulit trus cepet meresap.. harganya juga ramah dikantong... recomended deh pokoknya... next mau beli lagi...","128":"sudah sebulanan ini aku pakai cica beat the sun n'pure. teksturnya pas tidak terlalu kental dan tidak lengket, nyaman di kulit.. meresap cepat dan ada kandungan spf 50 pa++++ (cukup tinggi) serta di kulitku no whitecast! namun tips jika kulitmu berminyak, padukan dengan cica beat the sun powder yah!","129":"buat yang punya kulit kering pasti bakal suka sama produk ini, setelah dipake langsung auto glowing glass skin ala2 korea gitu tapi ga terasa lengket \/ greasy sama sekali. dan pastinya bikin kulit terasa lembab seharian. spf nya juga tinggi dan proteksi nya udh lengkap. cocok juga untuk dijadikan base makeup jdi lebih nempel dan mulus","130":"teksturnya ringan banget dengan hasil matte finish, penolong banget buat wajah aku yg oily ini, ada spf 30 nya pula😭 dan produknya juga praktis dibawa kemana\" dan bentuknya juga praktis banget gk ribet kalo mau reaply❤","131":"the finish looks good on my combi to dry skin! kalo pake ss emang suka yg glowwy finish dan ini ga bikin gerah sama sekaliii, gampang di blend jugaa dan minim oksidasii, tapi kayaknya oil controlnya kurang, tapi apply 3 kali sehari sekali udah enak banget, bakal repurchase sih!","132":"aaaaaa akhirnya ga worry lagi kalo lagi makeup harus reapply sunscreen, sangat amat membantu aku yang kerjanya makeup tapi ttp terpapar matahari. yang kerennya lagi, selain doi memproteksi kulit dari efek uva uvb, bisa sekalian touch up, makeup jadi matte dan flawless. must try❤️","133":"aku suka sama sunscreen ini😍 teksturnya gampang menyerap gak kental dan gak berat. overall aku cocok, biasanya kalo gak cocok aku akan timbul jerawat, tapi ini gak, aku ngerasa juga wajah aku tetap terasa lembab💕 terus package nya juga aku suka di ujung buka tutup nya bentuknya kayak plastik bening gitu yang buat jd unik aja. gak tau pertama kali liat langsung wah lucu hehe🤗💕💕","134":"ini highly recommended sih. buat daily enak bgt simple, dipakenya ga ribet mana teksturnya enak bgt ringan😭🤍 asli muka aku biasanya jam 12an gt udh oily, dipakein ini langsung nge-set lagi kaya baru pake make up🥲🤍","135":"selama pake produk ini , aku ngerasa kulit ku terlindungi ,,, karena jujur kulitku tipe yang suka sakit dan kemerahan disaat kena sinar matahari, dan karena kebanyakan sunscreen bertexture creamy bkin aku susah meratakan creamnya diwajah dan bkin sakit akhirnya aku stop pake, tapi setelah pake n'pure aku gak lagi khawatir karena lbh cepat meresap dan cpt bekerja di kulit wajah aku","136":"gilakkk sih produknya bagus bgt udah spf 50 pa+++ selain itu dri packagingnya simple bgt buat di bawa kemana2 kesan pertama pakai langsung memberi efek glowing pada kulitku serta teksturnya ringan bgtt. fix produknya npure emang bagus2 bgt apalagi yang cica beat the sun powder ini kalian harus cobaaaa 👍","137":"nyaman digunain, bikin glowing diwajah gak kering dan adem di kulit. wajib dipake buat klian yg sering aktifitas di luar ruangan haruuus bgt ini buat perlindungan yaaaaaaaaaaaaa😍😍😍😍😍😍😍😍😍😍😍😍😍","138":"terima kasih bgt buat n'pure yg sudah bikin produk ini karena reapply sunscreen jadi mudah. suka bgt sama sunscreen ini & pas buat aku yg suka pake makeup. finish-nya matte, nggak geser makeup & gampang bgt pakenya.","139":"pertama kali coba sunscreen versi powder hasilnya matte dan natural, biasanya aku pakai di akhir setelah skincare-an atau makeup, selama 2 minggu kulitku ga menimbulkan reaksi negatif alias cocok. super suka sama kemasannya yang unik, ringan dan praktis bisa di bawa kemana aja.","140":"yayyy! akhirnya aku nemuin sunscreen yang cocok banget di kulit aku! mudah di aaplikasikan, mudah di blend dan tidak lengket sama sekali! sunscreen ini alcohol free loh jadi aman banget untuk kulit sensitif seperti kulitku😭💖💖💖💖 bakal beli lagi sih kalo udah habis💖","141":"aku udah pake produk ini sekitar 2 bulan lebih. teksturnya aga sedikit cair gampang banget buat diblend dan yang paling aku suka itu adalah bikin muka jadi glowing banget.dan tentunya karena aman buat jerawat makanya aku cinta banget sama produk ini","142":"iiiii mampuy suka bgt sama sunscreen ini, bener2 nyaman di pakenya dan bikin wajah keliatan glowing sehat cerah 😍 teksturnya rada cair dan mudah di applikasiin. setiap pake ini ak ngerasa dia lumayan ada efek tone up tp ga bikin muka abu2 👌🏻 suka nih kalo cocok sama produk2 lokal, harganya jg masi masuk akal sesuai kualitas.","143":"5.0\nsunscreen terbaik menurut aku, dia gak bikin kulit berminyak gitu setelah diapply, trus gak bikin muka kita cepet minyakan, enak juga cepat meresap.. packagingnya praktis dan bisa dibawa kemana aja. rekomen banget pokoknyaaa...harganya juga terjangkau . manfaatnya juga juara","144":"omg ini sunscreen terlembut yang pernah aku coba enak banget dikulit aku bikin kulit wajah aku lembab jujur suncreen npure cica beat the sun ini bagus banget dong melindungi dari sinar matahari apa lagi aku banyak banget kegiatan diluar sebelum aku beraktifitas aku pake dulu next abis mau beli lagi😍","145":"pengalaman pertamaku pake sunscreem powder dari n pure ini tuh bener bener sukaa banget , karna baru kali ini nemuin produk sunscreen yg powder dengan kemasan praktis untuk dibawa traveling. uda dilengkapi juga dengan spf 30 dan bisa dipake sebagai step ke 2 setelah sunscreen creamnya. mantul banget deh","146":"lucu bgt sunscreen powder 😍 packagingnya retractable & aplikator brushnya lembut bgt! warnanya beige tapi ga merubah warna kulit malah bikin kulit makin cerah 😍 simple lagi kalo mau touch up tinggal tap puter2 kaya pake blussh on 😍 harganya jg affordable 💯","147":"wow sumpah pertama kalinya cobain sunscreen bentuk powder!! so far i luv this product so much! pertama untuk packagingnya retractable dan brushnya soft bangettt. untuk tekstur sedikit powder but its okay bcs finishnya matte natural and no whitecast. sun powder ini juga tetep menghidrasi kulit walau finishnya matte. luv it🥰","148":"baru pertama kali nyobain sun powder dan menurut aku feelsnya sama aja kayak kita pake loose powder gitu. finishnya matte tapi di kulitku yg medium light dia ga kelihatan dempul dan jatuhnya natural banget, nyatu ke warna kulit asli. butirannya super halus dan kuasnya juga jd ga buat muka terasa kegores. kemasannya super mini jadi enak buat dibawa kemana-mana. sayangnya karna dia sun powder, jd kurang efektif klw dipake single aja, harus pake sunscreen lotion dlu... jadi jatuhnya produk ini tuh kayak ngeset riasan di bawahnya ama maksimalin proteksi. lebh cocok dipake buat reapply apalagi pas makeup, jd ga takut makeupnya tergeser. so far aman aja sih di kulit aku dan worth to try👌 tp krna harganya lumayan out of my budget, aku prefer belinya pas promo aja wkwk","149":"seneng banget akhirnya nemu sunscreen powder yg slama ini aku cari2 ternyata npure punya produknya doomss ..sumpah ini bagus banget cocok banget dikulit aku yg super duper sensitif ..huhhh popoknya ini recomended deehhh...","150":"baru kali ini punya sunscreen dalam bentuk powder apalagi aplikatornya brush. dan suka banget. apalagi pas pakai makeup, reapply jadi lebih praktis. matte finish dan bisa mengontrol minyak berlebih di wajah","151":"suka banget sama sun powdernya, pacakgingnya kuat udah beberapa kali jatoh tapi masih kuat ga rusak untungnya, trus juga hasilnya matte bagus gitu ga ngegeser makeup sama skali sih.. trus efisien banget juga jadinya seneng dibawa kemana2","152":"pertama kali cobain sunscreen dan langsung suka 🥺 pas di blend bener-bener nyerap ke kulit dan bikin glowing dong , ringan juga di wajah , ini cocok banget buat yg dry skin ya soalnya habis pakai sunscreen npure ini wajahku jadi lembab , suka 💕","153":"pertama kali beli karena sering banget lewat fyp t*kt*k aku, awal pemakaian ternyata ringan, gak ada whitecast, gak lengket juga. nyaman banget dipake, gak bikin wajah tambah minyakan karena jenis kulitku yang oily masih aman dan nyaman dipake.","154":"baru kali ini cobain sun screen powder dari npure, dan kayanya baru npure yang keluarin produk kaya gini😍 emang bagus banget sih, bkn muka ga lepek dn lengket lgi klo diluar rumah , packagingnnya jg lucu gampang dibawa kemana2 ga makan tempat.❤️","155":"ini powder yang terdebest banget sih menurutku. selain ada spf nya, powder ini waktu di apply ke wajah tekstur nya ringan sama sekali dan ngurangin minyak diwajah jugaaa. apalagi aku emang dari pagi s\/d sore aktivitasnya diluar teruuussssss. kemasannya yang minimalis, bikin jadi gampang dibawa kemana-mana🥰 bakalan jadi powder fav aku sih ini❤️‍🔥","156":"n'pure cica beat the sun powder ini cocok banget untuk kulit yang berminyak seperti aku. seperti yang kita tau, re-apply sunscreen itu penting banget apalagi kalo sering kegiatan di outdoor.\nproduk ini praktis banget sih karna gampang banget dibawa kemana-mana juga pas di re-apply mudah banget karna tinggal diusap di wajah dan sekalipun muka kita masih ada make-up nya,tidak buat make-up kita bergeser🥰untuk packaging nya, sunscreen powder dari n’pure ini dikemas dalam tabung plastik mini berwarna hijau emerald. bagian bawah tabungnya bening sehingga sunscreen powder-nya kelihatan. bagian atas tabung disambungkan dengan brush (kuas) warna cream. kuas ini lembut banget, sehingga mudah digunakan untuk seluruh bagian wajah. kandungan dalam produk ini terdiri dari ada titanium dioxide, ethylhexyl salicylate, ethylhexyl methoxycinnamate, natural centella asiatica leaf water, rice bran oil dan vitamin e. dan produk ini memiliki beragam manfaaf, yaitu memberi perlindungan maksimal terhadap efek buruk sinar matahari pada kulit wajah, dapat menangkal sinar uva maupun uvb secara efektif yang berpotensi dapat merusak kulit, dapat melindungi kulit dari kerusakan karena paparan sinar matahari salah satunya yaitu sunburn, dapat menenangkan kulit setelah beraktivitas di bawah sinar mataharini, dan untuk menghidrasi dan menutrisi kulit wajah secara maksimal. n'pure cica beat the sun powder ini bersifat non-comedogenic, jadi aman untuk kamu yang punya kulit sensitif.😍","157":"sesuka itu sama powder dari n’pure , favorite banget sih inimah , teksturnya juga lembut gtuh loh ,cocok banget buat kulit berminyak kaya aku , garibet dibawa kemana sesimple itu , pokoknya aku sih suka banget 😍 emng deh produk n’pure gapernah gagal ❤️","158":"aku nyobain ini karena fyp mulu kan di tiktok. nah penasaran aku langsung beli... kaget juga ada sunscreen bentuk powder, pertama kali make seneng banget karena gaperlu hapus makeup sih kalau mau reapply sunscreen lagi, hasilnya matte di muka aku bisa banget buat ngunci minyakkk dan makeup tetap on pointtt, terus praktis buat dibawa kemana mana, cara makenya sempet bingung tapi liat video video tutorial jadi bisa sih... ini sunscreen membantu aku bangettt buat sehari hariii❤️😍","159":"teksturnya agak cair, warna putih standar produk sunscreen, cepat menyerap, baunya hampir gada, agak whitecast di awalnya jadi diratain aja. sering dibiarin sampe 14 jam dan muka agak berminyak. tapi overall tidak mengecewakan sih..."},"Pre #2":{"0":"akhirnya beli produk ini pas banget lagi sale juga di ecommerce niat beli produk ini emang buat reapply sunscreen through out the day buat temen temen yang mau pake pastiin jangan pake produk ini sendirian jadi tetep harus pake sunscreen dan bisa di set lagi pake ini jadi produk ini emang diperuntukan buat reapply sunscreen yang mudah banget sihhh","1":"sun powder dari npure ini bagus bangett gaboong deh teksturnya lembut bgt dan benerbener melindungi kulit dari paparan sinar matahari jadi kalo males pake sunscreen biasa bisa langsung pake ini yg super praktisss❤️❤️ sukak pwoll pokonya","2":"waw sumpah si ini sunscreen yang bener bener bagus banget pertama kali nyoba emang langsung cocok di muka aku😍selain itu tekstur nya itu ringan dan cepat meresap di kulit dan juga sekali pake muka aku langsung glowing beuh pokonya cinta banget sama sunscreen yang ini❤😍","3":"npure cica beat the sun powder ini benerbener menjawab kebingunganku kalau harus reapply sunscreen dengan kondisi wajah bermakeup tekstur powdernya halus  nggak menyumbat pori ataupun menimbulkan jerawat tanpa whitecast ringan di kulit dan menyerap minyak","4":"suka sama teksturnya powder dan aplikatornya brush ada spf 30nya membantu perlindungan uvauvb recomendded dan wajib direapply setiap dua jam sekali jadi pengen beli lagi kalo ini dah habis hehe i love it sama npure produknya bagus²","5":"aku agak pemilih kalo urusan sunscreen soalnya biasanya sunscreen itu lengket dan bikin ga nyaman tapi ini beda toner ini ga terlalu lengket cepet ngeresap ga bikin berasa pakai dempul juga dan yg paling penting ga nyumbat pori dan spf tinggi tubenya juga lucu","6":"cocok banget untuk melindungi kulit dari paparan sinar matahari karena mengandung kandungan utama spf terus yang aku suka dia ga geser makeup di wajah jadi aman banget untuk ditimpa diatas makeup selain itu karena dia bentuk powder bisa bantu matte in makeup yang terlalu dewy  oily","7":"suka banget dengan inovasi sekeren ini gak perlu lagi buat bingung untuk really sunscreen sekaligus touchup make up spf nya 30 juga seneng banget kalau reapply sunscreen bikin tetep stay flawless dan masih bikin cantik mulifungsi banget suka banget dah","8":"bagi aku dia bener bener unique because bayangin aja sunscrren sama bedak bisa jadi satudan yang lebih bagusnya lagi dia gabikin kukit bruntusan dan pas di apply dia gabikin kulit kita kliatan kayak berminyak gitu ooo ya aku saranin nih kalian wajib touch up 2 jam sekali","9":"sumpah unik banget sunscreenya bentuk bedak gituu dan ada kuasnyaa apalagi spf 30 persenn mantul banget di apkenya gk ribet dan bisa di apply berulangkali hehehhe kalian semua wajib punya karena praktis banget kaya pake bedak rekomen dan harganya terjangkau prahhhh","10":"pertama kali nyobain dan ternyata cocok di aku ga bikin kusam padahal warnanya sedikit gelap dari kulitku hehe dan hasilnya matte aku suka bangetttt trus kemasannya juga praktis cuman harus berkali kali gitu biar kliatan pake bedaknya hehehe","11":"sunscreen ternyaman yg pernahh aku cobainn sii guyss dengan tekstur yang superrr ringann poll ga susah pokoknya di blend nyaa sudah bpom no alcohol dan no fragrancee the bestttttttt ✅✅✅😊😊😊😊😊😊😊😊😊❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥💘❤️‍🔥💘💘❤️‍🔥❤️‍🔥❤️‍🔥💘❤️‍🔥❤️‍🔥💘❤️‍🔥💘💘💘💘💘","12":"pertama kali nyobain sunscreen yang bentuknya powder aku sukaaa ini sih soalnya gampang di bawa kemana mana apa lagi buat reapply sunscreen pas udah makeup menurut ku ini bneran bagusss jadinya makeup ga geser udah gitu bisa ngontrol minyak jugaaa","13":"suka banget sama produk ini karena powdernya ringan banget di kulit cara pakainya juga mudah hasil akhirnya di kulitku matte dan lumayan tahan lama kuasnya juga bagus lembut dan ga mudah rontok jadi gampang banget re apply sunscreen","14":"baru kali ini nyobain sunscreen powder yang ringan membantu menyerap minyak berlebih meminimalkan tampilan poriporisekaligus mengurangi kilau minyakjadi gak perlu hapus makeup lagi jika mau apply sunscreen ❤️❤️❤️","15":"ini sunscreen paling cocok buat aku yang kulit sensitive ga lengket ge bikin berminyak dan ringan banget di wajah seriuss ini aku bakal repeat order ini terus kayanya karna secocok itu sama muka aku😩🤍 love banget sama cica beat te sun🤍🤍🤍","16":"bagus bangethdjdhdjjdjdjjsjdjdhhdhshshshshshshshshshsheheehhehehehdb jsjsjdjejej jejejejejjeje jejejejejejdjjd jejejejejejejejejjejeje jejejejejjeiee jejejejejeje jejejekekekkjejeejjeej nsjejejejejej jejejejejej","17":"powder suncreen pertama yang aku cobaa sekali coba langsung ketagihan wkwk soalnya cocok di kulit aku suka sama teksturnya lembut dan ringan finish looknya matte tapi tetep natural luv banget xx","18":"akhirnya nemuin sunscreen super simple garibet buat ngeapply selain itu tekstur powdernya halus banget seworth itu ini bakalan jadi sunscreean andalang aku thnk u n’pure udah ngeluarin produk cica beat the sun powder ini cocok banget di aku yang super mager","19":"demi apa sihh produk dr npure satu ini bener² baguss bgt buat ngatasin jerawat² aku yg sukaaa lama bgt sembuhnya cintaaa bgt sma produk ini\nrecommended bgt buat kalian nihhhhh jerawat bisa bener² kering dalam waktu yg lebih cepat","20":"sukaaa suka sukaa bangett  hasilnya ga whitecast cepet nyerep dan ga buat wajah berminyaak lengket smaa sekalii  buat re apply jg okee bangett  harganyaa murah jgg 😍😍😍 superr recomended buat yg cari sunscreen no white cast  ga buat berminyak","21":"buat kalian yang punya kulit jerawatan merah2 sini banget lah kalian wajib cobain sunscreen satu ini dia ga ada bau sma skali teksturnya cukup ringan  ga bikin risih lengket gitu finishnya kalian ga usah takut makeuo rusak pas mo reaplly sunscreen krena ini gampang bngt di blend  cepat menyerap di kulit 🥰😍","22":"sukaa bgtt sama sunscreen dari npure cica beat the sun ini tekstur nya juga gampang di blend gampang jugaa meresap dan ga lengket sama sekalisudah bpom aman buat bu sui serta bebas dari bahan bahan berbahayaaa udah spf 50 jugaa lohh😍💖💖💖","23":"honest review dari aku ini sunscreen termasuk sunscreen yang unik banget karena bentuknya itu powder jadi memudahkan aku untuk retouch make up lumayan tahan lama dan tahan minyak packagingnya juga simple dan mudah dibawa kemana mana","24":"packaging nya bagus lucu dan mudah dibawa kemanamana jadi ga ribet 😘 tekturnya cream ringan ga bikin whitecast jdi ga ngedempul gampang ngresap hasil akhirnya glowing cocok untuk semua jenis kulit harganya juga affordable bagus banget produknyaa ❤️❤️","25":"pliss ini sunscreen unik banget apalagi aplikatornya brush yang memudahkan untuk reapply dan touch up hasil akhirnya matte dan lumayan tahan minyak sesuai klaimnya aku reapply setiap 2 jam sekali walaupun langsung aku timpa dia ga bikin wajah kusam","26":"bagus bgtakhirnya bisa kebeli juga ini sunscreen😭 ngerasa beruntusan ilang dan glowing aja pake inituh bukan yang minyakan cocok bgt buat kulit wajah aku yang normal to dry kaget pas beres ngeapply si cica beat sun ini trs lanjut tone up cream yang biasanya tone upnya susah diblend numpuk putih gitu skrg gampang bgt blendnya jadi rata putih glowing berkat si sunscreen ini😭❤ suka bgttttt","27":"suka banget pake sunscreen dari npure cica beat the sun krna bagus banget terlihat kerutan bekurang dan tambah cerah wajah setelah rutin pakai produk ini  ga bikin lengket dan berminyak jg wajah setelah memakai rangkaian skincare lain","28":"sebelum pake yang powder aku pake yang ini dulu setelah aku pake ga berat dan ga ninggalin whitecast sih jadi ringan dan cepat menyerap gitu best combo kalo di paduin sama yang powder apalagi spf nya gede banget no worry deh tinggal apply yang powder","29":"asli sih ini sunscreen ter ga ribet impressed banget sama npure makasih puol udah ciptain sunscreen powder ini bawa kemanamana praktis juga bisa reapply tiap saat jadi ga perlu worried makeup kenapanapa ya kan hehe hasilnya matte finish juga","30":"ini adalah pertama kalinya gua coba pake product ini dan termyata sesuai ekspetasi emng sunscreenya bagus bgt kulit bener terlindungi dari sinar matahari dan skrg ga perlu kawatir lagi klu pergi pergi tinggal pakai dan ku bawa kemana mana","31":"bagus bget sih ini mana kandungan dan manfaatnya jga bagus bpom halal teruji secara dermatologis bebas sls bebas paraben bebas minyak mineral bebas alkohol bebas alergen ue bahan minimal bebas pewangi jadi kalian wajib coba yaaa","32":"produknya the best banget karna ini powder udah ada spf 30nya jadi mudah untuk reapply berkali kali teksturnya powdernya juga halus warnanya natural di muka dan hasilnya matte packagingnya jg aman bisa di bawa kmna mna😉 aku recomended banget pokoknya ❤️❤️❤️","33":"sun cream nya bagus banget karna spf 50 melindungi kita dari teriknya sinar matahari apalagi di siang siang itu bener bener panas banget dan bisa membuat kulit kusam bisa merah juga kan setelah pake spf sun cream in benerbener menjaga kulit kita dari paparan matahari melindungi banget trs bisa meng glowing kan muka kita juga tekstur nya ringan banget di wajah dan nyaman si menurut ku🤗","34":"kaget banget ternyata sebagus itu kulitku tuh kombinasi tapi masih aman banget gabikin berminyak cuma glowimg biasa aja terus gabuat kusam cepet banget nyerepnya bakal beli lagi ini mah wkwk padhaal harganya gamahal tapi kualitasnya oke banget","35":"produk nya super bagus ini selain pigmen di wajah juga ada spf nya 30 super bagus bukan gak perlu repotrepot pakai sunscreen lagi bisa lgs ini 2in1 hihi aku suka banget pakai ini kalian wajib coba sih 🥰","36":"bagusss bangett produknya cocok untuk semua jenis kulit jugaa loh nggaa lengket dikulitt teksturnya dan harganyaa juga ramah kantong bgt😝 pokoknyaaaa aku rekomend bangettttt buat kalian beli produk inii skrng jugaaaaa yaaaa😍💗💗💗💗","37":"baru kali ini cocok pakai sunscreen😭 biasanya over oily tapi ini tuh cepet bgt nyerepnya no whitecast trus udah gitu finishnya bener2 bikin kulit makin glowing dong omg😚 skrg jadi sunscreen addict bgt berkat npure cica beat the sun wajib repurchase sih iniii❤️","38":"n’pure cica beat the sun sunscreen ☀️ texturenya super light di kulit nyaman dipake seharian ga lengket ga ninggalin whitecast bikin muka jadi glowing tapi ga bikin greasy ❤️ 💚 dengan spf 50 pa sebagai uv filter agent nya sunscreen ini bakal memprotect kita dari paparan sinar uv a  uv b💚 kandungan 100 natural cica centella asiatica leaf water yang terdapat didalamnya juga bagus banget untuk menenangkan kulit kita setelah terpapar sinar matahari 💚 chrysanthemum extract chamomilla extract and camellia sinensis leaf extract didalamnya kaya akan antioksidan  antiinflammatory jadi bagus banget untuk kemerahan  menghidrasi kulit kita💚 bpom halal dermatologically tested bumil busui friendly free from  paraben sls mineral oil alcohol silicone eu allergen  fragrance recommended 🥰✨","39":"produk npure emang paling dabest sih sunscreennya ini matte finish gitu cocok banget buat aku yang males touch up dan reapply sunscreen pas lagi di luar rumah hihi kandungannya juga gausah diragukan lagi worth to buy 💚","40":"sukaaa banget deh sama produk npure yang satu ini cica beat the sun powder ✨ cocok banget buat aku yg mager banget kalo reapply sunscreen tapi semenjak ada produk ini aku gak mager lagi karena gampang banget di reapply nya dengan tekstur nya yg powder dan praktis banget buat di reapply 😍 wajib banget sih punya produk npure yg satu ini 😍 thankyou npure ","41":"suka banget sama sunscreen dari npure karena ga bikin kulit jadi berminyak ga bikin whitecast selain itu juga non paraben non alkohol  non fragrance cocok banget buat kulit sensitif kayak aku udah ada spf 50 pa  lagi terbaikkk 🥺✨","42":"suka bangeeeet sama tekturnyaaa aman buat wajahku yg sering jerawatanbruntusan gabikin iritasi ga berat sama sekali efeknya glowing bund 😆 aman ditimpa sama makeup juga pas nge touch up juga enak banget walau diatas makeup tapi bisa menyerap kekulit selalu di repurchase 💕","43":"senang bangettt akhirnya bisa nemuin suncreen yang gampang di apply berkalikali tanpa harus hapus makeup duluuu yg aku suka juga warna tekturnya tuh natural jadi cocok juga buat jenis kulit yang sawo matang kaya akuuu thank uuu n’pure😍","44":"suka banget sama sunscreen ini awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan","45":"suka banget sama sunscreen ini awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan","46":"bener2 recommended banget deh cocok banget di mukaku spfnya juga tinggi dan ga buat muka aku kering sama ga ada efect putih nya di mukaku dan yang aku suka lagi harganya juga ga mahal deh dengan punya banyak manfaat untuk sunscream bener2 suka banget deh pokoknya","47":"ini produk yg wajib dipake harus punya pokoknya suka banget pakai sunscreen n pure ini bisa buat base makeup juga krna gak lengket di kulit trus cepet meresap harganya juga ramah dikantong recomended deh pokoknya next mau beli lagi","48":"sudah sebulanan ini aku pakai cica beat the sun npure teksturnya pas tidak terlalu kental dan tidak lengket nyaman di kulit meresap cepat dan ada kandungan spf 50 pa cukup tinggi serta di kulitku no whitecast namun tips jika kulitmu berminyak padukan dengan cica beat the sun powder yah","49":"buat yang punya kulit kering pasti bakal suka sama produk ini setelah dipake langsung auto glowing glass skin ala2 korea gitu tapi ga terasa lengket  greasy sama sekali dan pastinya bikin kulit terasa lembab seharian spf nya juga tinggi dan proteksi nya udh lengkap cocok juga untuk dijadikan base makeup jdi lebih nempel dan mulus","50":"teksturnya ringan banget dengan hasil matte finish penolong banget buat wajah aku yg oily ini ada spf 30 nya pula😭 dan produknya juga praktis dibawa kemana dan bentuknya juga praktis banget gk ribet kalo mau reaply❤","51":"the finish looks good on my combi to dry skin kalo pake ss emang suka yg glowwy finish dan ini ga bikin gerah sama sekaliii gampang di blend jugaa dan minim oksidasii tapi kayaknya oil controlnya kurang tapi apply 3 kali sehari sekali udah enak banget bakal repurchase sih","52":"aaaaaa akhirnya ga worry lagi kalo lagi makeup harus reapply sunscreen sangat amat membantu aku yang kerjanya makeup tapi ttp terpapar matahari yang kerennya lagi selain doi memproteksi kulit dari efek uva uvb bisa sekalian touch up makeup jadi matte dan flawless must try❤️","53":"aku suka sama sunscreen ini😍 teksturnya gampang menyerap gak kental dan gak berat overall aku cocok biasanya kalo gak cocok aku akan timbul jerawat tapi ini gak aku ngerasa juga wajah aku tetap terasa lembab💕 terus package nya juga aku suka di ujung buka tutup nya bentuknya kayak plastik bening gitu yang buat jd unik aja gak tau pertama kali liat langsung wah lucu hehe🤗💕💕","54":"ini highly recommended sih buat daily enak bgt simple dipakenya ga ribet mana teksturnya enak bgt ringan😭🤍 asli muka aku biasanya jam 12an gt udh oily dipakein ini langsung ngeset lagi kaya baru pake make up🥲🤍","55":"selama pake produk ini  aku ngerasa kulit ku terlindungi  karena jujur kulitku tipe yang suka sakit dan kemerahan disaat kena sinar matahari dan karena kebanyakan sunscreen bertexture creamy bkin aku susah meratakan creamnya diwajah dan bkin sakit akhirnya aku stop pake tapi setelah pake npure aku gak lagi khawatir karena lbh cepat meresap dan cpt bekerja di kulit wajah aku","56":"gilakkk sih produknya bagus bgt udah spf 50 pa selain itu dri packagingnya simple bgt buat di bawa kemana2 kesan pertama pakai langsung memberi efek glowing pada kulitku serta teksturnya ringan bgtt fix produknya npure emang bagus2 bgt apalagi yang cica beat the sun powder ini kalian harus cobaaaa 👍","57":"terima kasih bgt buat npure yg sudah bikin produk ini karena reapply sunscreen jadi mudah suka bgt sama sunscreen ini  pas buat aku yg suka pake makeup finishnya matte nggak geser makeup  gampang bgt pakenya","58":"nyaman digunain bikin glowing diwajah gak kering dan adem di kulit wajib dipake buat klian yg sering aktifitas di luar ruangan haruuus bgt ini buat perlindungan yaaaaaaaaaaaaa😍😍😍😍😍😍😍😍😍😍😍😍😍","59":"pertama kali coba sunscreen versi powder hasilnya matte dan natural biasanya aku pakai di akhir setelah skincarean atau makeup selama 2 minggu kulitku ga menimbulkan reaksi negatif alias cocok super suka sama kemasannya yang unik ringan dan praktis bisa di bawa kemana aja","60":"yayyy akhirnya aku nemuin sunscreen yang cocok banget di kulit aku mudah di aaplikasikan mudah di blend dan tidak lengket sama sekali sunscreen ini alcohol free loh jadi aman banget untuk kulit sensitif seperti kulitku😭💖💖💖💖 bakal beli lagi sih kalo udah habis💖","61":"aku udah pake produk ini sekitar 2 bulan lebih teksturnya aga sedikit cair gampang banget buat diblend dan yang paling aku suka itu adalah bikin muka jadi glowing bangetdan tentunya karena aman buat jerawat makanya aku cinta banget sama produk ini","62":"iiiii mampuy suka bgt sama sunscreen ini bener2 nyaman di pakenya dan bikin wajah keliatan glowing sehat cerah 😍 teksturnya rada cair dan mudah di applikasiin setiap pake ini ak ngerasa dia lumayan ada efek tone up tp ga bikin muka abu2 👌🏻 suka nih kalo cocok sama produk2 lokal harganya jg masi masuk akal sesuai kualitas","63":"50\nsunscreen terbaik menurut aku dia gak bikin kulit berminyak gitu setelah diapply trus gak bikin muka kita cepet minyakan enak juga cepat meresap packagingnya praktis dan bisa dibawa kemana aja rekomen banget pokoknyaaaharganya juga terjangkau  manfaatnya juga juara","64":"omg ini sunscreen terlembut yang pernah aku coba enak banget dikulit aku bikin kulit wajah aku lembab jujur suncreen npure cica beat the sun ini bagus banget dong melindungi dari sinar matahari apa lagi aku banyak banget kegiatan diluar sebelum aku beraktifitas aku pake dulu next abis mau beli lagi😍","65":"pengalaman pertamaku pake sunscreem powder dari n pure ini tuh bener bener sukaa banget  karna baru kali ini nemuin produk sunscreen yg powder dengan kemasan praktis untuk dibawa traveling uda dilengkapi juga dengan spf 30 dan bisa dipake sebagai step ke 2 setelah sunscreen creamnya mantul banget deh","66":"lucu bgt sunscreen powder 😍 packagingnya retractable  aplikator brushnya lembut bgt warnanya beige tapi ga merubah warna kulit malah bikin kulit makin cerah 😍 simple lagi kalo mau touch up tinggal tap puter2 kaya pake blussh on 😍 harganya jg affordable 💯","67":"wow sumpah pertama kalinya cobain sunscreen bentuk powder so far i luv this product so much pertama untuk packagingnya retractable dan brushnya soft bangettt untuk tekstur sedikit powder but its okay bcs finishnya matte natural and no whitecast sun powder ini juga tetep menghidrasi kulit walau finishnya matte luv it🥰","68":"baru pertama kali nyobain sun powder dan menurut aku feelsnya sama aja kayak kita pake loose powder gitu finishnya matte tapi di kulitku yg medium light dia ga kelihatan dempul dan jatuhnya natural banget nyatu ke warna kulit asli butirannya super halus dan kuasnya juga jd ga buat muka terasa kegores kemasannya super mini jadi enak buat dibawa kemanamana sayangnya karna dia sun powder jd kurang efektif klw dipake single aja harus pake sunscreen lotion dlu jadi jatuhnya produk ini tuh kayak ngeset riasan di bawahnya ama maksimalin proteksi lebh cocok dipake buat reapply apalagi pas makeup jd ga takut makeupnya tergeser so far aman aja sih di kulit aku dan worth to try👌 tp krna harganya lumayan out of my budget aku prefer belinya pas promo aja wkwk","69":"seneng banget akhirnya nemu sunscreen powder yg slama ini aku cari2 ternyata npure punya produknya doomss sumpah ini bagus banget cocok banget dikulit aku yg super duper sensitif huhhh popoknya ini recomended deehhh","70":"baru kali ini punya sunscreen dalam bentuk powder apalagi aplikatornya brush dan suka banget apalagi pas pakai makeup reapply jadi lebih praktis matte finish dan bisa mengontrol minyak berlebih di wajah","71":"pertama kali cobain sunscreen dan langsung suka 🥺 pas di blend benerbener nyerap ke kulit dan bikin glowing dong  ringan juga di wajah  ini cocok banget buat yg dry skin ya soalnya habis pakai sunscreen npure ini wajahku jadi lembab  suka 💕","72":"suka banget sama sun powdernya pacakgingnya kuat udah beberapa kali jatoh tapi masih kuat ga rusak untungnya trus juga hasilnya matte bagus gitu ga ngegeser makeup sama skali sih trus efisien banget juga jadinya seneng dibawa kemana2","73":"pertama kali beli karena sering banget lewat fyp tktk aku awal pemakaian ternyata ringan gak ada whitecast gak lengket juga nyaman banget dipake gak bikin wajah tambah minyakan karena jenis kulitku yang oily masih aman dan nyaman dipake","74":"baru kali ini cobain sun screen powder dari npure dan kayanya baru npure yang keluarin produk kaya gini😍 emang bagus banget sih bkn muka ga lepek dn lengket lgi klo diluar rumah  packagingnnya jg lucu gampang dibawa kemana2 ga makan tempat❤️","75":"ini powder yang terdebest banget sih menurutku selain ada spf nya powder ini waktu di apply ke wajah tekstur nya ringan sama sekali dan ngurangin minyak diwajah jugaaa apalagi aku emang dari pagi sd sore aktivitasnya diluar teruuussssss kemasannya yang minimalis bikin jadi gampang dibawa kemanamana🥰 bakalan jadi powder fav aku sih ini❤️‍🔥","76":"npure cica beat the sun powder ini cocok banget untuk kulit yang berminyak seperti aku seperti yang kita tau reapply sunscreen itu penting banget apalagi kalo sering kegiatan di outdoor\nproduk ini praktis banget sih karna gampang banget dibawa kemanamana juga pas di reapply mudah banget karna tinggal diusap di wajah dan sekalipun muka kita masih ada makeup nyatidak buat makeup kita bergeser🥰untuk packaging nya sunscreen powder dari n’pure ini dikemas dalam tabung plastik mini berwarna hijau emerald bagian bawah tabungnya bening sehingga sunscreen powdernya kelihatan bagian atas tabung disambungkan dengan brush kuas warna cream kuas ini lembut banget sehingga mudah digunakan untuk seluruh bagian wajah kandungan dalam produk ini terdiri dari ada titanium dioxide ethylhexyl salicylate ethylhexyl methoxycinnamate natural centella asiatica leaf water rice bran oil dan vitamin e dan produk ini memiliki beragam manfaaf yaitu memberi perlindungan maksimal terhadap efek buruk sinar matahari pada kulit wajah dapat menangkal sinar uva maupun uvb secara efektif yang berpotensi dapat merusak kulit dapat melindungi kulit dari kerusakan karena paparan sinar matahari salah satunya yaitu sunburn dapat menenangkan kulit setelah beraktivitas di bawah sinar mataharini dan untuk menghidrasi dan menutrisi kulit wajah secara maksimal npure cica beat the sun powder ini bersifat noncomedogenic jadi aman untuk kamu yang punya kulit sensitif😍","77":"sesuka itu sama powder dari n’pure  favorite banget sih inimah  teksturnya juga lembut gtuh loh cocok banget buat kulit berminyak kaya aku  garibet dibawa kemana sesimple itu  pokoknya aku sih suka banget 😍 emng deh produk n’pure gapernah gagal ❤️","78":"aku nyobain ini karena fyp mulu kan di tiktok nah penasaran aku langsung beli kaget juga ada sunscreen bentuk powder pertama kali make seneng banget karena gaperlu hapus makeup sih kalau mau reapply sunscreen lagi hasilnya matte di muka aku bisa banget buat ngunci minyakkk dan makeup tetap on pointtt terus praktis buat dibawa kemana mana cara makenya sempet bingung tapi liat video video tutorial jadi bisa sih ini sunscreen membantu aku bangettt buat sehari hariii❤️😍","79":"teksturnya agak cair warna putih standar produk sunscreen cepat menyerap baunya hampir gada agak whitecast di awalnya jadi diratain aja sering dibiarin sampe 14 jam dan muka agak berminyak tapi overall tidak mengecewakan sih","80":"akhirnya beli produk ini pas banget lagi sale juga di ecommerce niat beli produk ini emang buat reapply sunscreen through out the day buat temen temen yang mau pake pastiin jangan pake produk ini sendirian jadi tetep harus pake sunscreen dan bisa di set lagi pake ini jadi produk ini emang diperuntukan buat reapply sunscreen yang mudah banget sihhh","81":"sun powder dari npure ini bagus bangett gaboong deh teksturnya lembut bgt dan benerbener melindungi kulit dari paparan sinar matahari jadi kalo males pake sunscreen biasa bisa langsung pake ini yg super praktisss❤️❤️ sukak pwoll pokonya","82":"waw sumpah si ini sunscreen yang bener bener bagus banget pertama kali nyoba emang langsung cocok di muka aku😍selain itu tekstur nya itu ringan dan cepat meresap di kulit dan juga sekali pake muka aku langsung glowing beuh pokonya cinta banget sama sunscreen yang ini❤😍","83":"npure cica beat the sun powder ini benerbener menjawab kebingunganku kalau harus reapply sunscreen dengan kondisi wajah bermakeup tekstur powdernya halus  nggak menyumbat pori ataupun menimbulkan jerawat tanpa whitecast ringan di kulit dan menyerap minyak","84":"suka sama teksturnya powder dan aplikatornya brush ada spf 30nya membantu perlindungan uvauvb recomendded dan wajib direapply setiap dua jam sekali jadi pengen beli lagi kalo ini dah habis hehe i love it sama npure produknya bagus²","85":"aku agak pemilih kalo urusan sunscreen soalnya biasanya sunscreen itu lengket dan bikin ga nyaman tapi ini beda toner ini ga terlalu lengket cepet ngeresap ga bikin berasa pakai dempul juga dan yg paling penting ga nyumbat pori dan spf tinggi tubenya juga lucu","86":"cocok banget untuk melindungi kulit dari paparan sinar matahari karena mengandung kandungan utama spf terus yang aku suka dia ga geser makeup di wajah jadi aman banget untuk ditimpa diatas makeup selain itu karena dia bentuk powder bisa bantu matte in makeup yang terlalu dewy  oily","87":"suka banget dengan inovasi sekeren ini gak perlu lagi buat bingung untuk really sunscreen sekaligus touchup make up spf nya 30 juga seneng banget kalau reapply sunscreen bikin tetep stay flawless dan masih bikin cantik mulifungsi banget suka banget dah","88":"bagi aku dia bener bener unique because bayangin aja sunscrren sama bedak bisa jadi satudan yang lebih bagusnya lagi dia gabikin kukit bruntusan dan pas di apply dia gabikin kulit kita kliatan kayak berminyak gitu ooo ya aku saranin nih kalian wajib touch up 2 jam sekali","89":"sumpah unik banget sunscreenya bentuk bedak gituu dan ada kuasnyaa apalagi spf 30 persenn mantul banget di apkenya gk ribet dan bisa di apply berulangkali hehehhe kalian semua wajib punya karena praktis banget kaya pake bedak rekomen dan harganya terjangkau prahhhh","90":"pertama kali nyobain dan ternyata cocok di aku ga bikin kusam padahal warnanya sedikit gelap dari kulitku hehe dan hasilnya matte aku suka bangetttt trus kemasannya juga praktis cuman harus berkali kali gitu biar kliatan pake bedaknya hehehe","91":"sunscreen ternyaman yg pernahh aku cobainn sii guyss dengan tekstur yang superrr ringann poll ga susah pokoknya di blend nyaa sudah bpom no alcohol dan no fragrancee the bestttttttt ✅✅✅😊😊😊😊😊😊😊😊😊❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥❤️‍🔥💘❤️‍🔥💘💘❤️‍🔥❤️‍🔥❤️‍🔥💘❤️‍🔥❤️‍🔥💘❤️‍🔥💘💘💘💘💘","92":"pertama kali nyobain sunscreen yang bentuknya powder aku sukaaa ini sih soalnya gampang di bawa kemana mana apa lagi buat reapply sunscreen pas udah makeup menurut ku ini bneran bagusss jadinya makeup ga geser udah gitu bisa ngontrol minyak jugaaa","93":"suka banget sama produk ini karena powdernya ringan banget di kulit cara pakainya juga mudah hasil akhirnya di kulitku matte dan lumayan tahan lama kuasnya juga bagus lembut dan ga mudah rontok jadi gampang banget re apply sunscreen","94":"baru kali ini nyobain sunscreen powder yang ringan membantu menyerap minyak berlebih meminimalkan tampilan poriporisekaligus mengurangi kilau minyakjadi gak perlu hapus makeup lagi jika mau apply sunscreen ❤️❤️❤️","95":"ini sunscreen paling cocok buat aku yang kulit sensitive ga lengket ge bikin berminyak dan ringan banget di wajah seriuss ini aku bakal repeat order ini terus kayanya karna secocok itu sama muka aku😩🤍 love banget sama cica beat te sun🤍🤍🤍","96":"bagus bangethdjdhdjjdjdjjsjdjdhhdhshshshshshshshshshsheheehhehehehdb jsjsjdjejej jejejejejjeje jejejejejejdjjd jejejejejejejejejjejeje jejejejejjeiee jejejejejeje jejejekekekkjejeejjeej nsjejejejejej jejejejejej","97":"powder suncreen pertama yang aku cobaa sekali coba langsung ketagihan wkwk soalnya cocok di kulit aku suka sama teksturnya lembut dan ringan finish looknya matte tapi tetep natural luv banget xx","98":"akhirnya nemuin sunscreen super simple garibet buat ngeapply selain itu tekstur powdernya halus banget seworth itu ini bakalan jadi sunscreean andalang aku thnk u n’pure udah ngeluarin produk cica beat the sun powder ini cocok banget di aku yang super mager","99":"demi apa sihh produk dr npure satu ini bener² baguss bgt buat ngatasin jerawat² aku yg sukaaa lama bgt sembuhnya cintaaa bgt sma produk ini\nrecommended bgt buat kalian nihhhhh jerawat bisa bener² kering dalam waktu yg lebih cepat","100":"sukaaa suka sukaa bangett  hasilnya ga whitecast cepet nyerep dan ga buat wajah berminyaak lengket smaa sekalii  buat re apply jg okee bangett  harganyaa murah jgg 😍😍😍 superr recomended buat yg cari sunscreen no white cast  ga buat berminyak","101":"buat kalian yang punya kulit jerawatan merah2 sini banget lah kalian wajib cobain sunscreen satu ini dia ga ada bau sma skali teksturnya cukup ringan  ga bikin risih lengket gitu finishnya kalian ga usah takut makeuo rusak pas mo reaplly sunscreen krena ini gampang bngt di blend  cepat menyerap di kulit 🥰😍","102":"sukaa bgtt sama sunscreen dari npure cica beat the sun ini tekstur nya juga gampang di blend gampang jugaa meresap dan ga lengket sama sekalisudah bpom aman buat bu sui serta bebas dari bahan bahan berbahayaaa udah spf 50 jugaa lohh😍💖💖💖","103":"honest review dari aku ini sunscreen termasuk sunscreen yang unik banget karena bentuknya itu powder jadi memudahkan aku untuk retouch make up lumayan tahan lama dan tahan minyak packagingnya juga simple dan mudah dibawa kemana mana","104":"packaging nya bagus lucu dan mudah dibawa kemanamana jadi ga ribet 😘 tekturnya cream ringan ga bikin whitecast jdi ga ngedempul gampang ngresap hasil akhirnya glowing cocok untuk semua jenis kulit harganya juga affordable bagus banget produknyaa ❤️❤️","105":"pliss ini sunscreen unik banget apalagi aplikatornya brush yang memudahkan untuk reapply dan touch up hasil akhirnya matte dan lumayan tahan minyak sesuai klaimnya aku reapply setiap 2 jam sekali walaupun langsung aku timpa dia ga bikin wajah kusam","106":"bagus bgtakhirnya bisa kebeli juga ini sunscreen😭 ngerasa beruntusan ilang dan glowing aja pake inituh bukan yang minyakan cocok bgt buat kulit wajah aku yang normal to dry kaget pas beres ngeapply si cica beat sun ini trs lanjut tone up cream yang biasanya tone upnya susah diblend numpuk putih gitu skrg gampang bgt blendnya jadi rata putih glowing berkat si sunscreen ini😭❤ suka bgttttt","107":"suka banget pake sunscreen dari npure cica beat the sun krna bagus banget terlihat kerutan bekurang dan tambah cerah wajah setelah rutin pakai produk ini  ga bikin lengket dan berminyak jg wajah setelah memakai rangkaian skincare lain","108":"sebelum pake yang powder aku pake yang ini dulu setelah aku pake ga berat dan ga ninggalin whitecast sih jadi ringan dan cepat menyerap gitu best combo kalo di paduin sama yang powder apalagi spf nya gede banget no worry deh tinggal apply yang powder","109":"asli sih ini sunscreen ter ga ribet impressed banget sama npure makasih puol udah ciptain sunscreen powder ini bawa kemanamana praktis juga bisa reapply tiap saat jadi ga perlu worried makeup kenapanapa ya kan hehe hasilnya matte finish juga","110":"ini adalah pertama kalinya gua coba pake product ini dan termyata sesuai ekspetasi emng sunscreenya bagus bgt kulit bener terlindungi dari sinar matahari dan skrg ga perlu kawatir lagi klu pergi pergi tinggal pakai dan ku bawa kemana mana","111":"bagus bget sih ini mana kandungan dan manfaatnya jga bagus bpom halal teruji secara dermatologis bebas sls bebas paraben bebas minyak mineral bebas alkohol bebas alergen ue bahan minimal bebas pewangi jadi kalian wajib coba yaaa","112":"produknya the best banget karna ini powder udah ada spf 30nya jadi mudah untuk reapply berkali kali teksturnya powdernya juga halus warnanya natural di muka dan hasilnya matte packagingnya jg aman bisa di bawa kmna mna😉 aku recomended banget pokoknya ❤️❤️❤️","113":"sun cream nya bagus banget karna spf 50 melindungi kita dari teriknya sinar matahari apalagi di siang siang itu bener bener panas banget dan bisa membuat kulit kusam bisa merah juga kan setelah pake spf sun cream in benerbener menjaga kulit kita dari paparan matahari melindungi banget trs bisa meng glowing kan muka kita juga tekstur nya ringan banget di wajah dan nyaman si menurut ku🤗","114":"kaget banget ternyata sebagus itu kulitku tuh kombinasi tapi masih aman banget gabikin berminyak cuma glowimg biasa aja terus gabuat kusam cepet banget nyerepnya bakal beli lagi ini mah wkwk padhaal harganya gamahal tapi kualitasnya oke banget","115":"produk nya super bagus ini selain pigmen di wajah juga ada spf nya 30 super bagus bukan gak perlu repotrepot pakai sunscreen lagi bisa lgs ini 2in1 hihi aku suka banget pakai ini kalian wajib coba sih 🥰","116":"bagusss bangett produknya cocok untuk semua jenis kulit jugaa loh nggaa lengket dikulitt teksturnya dan harganyaa juga ramah kantong bgt😝 pokoknyaaaa aku rekomend bangettttt buat kalian beli produk inii skrng jugaaaaa yaaaa😍💗💗💗💗","117":"baru kali ini cocok pakai sunscreen😭 biasanya over oily tapi ini tuh cepet bgt nyerepnya no whitecast trus udah gitu finishnya bener2 bikin kulit makin glowing dong omg😚 skrg jadi sunscreen addict bgt berkat npure cica beat the sun wajib repurchase sih iniii❤️","118":"n’pure cica beat the sun sunscreen ☀️ texturenya super light di kulit nyaman dipake seharian ga lengket ga ninggalin whitecast bikin muka jadi glowing tapi ga bikin greasy ❤️ 💚 dengan spf 50 pa sebagai uv filter agent nya sunscreen ini bakal memprotect kita dari paparan sinar uv a  uv b💚 kandungan 100 natural cica centella asiatica leaf water yang terdapat didalamnya juga bagus banget untuk menenangkan kulit kita setelah terpapar sinar matahari 💚 chrysanthemum extract chamomilla extract and camellia sinensis leaf extract didalamnya kaya akan antioksidan  antiinflammatory jadi bagus banget untuk kemerahan  menghidrasi kulit kita💚 bpom halal dermatologically tested bumil busui friendly free from  paraben sls mineral oil alcohol silicone eu allergen  fragrance recommended 🥰✨","119":"produk npure emang paling dabest sih sunscreennya ini matte finish gitu cocok banget buat aku yang males touch up dan reapply sunscreen pas lagi di luar rumah hihi kandungannya juga gausah diragukan lagi worth to buy 💚","120":"sukaaa banget deh sama produk npure yang satu ini cica beat the sun powder ✨ cocok banget buat aku yg mager banget kalo reapply sunscreen tapi semenjak ada produk ini aku gak mager lagi karena gampang banget di reapply nya dengan tekstur nya yg powder dan praktis banget buat di reapply 😍 wajib banget sih punya produk npure yg satu ini 😍 thankyou npure ","121":"suka banget sama sunscreen dari npure karena ga bikin kulit jadi berminyak ga bikin whitecast selain itu juga non paraben non alkohol  non fragrance cocok banget buat kulit sensitif kayak aku udah ada spf 50 pa  lagi terbaikkk 🥺✨","122":"suka bangeeeet sama tekturnyaaa aman buat wajahku yg sering jerawatanbruntusan gabikin iritasi ga berat sama sekali efeknya glowing bund 😆 aman ditimpa sama makeup juga pas nge touch up juga enak banget walau diatas makeup tapi bisa menyerap kekulit selalu di repurchase 💕","123":"senang bangettt akhirnya bisa nemuin suncreen yang gampang di apply berkalikali tanpa harus hapus makeup duluuu yg aku suka juga warna tekturnya tuh natural jadi cocok juga buat jenis kulit yang sawo matang kaya akuuu thank uuu n’pure😍","124":"suka banget sama sunscreen ini awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan","125":"suka banget sama sunscreen ini awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan","126":"bener2 recommended banget deh cocok banget di mukaku spfnya juga tinggi dan ga buat muka aku kering sama ga ada efect putih nya di mukaku dan yang aku suka lagi harganya juga ga mahal deh dengan punya banyak manfaat untuk sunscream bener2 suka banget deh pokoknya","127":"ini produk yg wajib dipake harus punya pokoknya suka banget pakai sunscreen n pure ini bisa buat base makeup juga krna gak lengket di kulit trus cepet meresap harganya juga ramah dikantong recomended deh pokoknya next mau beli lagi","128":"sudah sebulanan ini aku pakai cica beat the sun npure teksturnya pas tidak terlalu kental dan tidak lengket nyaman di kulit meresap cepat dan ada kandungan spf 50 pa cukup tinggi serta di kulitku no whitecast namun tips jika kulitmu berminyak padukan dengan cica beat the sun powder yah","129":"buat yang punya kulit kering pasti bakal suka sama produk ini setelah dipake langsung auto glowing glass skin ala2 korea gitu tapi ga terasa lengket  greasy sama sekali dan pastinya bikin kulit terasa lembab seharian spf nya juga tinggi dan proteksi nya udh lengkap cocok juga untuk dijadikan base makeup jdi lebih nempel dan mulus","130":"teksturnya ringan banget dengan hasil matte finish penolong banget buat wajah aku yg oily ini ada spf 30 nya pula😭 dan produknya juga praktis dibawa kemana dan bentuknya juga praktis banget gk ribet kalo mau reaply❤","131":"the finish looks good on my combi to dry skin kalo pake ss emang suka yg glowwy finish dan ini ga bikin gerah sama sekaliii gampang di blend jugaa dan minim oksidasii tapi kayaknya oil controlnya kurang tapi apply 3 kali sehari sekali udah enak banget bakal repurchase sih","132":"aaaaaa akhirnya ga worry lagi kalo lagi makeup harus reapply sunscreen sangat amat membantu aku yang kerjanya makeup tapi ttp terpapar matahari yang kerennya lagi selain doi memproteksi kulit dari efek uva uvb bisa sekalian touch up makeup jadi matte dan flawless must try❤️","133":"aku suka sama sunscreen ini😍 teksturnya gampang menyerap gak kental dan gak berat overall aku cocok biasanya kalo gak cocok aku akan timbul jerawat tapi ini gak aku ngerasa juga wajah aku tetap terasa lembab💕 terus package nya juga aku suka di ujung buka tutup nya bentuknya kayak plastik bening gitu yang buat jd unik aja gak tau pertama kali liat langsung wah lucu hehe🤗💕💕","134":"ini highly recommended sih buat daily enak bgt simple dipakenya ga ribet mana teksturnya enak bgt ringan😭🤍 asli muka aku biasanya jam 12an gt udh oily dipakein ini langsung ngeset lagi kaya baru pake make up🥲🤍","135":"selama pake produk ini  aku ngerasa kulit ku terlindungi  karena jujur kulitku tipe yang suka sakit dan kemerahan disaat kena sinar matahari dan karena kebanyakan sunscreen bertexture creamy bkin aku susah meratakan creamnya diwajah dan bkin sakit akhirnya aku stop pake tapi setelah pake npure aku gak lagi khawatir karena lbh cepat meresap dan cpt bekerja di kulit wajah aku","136":"gilakkk sih produknya bagus bgt udah spf 50 pa selain itu dri packagingnya simple bgt buat di bawa kemana2 kesan pertama pakai langsung memberi efek glowing pada kulitku serta teksturnya ringan bgtt fix produknya npure emang bagus2 bgt apalagi yang cica beat the sun powder ini kalian harus cobaaaa 👍","137":"nyaman digunain bikin glowing diwajah gak kering dan adem di kulit wajib dipake buat klian yg sering aktifitas di luar ruangan haruuus bgt ini buat perlindungan yaaaaaaaaaaaaa😍😍😍😍😍😍😍😍😍😍😍😍😍","138":"terima kasih bgt buat npure yg sudah bikin produk ini karena reapply sunscreen jadi mudah suka bgt sama sunscreen ini  pas buat aku yg suka pake makeup finishnya matte nggak geser makeup  gampang bgt pakenya","139":"pertama kali coba sunscreen versi powder hasilnya matte dan natural biasanya aku pakai di akhir setelah skincarean atau makeup selama 2 minggu kulitku ga menimbulkan reaksi negatif alias cocok super suka sama kemasannya yang unik ringan dan praktis bisa di bawa kemana aja","140":"yayyy akhirnya aku nemuin sunscreen yang cocok banget di kulit aku mudah di aaplikasikan mudah di blend dan tidak lengket sama sekali sunscreen ini alcohol free loh jadi aman banget untuk kulit sensitif seperti kulitku😭💖💖💖💖 bakal beli lagi sih kalo udah habis💖","141":"aku udah pake produk ini sekitar 2 bulan lebih teksturnya aga sedikit cair gampang banget buat diblend dan yang paling aku suka itu adalah bikin muka jadi glowing bangetdan tentunya karena aman buat jerawat makanya aku cinta banget sama produk ini","142":"iiiii mampuy suka bgt sama sunscreen ini bener2 nyaman di pakenya dan bikin wajah keliatan glowing sehat cerah 😍 teksturnya rada cair dan mudah di applikasiin setiap pake ini ak ngerasa dia lumayan ada efek tone up tp ga bikin muka abu2 👌🏻 suka nih kalo cocok sama produk2 lokal harganya jg masi masuk akal sesuai kualitas","143":"50\nsunscreen terbaik menurut aku dia gak bikin kulit berminyak gitu setelah diapply trus gak bikin muka kita cepet minyakan enak juga cepat meresap packagingnya praktis dan bisa dibawa kemana aja rekomen banget pokoknyaaaharganya juga terjangkau  manfaatnya juga juara","144":"omg ini sunscreen terlembut yang pernah aku coba enak banget dikulit aku bikin kulit wajah aku lembab jujur suncreen npure cica beat the sun ini bagus banget dong melindungi dari sinar matahari apa lagi aku banyak banget kegiatan diluar sebelum aku beraktifitas aku pake dulu next abis mau beli lagi😍","145":"pengalaman pertamaku pake sunscreem powder dari n pure ini tuh bener bener sukaa banget  karna baru kali ini nemuin produk sunscreen yg powder dengan kemasan praktis untuk dibawa traveling uda dilengkapi juga dengan spf 30 dan bisa dipake sebagai step ke 2 setelah sunscreen creamnya mantul banget deh","146":"lucu bgt sunscreen powder 😍 packagingnya retractable  aplikator brushnya lembut bgt warnanya beige tapi ga merubah warna kulit malah bikin kulit makin cerah 😍 simple lagi kalo mau touch up tinggal tap puter2 kaya pake blussh on 😍 harganya jg affordable 💯","147":"wow sumpah pertama kalinya cobain sunscreen bentuk powder so far i luv this product so much pertama untuk packagingnya retractable dan brushnya soft bangettt untuk tekstur sedikit powder but its okay bcs finishnya matte natural and no whitecast sun powder ini juga tetep menghidrasi kulit walau finishnya matte luv it🥰","148":"baru pertama kali nyobain sun powder dan menurut aku feelsnya sama aja kayak kita pake loose powder gitu finishnya matte tapi di kulitku yg medium light dia ga kelihatan dempul dan jatuhnya natural banget nyatu ke warna kulit asli butirannya super halus dan kuasnya juga jd ga buat muka terasa kegores kemasannya super mini jadi enak buat dibawa kemanamana sayangnya karna dia sun powder jd kurang efektif klw dipake single aja harus pake sunscreen lotion dlu jadi jatuhnya produk ini tuh kayak ngeset riasan di bawahnya ama maksimalin proteksi lebh cocok dipake buat reapply apalagi pas makeup jd ga takut makeupnya tergeser so far aman aja sih di kulit aku dan worth to try👌 tp krna harganya lumayan out of my budget aku prefer belinya pas promo aja wkwk","149":"seneng banget akhirnya nemu sunscreen powder yg slama ini aku cari2 ternyata npure punya produknya doomss sumpah ini bagus banget cocok banget dikulit aku yg super duper sensitif huhhh popoknya ini recomended deehhh","150":"baru kali ini punya sunscreen dalam bentuk powder apalagi aplikatornya brush dan suka banget apalagi pas pakai makeup reapply jadi lebih praktis matte finish dan bisa mengontrol minyak berlebih di wajah","151":"suka banget sama sun powdernya pacakgingnya kuat udah beberapa kali jatoh tapi masih kuat ga rusak untungnya trus juga hasilnya matte bagus gitu ga ngegeser makeup sama skali sih trus efisien banget juga jadinya seneng dibawa kemana2","152":"pertama kali cobain sunscreen dan langsung suka 🥺 pas di blend benerbener nyerap ke kulit dan bikin glowing dong  ringan juga di wajah  ini cocok banget buat yg dry skin ya soalnya habis pakai sunscreen npure ini wajahku jadi lembab  suka 💕","153":"pertama kali beli karena sering banget lewat fyp tktk aku awal pemakaian ternyata ringan gak ada whitecast gak lengket juga nyaman banget dipake gak bikin wajah tambah minyakan karena jenis kulitku yang oily masih aman dan nyaman dipake","154":"baru kali ini cobain sun screen powder dari npure dan kayanya baru npure yang keluarin produk kaya gini😍 emang bagus banget sih bkn muka ga lepek dn lengket lgi klo diluar rumah  packagingnnya jg lucu gampang dibawa kemana2 ga makan tempat❤️","155":"ini powder yang terdebest banget sih menurutku selain ada spf nya powder ini waktu di apply ke wajah tekstur nya ringan sama sekali dan ngurangin minyak diwajah jugaaa apalagi aku emang dari pagi sd sore aktivitasnya diluar teruuussssss kemasannya yang minimalis bikin jadi gampang dibawa kemanamana🥰 bakalan jadi powder fav aku sih ini❤️‍🔥","156":"npure cica beat the sun powder ini cocok banget untuk kulit yang berminyak seperti aku seperti yang kita tau reapply sunscreen itu penting banget apalagi kalo sering kegiatan di outdoor\nproduk ini praktis banget sih karna gampang banget dibawa kemanamana juga pas di reapply mudah banget karna tinggal diusap di wajah dan sekalipun muka kita masih ada makeup nyatidak buat makeup kita bergeser🥰untuk packaging nya sunscreen powder dari n’pure ini dikemas dalam tabung plastik mini berwarna hijau emerald bagian bawah tabungnya bening sehingga sunscreen powdernya kelihatan bagian atas tabung disambungkan dengan brush kuas warna cream kuas ini lembut banget sehingga mudah digunakan untuk seluruh bagian wajah kandungan dalam produk ini terdiri dari ada titanium dioxide ethylhexyl salicylate ethylhexyl methoxycinnamate natural centella asiatica leaf water rice bran oil dan vitamin e dan produk ini memiliki beragam manfaaf yaitu memberi perlindungan maksimal terhadap efek buruk sinar matahari pada kulit wajah dapat menangkal sinar uva maupun uvb secara efektif yang berpotensi dapat merusak kulit dapat melindungi kulit dari kerusakan karena paparan sinar matahari salah satunya yaitu sunburn dapat menenangkan kulit setelah beraktivitas di bawah sinar mataharini dan untuk menghidrasi dan menutrisi kulit wajah secara maksimal npure cica beat the sun powder ini bersifat noncomedogenic jadi aman untuk kamu yang punya kulit sensitif😍","157":"sesuka itu sama powder dari n’pure  favorite banget sih inimah  teksturnya juga lembut gtuh loh cocok banget buat kulit berminyak kaya aku  garibet dibawa kemana sesimple itu  pokoknya aku sih suka banget 😍 emng deh produk n’pure gapernah gagal ❤️","158":"aku nyobain ini karena fyp mulu kan di tiktok nah penasaran aku langsung beli kaget juga ada sunscreen bentuk powder pertama kali make seneng banget karena gaperlu hapus makeup sih kalau mau reapply sunscreen lagi hasilnya matte di muka aku bisa banget buat ngunci minyakkk dan makeup tetap on pointtt terus praktis buat dibawa kemana mana cara makenya sempet bingung tapi liat video video tutorial jadi bisa sih ini sunscreen membantu aku bangettt buat sehari hariii❤️😍","159":"teksturnya agak cair warna putih standar produk sunscreen cepat menyerap baunya hampir gada agak whitecast di awalnya jadi diratain aja sering dibiarin sampe 14 jam dan muka agak berminyak tapi overall tidak mengecewakan sih"},"Pre #3":{"0":"akhirnya beli produk ini pas banget lagi sale juga di ecommerce niat beli produk ini emang buat reapply sunscreen through out the day buat temen temen yang mau pake pastiin jangan pake produk ini sendirian jadi tetep harus pake sunscreen dan bisa di set lagi pake ini jadi produk ini emang diperuntukan buat reapply sunscreen yang mudah banget sihhh","1":"sun powder dari npure ini bagus bangett gaboong deh teksturnya lembut bgt dan benerbener melindungi kulit dari paparan sinar matahari jadi kalo males pake sunscreen biasa bisa langsung pake ini yg super praktisss sukak pwoll pokonya","2":"waw sumpah si ini sunscreen yang bener bener bagus banget pertama kali nyoba emang langsung cocok di muka akuselain itu tekstur nya itu ringan dan cepat meresap di kulit dan juga sekali pake muka aku langsung glowing beuh pokonya cinta banget sama sunscreen yang ini","3":"npure cica beat the sun powder ini benerbener menjawab kebingunganku kalau harus reapply sunscreen dengan kondisi wajah bermakeup tekstur powdernya halus  nggak menyumbat pori ataupun menimbulkan jerawat tanpa whitecast ringan di kulit dan menyerap minyak","4":"suka sama teksturnya powder dan aplikatornya brush ada spf 30nya membantu perlindungan uvauvb recomendded dan wajib direapply setiap dua jam sekali jadi pengen beli lagi kalo ini dah habis hehe i love it sama npure produknya bagus²","5":"aku agak pemilih kalo urusan sunscreen soalnya biasanya sunscreen itu lengket dan bikin ga nyaman tapi ini beda toner ini ga terlalu lengket cepet ngeresap ga bikin berasa pakai dempul juga dan yg paling penting ga nyumbat pori dan spf tinggi tubenya juga lucu","6":"cocok banget untuk melindungi kulit dari paparan sinar matahari karena mengandung kandungan utama spf terus yang aku suka dia ga geser makeup di wajah jadi aman banget untuk ditimpa diatas makeup selain itu karena dia bentuk powder bisa bantu matte in makeup yang terlalu dewy  oily","7":"suka banget dengan inovasi sekeren ini gak perlu lagi buat bingung untuk really sunscreen sekaligus touchup make up spf nya 30 juga seneng banget kalau reapply sunscreen bikin tetep stay flawless dan masih bikin cantik mulifungsi banget suka banget dah","8":"bagi aku dia bener bener unique because bayangin aja sunscrren sama bedak bisa jadi satudan yang lebih bagusnya lagi dia gabikin kukit bruntusan dan pas di apply dia gabikin kulit kita kliatan kayak berminyak gitu ooo ya aku saranin nih kalian wajib touch up 2 jam sekali","9":"sumpah unik banget sunscreenya bentuk bedak gituu dan ada kuasnyaa apalagi spf 30 persenn mantul banget di apkenya gk ribet dan bisa di apply berulangkali hehehhe kalian semua wajib punya karena praktis banget kaya pake bedak rekomen dan harganya terjangkau prahhhh","10":"pertama kali nyobain dan ternyata cocok di aku ga bikin kusam padahal warnanya sedikit gelap dari kulitku hehe dan hasilnya matte aku suka bangetttt trus kemasannya juga praktis cuman harus berkali kali gitu biar kliatan pake bedaknya hehehe","11":"sunscreen ternyaman yg pernahh aku cobainn sii guyss dengan tekstur yang superrr ringann poll ga susah pokoknya di blend nyaa sudah bpom no alcohol dan no fragrancee the bestttttttt ‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍","12":"pertama kali nyobain sunscreen yang bentuknya powder aku sukaaa ini sih soalnya gampang di bawa kemana mana apa lagi buat reapply sunscreen pas udah makeup menurut ku ini bneran bagusss jadinya makeup ga geser udah gitu bisa ngontrol minyak jugaaa","13":"suka banget sama produk ini karena powdernya ringan banget di kulit cara pakainya juga mudah hasil akhirnya di kulitku matte dan lumayan tahan lama kuasnya juga bagus lembut dan ga mudah rontok jadi gampang banget re apply sunscreen","14":"baru kali ini nyobain sunscreen powder yang ringan membantu menyerap minyak berlebih meminimalkan tampilan poriporisekaligus mengurangi kilau minyakjadi gak perlu hapus makeup lagi jika mau apply sunscreen ","15":"ini sunscreen paling cocok buat aku yang kulit sensitive ga lengket ge bikin berminyak dan ringan banget di wajah seriuss ini aku bakal repeat order ini terus kayanya karna secocok itu sama muka aku🤍 love banget sama cica beat te sun🤍🤍🤍","16":"bagus bangethdjdhdjjdjdjjsjdjdhhdhshshshshshshshshshsheheehhehehehdb jsjsjdjejej jejejejejjeje jejejejejejdjjd jejejejejejejejejjejeje jejejejejjeiee jejejejejeje jejejekekekkjejeejjeej nsjejejejejej jejejejejej","17":"powder suncreen pertama yang aku cobaa sekali coba langsung ketagihan wkwk soalnya cocok di kulit aku suka sama teksturnya lembut dan ringan finish looknya matte tapi tetep natural luv banget xx","18":"akhirnya nemuin sunscreen super simple garibet buat ngeapply selain itu tekstur powdernya halus banget seworth itu ini bakalan jadi sunscreean andalang aku thnk u n’pure udah ngeluarin produk cica beat the sun powder ini cocok banget di aku yang super mager","19":"demi apa sihh produk dr npure satu ini bener² baguss bgt buat ngatasin jerawat² aku yg sukaaa lama bgt sembuhnya cintaaa bgt sma produk ini\nrecommended bgt buat kalian nihhhhh jerawat bisa bener² kering dalam waktu yg lebih cepat","20":"sukaaa suka sukaa bangett  hasilnya ga whitecast cepet nyerep dan ga buat wajah berminyaak lengket smaa sekalii  buat re apply jg okee bangett  harganyaa murah jgg  superr recomended buat yg cari sunscreen no white cast  ga buat berminyak","21":"buat kalian yang punya kulit jerawatan merah2 sini banget lah kalian wajib cobain sunscreen satu ini dia ga ada bau sma skali teksturnya cukup ringan  ga bikin risih lengket gitu finishnya kalian ga usah takut makeuo rusak pas mo reaplly sunscreen krena ini gampang bngt di blend  cepat menyerap di kulit 🥰","22":"sukaa bgtt sama sunscreen dari npure cica beat the sun ini tekstur nya juga gampang di blend gampang jugaa meresap dan ga lengket sama sekalisudah bpom aman buat bu sui serta bebas dari bahan bahan berbahayaaa udah spf 50 jugaa lohh","23":"honest review dari aku ini sunscreen termasuk sunscreen yang unik banget karena bentuknya itu powder jadi memudahkan aku untuk retouch make up lumayan tahan lama dan tahan minyak packagingnya juga simple dan mudah dibawa kemana mana","24":"packaging nya bagus lucu dan mudah dibawa kemanamana jadi ga ribet  tekturnya cream ringan ga bikin whitecast jdi ga ngedempul gampang ngresap hasil akhirnya glowing cocok untuk semua jenis kulit harganya juga affordable bagus banget produknyaa ","25":"pliss ini sunscreen unik banget apalagi aplikatornya brush yang memudahkan untuk reapply dan touch up hasil akhirnya matte dan lumayan tahan minyak sesuai klaimnya aku reapply setiap 2 jam sekali walaupun langsung aku timpa dia ga bikin wajah kusam","26":"bagus bgtakhirnya bisa kebeli juga ini sunscreen ngerasa beruntusan ilang dan glowing aja pake inituh bukan yang minyakan cocok bgt buat kulit wajah aku yang normal to dry kaget pas beres ngeapply si cica beat sun ini trs lanjut tone up cream yang biasanya tone upnya susah diblend numpuk putih gitu skrg gampang bgt blendnya jadi rata putih glowing berkat si sunscreen ini suka bgttttt","27":"suka banget pake sunscreen dari npure cica beat the sun krna bagus banget terlihat kerutan bekurang dan tambah cerah wajah setelah rutin pakai produk ini  ga bikin lengket dan berminyak jg wajah setelah memakai rangkaian skincare lain","28":"sebelum pake yang powder aku pake yang ini dulu setelah aku pake ga berat dan ga ninggalin whitecast sih jadi ringan dan cepat menyerap gitu best combo kalo di paduin sama yang powder apalagi spf nya gede banget no worry deh tinggal apply yang powder","29":"asli sih ini sunscreen ter ga ribet impressed banget sama npure makasih puol udah ciptain sunscreen powder ini bawa kemanamana praktis juga bisa reapply tiap saat jadi ga perlu worried makeup kenapanapa ya kan hehe hasilnya matte finish juga","30":"ini adalah pertama kalinya gua coba pake product ini dan termyata sesuai ekspetasi emng sunscreenya bagus bgt kulit bener terlindungi dari sinar matahari dan skrg ga perlu kawatir lagi klu pergi pergi tinggal pakai dan ku bawa kemana mana","31":"bagus bget sih ini mana kandungan dan manfaatnya jga bagus bpom halal teruji secara dermatologis bebas sls bebas paraben bebas minyak mineral bebas alkohol bebas alergen ue bahan minimal bebas pewangi jadi kalian wajib coba yaaa","32":"produknya the best banget karna ini powder udah ada spf 30nya jadi mudah untuk reapply berkali kali teksturnya powdernya juga halus warnanya natural di muka dan hasilnya matte packagingnya jg aman bisa di bawa kmna mna aku recomended banget pokoknya ","33":"sun cream nya bagus banget karna spf 50 melindungi kita dari teriknya sinar matahari apalagi di siang siang itu bener bener panas banget dan bisa membuat kulit kusam bisa merah juga kan setelah pake spf sun cream in benerbener menjaga kulit kita dari paparan matahari melindungi banget trs bisa meng glowing kan muka kita juga tekstur nya ringan banget di wajah dan nyaman si menurut ku🤗","34":"kaget banget ternyata sebagus itu kulitku tuh kombinasi tapi masih aman banget gabikin berminyak cuma glowimg biasa aja terus gabuat kusam cepet banget nyerepnya bakal beli lagi ini mah wkwk padhaal harganya gamahal tapi kualitasnya oke banget","35":"produk nya super bagus ini selain pigmen di wajah juga ada spf nya 30 super bagus bukan gak perlu repotrepot pakai sunscreen lagi bisa lgs ini 2in1 hihi aku suka banget pakai ini kalian wajib coba sih 🥰","36":"bagusss bangett produknya cocok untuk semua jenis kulit jugaa loh nggaa lengket dikulitt teksturnya dan harganyaa juga ramah kantong bgt pokoknyaaaa aku rekomend bangettttt buat kalian beli produk inii skrng jugaaaaa yaaaa","37":"baru kali ini cocok pakai sunscreen biasanya over oily tapi ini tuh cepet bgt nyerepnya no whitecast trus udah gitu finishnya bener2 bikin kulit makin glowing dong omg skrg jadi sunscreen addict bgt berkat npure cica beat the sun wajib repurchase sih iniii","38":"n’pure cica beat the sun sunscreen  texturenya super light di kulit nyaman dipake seharian ga lengket ga ninggalin whitecast bikin muka jadi glowing tapi ga bikin greasy   dengan spf 50 pa sebagai uv filter agent nya sunscreen ini bakal memprotect kita dari paparan sinar uv a  uv b kandungan 100 natural cica centella asiatica leaf water yang terdapat didalamnya juga bagus banget untuk menenangkan kulit kita setelah terpapar sinar matahari  chrysanthemum extract chamomilla extract and camellia sinensis leaf extract didalamnya kaya akan antioksidan  antiinflammatory jadi bagus banget untuk kemerahan  menghidrasi kulit kita bpom halal dermatologically tested bumil busui friendly free from  paraben sls mineral oil alcohol silicone eu allergen  fragrance recommended 🥰","39":"produk npure emang paling dabest sih sunscreennya ini matte finish gitu cocok banget buat aku yang males touch up dan reapply sunscreen pas lagi di luar rumah hihi kandungannya juga gausah diragukan lagi worth to buy ","40":"sukaaa banget deh sama produk npure yang satu ini cica beat the sun powder  cocok banget buat aku yg mager banget kalo reapply sunscreen tapi semenjak ada produk ini aku gak mager lagi karena gampang banget di reapply nya dengan tekstur nya yg powder dan praktis banget buat di reapply  wajib banget sih punya produk npure yg satu ini  thankyou npure ","41":"suka banget sama sunscreen dari npure karena ga bikin kulit jadi berminyak ga bikin whitecast selain itu juga non paraben non alkohol  non fragrance cocok banget buat kulit sensitif kayak aku udah ada spf 50 pa  lagi terbaikkk 🥺","42":"suka bangeeeet sama tekturnyaaa aman buat wajahku yg sering jerawatanbruntusan gabikin iritasi ga berat sama sekali efeknya glowing bund  aman ditimpa sama makeup juga pas nge touch up juga enak banget walau diatas makeup tapi bisa menyerap kekulit selalu di repurchase ","43":"senang bangettt akhirnya bisa nemuin suncreen yang gampang di apply berkalikali tanpa harus hapus makeup duluuu yg aku suka juga warna tekturnya tuh natural jadi cocok juga buat jenis kulit yang sawo matang kaya akuuu thank uuu n’pure","44":"suka banget sama sunscreen ini awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan","45":"suka banget sama sunscreen ini awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan","46":"bener2 recommended banget deh cocok banget di mukaku spfnya juga tinggi dan ga buat muka aku kering sama ga ada efect putih nya di mukaku dan yang aku suka lagi harganya juga ga mahal deh dengan punya banyak manfaat untuk sunscream bener2 suka banget deh pokoknya","47":"ini produk yg wajib dipake harus punya pokoknya suka banget pakai sunscreen n pure ini bisa buat base makeup juga krna gak lengket di kulit trus cepet meresap harganya juga ramah dikantong recomended deh pokoknya next mau beli lagi","48":"sudah sebulanan ini aku pakai cica beat the sun npure teksturnya pas tidak terlalu kental dan tidak lengket nyaman di kulit meresap cepat dan ada kandungan spf 50 pa cukup tinggi serta di kulitku no whitecast namun tips jika kulitmu berminyak padukan dengan cica beat the sun powder yah","49":"buat yang punya kulit kering pasti bakal suka sama produk ini setelah dipake langsung auto glowing glass skin ala2 korea gitu tapi ga terasa lengket  greasy sama sekali dan pastinya bikin kulit terasa lembab seharian spf nya juga tinggi dan proteksi nya udh lengkap cocok juga untuk dijadikan base makeup jdi lebih nempel dan mulus","50":"teksturnya ringan banget dengan hasil matte finish penolong banget buat wajah aku yg oily ini ada spf 30 nya pula dan produknya juga praktis dibawa kemana dan bentuknya juga praktis banget gk ribet kalo mau reaply","51":"the finish looks good on my combi to dry skin kalo pake ss emang suka yg glowwy finish dan ini ga bikin gerah sama sekaliii gampang di blend jugaa dan minim oksidasii tapi kayaknya oil controlnya kurang tapi apply 3 kali sehari sekali udah enak banget bakal repurchase sih","52":"aaaaaa akhirnya ga worry lagi kalo lagi makeup harus reapply sunscreen sangat amat membantu aku yang kerjanya makeup tapi ttp terpapar matahari yang kerennya lagi selain doi memproteksi kulit dari efek uva uvb bisa sekalian touch up makeup jadi matte dan flawless must try","53":"aku suka sama sunscreen ini teksturnya gampang menyerap gak kental dan gak berat overall aku cocok biasanya kalo gak cocok aku akan timbul jerawat tapi ini gak aku ngerasa juga wajah aku tetap terasa lembab terus package nya juga aku suka di ujung buka tutup nya bentuknya kayak plastik bening gitu yang buat jd unik aja gak tau pertama kali liat langsung wah lucu hehe🤗","54":"ini highly recommended sih buat daily enak bgt simple dipakenya ga ribet mana teksturnya enak bgt ringan🤍 asli muka aku biasanya jam 12an gt udh oily dipakein ini langsung ngeset lagi kaya baru pake make up🥲🤍","55":"selama pake produk ini  aku ngerasa kulit ku terlindungi  karena jujur kulitku tipe yang suka sakit dan kemerahan disaat kena sinar matahari dan karena kebanyakan sunscreen bertexture creamy bkin aku susah meratakan creamnya diwajah dan bkin sakit akhirnya aku stop pake tapi setelah pake npure aku gak lagi khawatir karena lbh cepat meresap dan cpt bekerja di kulit wajah aku","56":"gilakkk sih produknya bagus bgt udah spf 50 pa selain itu dri packagingnya simple bgt buat di bawa kemana2 kesan pertama pakai langsung memberi efek glowing pada kulitku serta teksturnya ringan bgtt fix produknya npure emang bagus2 bgt apalagi yang cica beat the sun powder ini kalian harus cobaaaa ","57":"terima kasih bgt buat npure yg sudah bikin produk ini karena reapply sunscreen jadi mudah suka bgt sama sunscreen ini  pas buat aku yg suka pake makeup finishnya matte nggak geser makeup  gampang bgt pakenya","58":"nyaman digunain bikin glowing diwajah gak kering dan adem di kulit wajib dipake buat klian yg sering aktifitas di luar ruangan haruuus bgt ini buat perlindungan yaaaaaaaaaaaaa","59":"pertama kali coba sunscreen versi powder hasilnya matte dan natural biasanya aku pakai di akhir setelah skincarean atau makeup selama 2 minggu kulitku ga menimbulkan reaksi negatif alias cocok super suka sama kemasannya yang unik ringan dan praktis bisa di bawa kemana aja","60":"yayyy akhirnya aku nemuin sunscreen yang cocok banget di kulit aku mudah di aaplikasikan mudah di blend dan tidak lengket sama sekali sunscreen ini alcohol free loh jadi aman banget untuk kulit sensitif seperti kulitku bakal beli lagi sih kalo udah habis","61":"aku udah pake produk ini sekitar 2 bulan lebih teksturnya aga sedikit cair gampang banget buat diblend dan yang paling aku suka itu adalah bikin muka jadi glowing bangetdan tentunya karena aman buat jerawat makanya aku cinta banget sama produk ini","62":"iiiii mampuy suka bgt sama sunscreen ini bener2 nyaman di pakenya dan bikin wajah keliatan glowing sehat cerah  teksturnya rada cair dan mudah di applikasiin setiap pake ini ak ngerasa dia lumayan ada efek tone up tp ga bikin muka abu2  suka nih kalo cocok sama produk2 lokal harganya jg masi masuk akal sesuai kualitas","63":"50\nsunscreen terbaik menurut aku dia gak bikin kulit berminyak gitu setelah diapply trus gak bikin muka kita cepet minyakan enak juga cepat meresap packagingnya praktis dan bisa dibawa kemana aja rekomen banget pokoknyaaaharganya juga terjangkau  manfaatnya juga juara","64":"omg ini sunscreen terlembut yang pernah aku coba enak banget dikulit aku bikin kulit wajah aku lembab jujur suncreen npure cica beat the sun ini bagus banget dong melindungi dari sinar matahari apa lagi aku banyak banget kegiatan diluar sebelum aku beraktifitas aku pake dulu next abis mau beli lagi","65":"pengalaman pertamaku pake sunscreem powder dari n pure ini tuh bener bener sukaa banget  karna baru kali ini nemuin produk sunscreen yg powder dengan kemasan praktis untuk dibawa traveling uda dilengkapi juga dengan spf 30 dan bisa dipake sebagai step ke 2 setelah sunscreen creamnya mantul banget deh","66":"lucu bgt sunscreen powder  packagingnya retractable  aplikator brushnya lembut bgt warnanya beige tapi ga merubah warna kulit malah bikin kulit makin cerah  simple lagi kalo mau touch up tinggal tap puter2 kaya pake blussh on  harganya jg affordable ","67":"wow sumpah pertama kalinya cobain sunscreen bentuk powder so far i luv this product so much pertama untuk packagingnya retractable dan brushnya soft bangettt untuk tekstur sedikit powder but its okay bcs finishnya matte natural and no whitecast sun powder ini juga tetep menghidrasi kulit walau finishnya matte luv it🥰","68":"baru pertama kali nyobain sun powder dan menurut aku feelsnya sama aja kayak kita pake loose powder gitu finishnya matte tapi di kulitku yg medium light dia ga kelihatan dempul dan jatuhnya natural banget nyatu ke warna kulit asli butirannya super halus dan kuasnya juga jd ga buat muka terasa kegores kemasannya super mini jadi enak buat dibawa kemanamana sayangnya karna dia sun powder jd kurang efektif klw dipake single aja harus pake sunscreen lotion dlu jadi jatuhnya produk ini tuh kayak ngeset riasan di bawahnya ama maksimalin proteksi lebh cocok dipake buat reapply apalagi pas makeup jd ga takut makeupnya tergeser so far aman aja sih di kulit aku dan worth to try tp krna harganya lumayan out of my budget aku prefer belinya pas promo aja wkwk","69":"seneng banget akhirnya nemu sunscreen powder yg slama ini aku cari2 ternyata npure punya produknya doomss sumpah ini bagus banget cocok banget dikulit aku yg super duper sensitif huhhh popoknya ini recomended deehhh","70":"baru kali ini punya sunscreen dalam bentuk powder apalagi aplikatornya brush dan suka banget apalagi pas pakai makeup reapply jadi lebih praktis matte finish dan bisa mengontrol minyak berlebih di wajah","71":"pertama kali cobain sunscreen dan langsung suka 🥺 pas di blend benerbener nyerap ke kulit dan bikin glowing dong  ringan juga di wajah  ini cocok banget buat yg dry skin ya soalnya habis pakai sunscreen npure ini wajahku jadi lembab  suka ","72":"suka banget sama sun powdernya pacakgingnya kuat udah beberapa kali jatoh tapi masih kuat ga rusak untungnya trus juga hasilnya matte bagus gitu ga ngegeser makeup sama skali sih trus efisien banget juga jadinya seneng dibawa kemana2","73":"pertama kali beli karena sering banget lewat fyp tktk aku awal pemakaian ternyata ringan gak ada whitecast gak lengket juga nyaman banget dipake gak bikin wajah tambah minyakan karena jenis kulitku yang oily masih aman dan nyaman dipake","74":"baru kali ini cobain sun screen powder dari npure dan kayanya baru npure yang keluarin produk kaya gini emang bagus banget sih bkn muka ga lepek dn lengket lgi klo diluar rumah  packagingnnya jg lucu gampang dibawa kemana2 ga makan tempat","75":"ini powder yang terdebest banget sih menurutku selain ada spf nya powder ini waktu di apply ke wajah tekstur nya ringan sama sekali dan ngurangin minyak diwajah jugaaa apalagi aku emang dari pagi sd sore aktivitasnya diluar teruuussssss kemasannya yang minimalis bikin jadi gampang dibawa kemanamana🥰 bakalan jadi powder fav aku sih ini‍","76":"npure cica beat the sun powder ini cocok banget untuk kulit yang berminyak seperti aku seperti yang kita tau reapply sunscreen itu penting banget apalagi kalo sering kegiatan di outdoor\nproduk ini praktis banget sih karna gampang banget dibawa kemanamana juga pas di reapply mudah banget karna tinggal diusap di wajah dan sekalipun muka kita masih ada makeup nyatidak buat makeup kita bergeser🥰untuk packaging nya sunscreen powder dari n’pure ini dikemas dalam tabung plastik mini berwarna hijau emerald bagian bawah tabungnya bening sehingga sunscreen powdernya kelihatan bagian atas tabung disambungkan dengan brush kuas warna cream kuas ini lembut banget sehingga mudah digunakan untuk seluruh bagian wajah kandungan dalam produk ini terdiri dari ada titanium dioxide ethylhexyl salicylate ethylhexyl methoxycinnamate natural centella asiatica leaf water rice bran oil dan vitamin e dan produk ini memiliki beragam manfaaf yaitu memberi perlindungan maksimal terhadap efek buruk sinar matahari pada kulit wajah dapat menangkal sinar uva maupun uvb secara efektif yang berpotensi dapat merusak kulit dapat melindungi kulit dari kerusakan karena paparan sinar matahari salah satunya yaitu sunburn dapat menenangkan kulit setelah beraktivitas di bawah sinar mataharini dan untuk menghidrasi dan menutrisi kulit wajah secara maksimal npure cica beat the sun powder ini bersifat noncomedogenic jadi aman untuk kamu yang punya kulit sensitif","77":"sesuka itu sama powder dari n’pure  favorite banget sih inimah  teksturnya juga lembut gtuh loh cocok banget buat kulit berminyak kaya aku  garibet dibawa kemana sesimple itu  pokoknya aku sih suka banget  emng deh produk n’pure gapernah gagal ","78":"aku nyobain ini karena fyp mulu kan di tiktok nah penasaran aku langsung beli kaget juga ada sunscreen bentuk powder pertama kali make seneng banget karena gaperlu hapus makeup sih kalau mau reapply sunscreen lagi hasilnya matte di muka aku bisa banget buat ngunci minyakkk dan makeup tetap on pointtt terus praktis buat dibawa kemana mana cara makenya sempet bingung tapi liat video video tutorial jadi bisa sih ini sunscreen membantu aku bangettt buat sehari hariii","79":"teksturnya agak cair warna putih standar produk sunscreen cepat menyerap baunya hampir gada agak whitecast di awalnya jadi diratain aja sering dibiarin sampe 14 jam dan muka agak berminyak tapi overall tidak mengecewakan sih","80":"akhirnya beli produk ini pas banget lagi sale juga di ecommerce niat beli produk ini emang buat reapply sunscreen through out the day buat temen temen yang mau pake pastiin jangan pake produk ini sendirian jadi tetep harus pake sunscreen dan bisa di set lagi pake ini jadi produk ini emang diperuntukan buat reapply sunscreen yang mudah banget sihhh","81":"sun powder dari npure ini bagus bangett gaboong deh teksturnya lembut bgt dan benerbener melindungi kulit dari paparan sinar matahari jadi kalo males pake sunscreen biasa bisa langsung pake ini yg super praktisss sukak pwoll pokonya","82":"waw sumpah si ini sunscreen yang bener bener bagus banget pertama kali nyoba emang langsung cocok di muka akuselain itu tekstur nya itu ringan dan cepat meresap di kulit dan juga sekali pake muka aku langsung glowing beuh pokonya cinta banget sama sunscreen yang ini","83":"npure cica beat the sun powder ini benerbener menjawab kebingunganku kalau harus reapply sunscreen dengan kondisi wajah bermakeup tekstur powdernya halus  nggak menyumbat pori ataupun menimbulkan jerawat tanpa whitecast ringan di kulit dan menyerap minyak","84":"suka sama teksturnya powder dan aplikatornya brush ada spf 30nya membantu perlindungan uvauvb recomendded dan wajib direapply setiap dua jam sekali jadi pengen beli lagi kalo ini dah habis hehe i love it sama npure produknya bagus²","85":"aku agak pemilih kalo urusan sunscreen soalnya biasanya sunscreen itu lengket dan bikin ga nyaman tapi ini beda toner ini ga terlalu lengket cepet ngeresap ga bikin berasa pakai dempul juga dan yg paling penting ga nyumbat pori dan spf tinggi tubenya juga lucu","86":"cocok banget untuk melindungi kulit dari paparan sinar matahari karena mengandung kandungan utama spf terus yang aku suka dia ga geser makeup di wajah jadi aman banget untuk ditimpa diatas makeup selain itu karena dia bentuk powder bisa bantu matte in makeup yang terlalu dewy  oily","87":"suka banget dengan inovasi sekeren ini gak perlu lagi buat bingung untuk really sunscreen sekaligus touchup make up spf nya 30 juga seneng banget kalau reapply sunscreen bikin tetep stay flawless dan masih bikin cantik mulifungsi banget suka banget dah","88":"bagi aku dia bener bener unique because bayangin aja sunscrren sama bedak bisa jadi satudan yang lebih bagusnya lagi dia gabikin kukit bruntusan dan pas di apply dia gabikin kulit kita kliatan kayak berminyak gitu ooo ya aku saranin nih kalian wajib touch up 2 jam sekali","89":"sumpah unik banget sunscreenya bentuk bedak gituu dan ada kuasnyaa apalagi spf 30 persenn mantul banget di apkenya gk ribet dan bisa di apply berulangkali hehehhe kalian semua wajib punya karena praktis banget kaya pake bedak rekomen dan harganya terjangkau prahhhh","90":"pertama kali nyobain dan ternyata cocok di aku ga bikin kusam padahal warnanya sedikit gelap dari kulitku hehe dan hasilnya matte aku suka bangetttt trus kemasannya juga praktis cuman harus berkali kali gitu biar kliatan pake bedaknya hehehe","91":"sunscreen ternyaman yg pernahh aku cobainn sii guyss dengan tekstur yang superrr ringann poll ga susah pokoknya di blend nyaa sudah bpom no alcohol dan no fragrancee the bestttttttt ‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍","92":"pertama kali nyobain sunscreen yang bentuknya powder aku sukaaa ini sih soalnya gampang di bawa kemana mana apa lagi buat reapply sunscreen pas udah makeup menurut ku ini bneran bagusss jadinya makeup ga geser udah gitu bisa ngontrol minyak jugaaa","93":"suka banget sama produk ini karena powdernya ringan banget di kulit cara pakainya juga mudah hasil akhirnya di kulitku matte dan lumayan tahan lama kuasnya juga bagus lembut dan ga mudah rontok jadi gampang banget re apply sunscreen","94":"baru kali ini nyobain sunscreen powder yang ringan membantu menyerap minyak berlebih meminimalkan tampilan poriporisekaligus mengurangi kilau minyakjadi gak perlu hapus makeup lagi jika mau apply sunscreen ","95":"ini sunscreen paling cocok buat aku yang kulit sensitive ga lengket ge bikin berminyak dan ringan banget di wajah seriuss ini aku bakal repeat order ini terus kayanya karna secocok itu sama muka aku🤍 love banget sama cica beat te sun🤍🤍🤍","96":"bagus bangethdjdhdjjdjdjjsjdjdhhdhshshshshshshshshshsheheehhehehehdb jsjsjdjejej jejejejejjeje jejejejejejdjjd jejejejejejejejejjejeje jejejejejjeiee jejejejejeje jejejekekekkjejeejjeej nsjejejejejej jejejejejej","97":"powder suncreen pertama yang aku cobaa sekali coba langsung ketagihan wkwk soalnya cocok di kulit aku suka sama teksturnya lembut dan ringan finish looknya matte tapi tetep natural luv banget xx","98":"akhirnya nemuin sunscreen super simple garibet buat ngeapply selain itu tekstur powdernya halus banget seworth itu ini bakalan jadi sunscreean andalang aku thnk u n’pure udah ngeluarin produk cica beat the sun powder ini cocok banget di aku yang super mager","99":"demi apa sihh produk dr npure satu ini bener² baguss bgt buat ngatasin jerawat² aku yg sukaaa lama bgt sembuhnya cintaaa bgt sma produk ini\nrecommended bgt buat kalian nihhhhh jerawat bisa bener² kering dalam waktu yg lebih cepat","100":"sukaaa suka sukaa bangett  hasilnya ga whitecast cepet nyerep dan ga buat wajah berminyaak lengket smaa sekalii  buat re apply jg okee bangett  harganyaa murah jgg  superr recomended buat yg cari sunscreen no white cast  ga buat berminyak","101":"buat kalian yang punya kulit jerawatan merah2 sini banget lah kalian wajib cobain sunscreen satu ini dia ga ada bau sma skali teksturnya cukup ringan  ga bikin risih lengket gitu finishnya kalian ga usah takut makeuo rusak pas mo reaplly sunscreen krena ini gampang bngt di blend  cepat menyerap di kulit 🥰","102":"sukaa bgtt sama sunscreen dari npure cica beat the sun ini tekstur nya juga gampang di blend gampang jugaa meresap dan ga lengket sama sekalisudah bpom aman buat bu sui serta bebas dari bahan bahan berbahayaaa udah spf 50 jugaa lohh","103":"honest review dari aku ini sunscreen termasuk sunscreen yang unik banget karena bentuknya itu powder jadi memudahkan aku untuk retouch make up lumayan tahan lama dan tahan minyak packagingnya juga simple dan mudah dibawa kemana mana","104":"packaging nya bagus lucu dan mudah dibawa kemanamana jadi ga ribet  tekturnya cream ringan ga bikin whitecast jdi ga ngedempul gampang ngresap hasil akhirnya glowing cocok untuk semua jenis kulit harganya juga affordable bagus banget produknyaa ","105":"pliss ini sunscreen unik banget apalagi aplikatornya brush yang memudahkan untuk reapply dan touch up hasil akhirnya matte dan lumayan tahan minyak sesuai klaimnya aku reapply setiap 2 jam sekali walaupun langsung aku timpa dia ga bikin wajah kusam","106":"bagus bgtakhirnya bisa kebeli juga ini sunscreen ngerasa beruntusan ilang dan glowing aja pake inituh bukan yang minyakan cocok bgt buat kulit wajah aku yang normal to dry kaget pas beres ngeapply si cica beat sun ini trs lanjut tone up cream yang biasanya tone upnya susah diblend numpuk putih gitu skrg gampang bgt blendnya jadi rata putih glowing berkat si sunscreen ini suka bgttttt","107":"suka banget pake sunscreen dari npure cica beat the sun krna bagus banget terlihat kerutan bekurang dan tambah cerah wajah setelah rutin pakai produk ini  ga bikin lengket dan berminyak jg wajah setelah memakai rangkaian skincare lain","108":"sebelum pake yang powder aku pake yang ini dulu setelah aku pake ga berat dan ga ninggalin whitecast sih jadi ringan dan cepat menyerap gitu best combo kalo di paduin sama yang powder apalagi spf nya gede banget no worry deh tinggal apply yang powder","109":"asli sih ini sunscreen ter ga ribet impressed banget sama npure makasih puol udah ciptain sunscreen powder ini bawa kemanamana praktis juga bisa reapply tiap saat jadi ga perlu worried makeup kenapanapa ya kan hehe hasilnya matte finish juga","110":"ini adalah pertama kalinya gua coba pake product ini dan termyata sesuai ekspetasi emng sunscreenya bagus bgt kulit bener terlindungi dari sinar matahari dan skrg ga perlu kawatir lagi klu pergi pergi tinggal pakai dan ku bawa kemana mana","111":"bagus bget sih ini mana kandungan dan manfaatnya jga bagus bpom halal teruji secara dermatologis bebas sls bebas paraben bebas minyak mineral bebas alkohol bebas alergen ue bahan minimal bebas pewangi jadi kalian wajib coba yaaa","112":"produknya the best banget karna ini powder udah ada spf 30nya jadi mudah untuk reapply berkali kali teksturnya powdernya juga halus warnanya natural di muka dan hasilnya matte packagingnya jg aman bisa di bawa kmna mna aku recomended banget pokoknya ","113":"sun cream nya bagus banget karna spf 50 melindungi kita dari teriknya sinar matahari apalagi di siang siang itu bener bener panas banget dan bisa membuat kulit kusam bisa merah juga kan setelah pake spf sun cream in benerbener menjaga kulit kita dari paparan matahari melindungi banget trs bisa meng glowing kan muka kita juga tekstur nya ringan banget di wajah dan nyaman si menurut ku🤗","114":"kaget banget ternyata sebagus itu kulitku tuh kombinasi tapi masih aman banget gabikin berminyak cuma glowimg biasa aja terus gabuat kusam cepet banget nyerepnya bakal beli lagi ini mah wkwk padhaal harganya gamahal tapi kualitasnya oke banget","115":"produk nya super bagus ini selain pigmen di wajah juga ada spf nya 30 super bagus bukan gak perlu repotrepot pakai sunscreen lagi bisa lgs ini 2in1 hihi aku suka banget pakai ini kalian wajib coba sih 🥰","116":"bagusss bangett produknya cocok untuk semua jenis kulit jugaa loh nggaa lengket dikulitt teksturnya dan harganyaa juga ramah kantong bgt pokoknyaaaa aku rekomend bangettttt buat kalian beli produk inii skrng jugaaaaa yaaaa","117":"baru kali ini cocok pakai sunscreen biasanya over oily tapi ini tuh cepet bgt nyerepnya no whitecast trus udah gitu finishnya bener2 bikin kulit makin glowing dong omg skrg jadi sunscreen addict bgt berkat npure cica beat the sun wajib repurchase sih iniii","118":"n’pure cica beat the sun sunscreen  texturenya super light di kulit nyaman dipake seharian ga lengket ga ninggalin whitecast bikin muka jadi glowing tapi ga bikin greasy   dengan spf 50 pa sebagai uv filter agent nya sunscreen ini bakal memprotect kita dari paparan sinar uv a  uv b kandungan 100 natural cica centella asiatica leaf water yang terdapat didalamnya juga bagus banget untuk menenangkan kulit kita setelah terpapar sinar matahari  chrysanthemum extract chamomilla extract and camellia sinensis leaf extract didalamnya kaya akan antioksidan  antiinflammatory jadi bagus banget untuk kemerahan  menghidrasi kulit kita bpom halal dermatologically tested bumil busui friendly free from  paraben sls mineral oil alcohol silicone eu allergen  fragrance recommended 🥰","119":"produk npure emang paling dabest sih sunscreennya ini matte finish gitu cocok banget buat aku yang males touch up dan reapply sunscreen pas lagi di luar rumah hihi kandungannya juga gausah diragukan lagi worth to buy ","120":"sukaaa banget deh sama produk npure yang satu ini cica beat the sun powder  cocok banget buat aku yg mager banget kalo reapply sunscreen tapi semenjak ada produk ini aku gak mager lagi karena gampang banget di reapply nya dengan tekstur nya yg powder dan praktis banget buat di reapply  wajib banget sih punya produk npure yg satu ini  thankyou npure ","121":"suka banget sama sunscreen dari npure karena ga bikin kulit jadi berminyak ga bikin whitecast selain itu juga non paraben non alkohol  non fragrance cocok banget buat kulit sensitif kayak aku udah ada spf 50 pa  lagi terbaikkk 🥺","122":"suka bangeeeet sama tekturnyaaa aman buat wajahku yg sering jerawatanbruntusan gabikin iritasi ga berat sama sekali efeknya glowing bund  aman ditimpa sama makeup juga pas nge touch up juga enak banget walau diatas makeup tapi bisa menyerap kekulit selalu di repurchase ","123":"senang bangettt akhirnya bisa nemuin suncreen yang gampang di apply berkalikali tanpa harus hapus makeup duluuu yg aku suka juga warna tekturnya tuh natural jadi cocok juga buat jenis kulit yang sawo matang kaya akuuu thank uuu n’pure","124":"suka banget sama sunscreen ini awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan","125":"suka banget sama sunscreen ini awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan","126":"bener2 recommended banget deh cocok banget di mukaku spfnya juga tinggi dan ga buat muka aku kering sama ga ada efect putih nya di mukaku dan yang aku suka lagi harganya juga ga mahal deh dengan punya banyak manfaat untuk sunscream bener2 suka banget deh pokoknya","127":"ini produk yg wajib dipake harus punya pokoknya suka banget pakai sunscreen n pure ini bisa buat base makeup juga krna gak lengket di kulit trus cepet meresap harganya juga ramah dikantong recomended deh pokoknya next mau beli lagi","128":"sudah sebulanan ini aku pakai cica beat the sun npure teksturnya pas tidak terlalu kental dan tidak lengket nyaman di kulit meresap cepat dan ada kandungan spf 50 pa cukup tinggi serta di kulitku no whitecast namun tips jika kulitmu berminyak padukan dengan cica beat the sun powder yah","129":"buat yang punya kulit kering pasti bakal suka sama produk ini setelah dipake langsung auto glowing glass skin ala2 korea gitu tapi ga terasa lengket  greasy sama sekali dan pastinya bikin kulit terasa lembab seharian spf nya juga tinggi dan proteksi nya udh lengkap cocok juga untuk dijadikan base makeup jdi lebih nempel dan mulus","130":"teksturnya ringan banget dengan hasil matte finish penolong banget buat wajah aku yg oily ini ada spf 30 nya pula dan produknya juga praktis dibawa kemana dan bentuknya juga praktis banget gk ribet kalo mau reaply","131":"the finish looks good on my combi to dry skin kalo pake ss emang suka yg glowwy finish dan ini ga bikin gerah sama sekaliii gampang di blend jugaa dan minim oksidasii tapi kayaknya oil controlnya kurang tapi apply 3 kali sehari sekali udah enak banget bakal repurchase sih","132":"aaaaaa akhirnya ga worry lagi kalo lagi makeup harus reapply sunscreen sangat amat membantu aku yang kerjanya makeup tapi ttp terpapar matahari yang kerennya lagi selain doi memproteksi kulit dari efek uva uvb bisa sekalian touch up makeup jadi matte dan flawless must try","133":"aku suka sama sunscreen ini teksturnya gampang menyerap gak kental dan gak berat overall aku cocok biasanya kalo gak cocok aku akan timbul jerawat tapi ini gak aku ngerasa juga wajah aku tetap terasa lembab terus package nya juga aku suka di ujung buka tutup nya bentuknya kayak plastik bening gitu yang buat jd unik aja gak tau pertama kali liat langsung wah lucu hehe🤗","134":"ini highly recommended sih buat daily enak bgt simple dipakenya ga ribet mana teksturnya enak bgt ringan🤍 asli muka aku biasanya jam 12an gt udh oily dipakein ini langsung ngeset lagi kaya baru pake make up🥲🤍","135":"selama pake produk ini  aku ngerasa kulit ku terlindungi  karena jujur kulitku tipe yang suka sakit dan kemerahan disaat kena sinar matahari dan karena kebanyakan sunscreen bertexture creamy bkin aku susah meratakan creamnya diwajah dan bkin sakit akhirnya aku stop pake tapi setelah pake npure aku gak lagi khawatir karena lbh cepat meresap dan cpt bekerja di kulit wajah aku","136":"gilakkk sih produknya bagus bgt udah spf 50 pa selain itu dri packagingnya simple bgt buat di bawa kemana2 kesan pertama pakai langsung memberi efek glowing pada kulitku serta teksturnya ringan bgtt fix produknya npure emang bagus2 bgt apalagi yang cica beat the sun powder ini kalian harus cobaaaa ","137":"nyaman digunain bikin glowing diwajah gak kering dan adem di kulit wajib dipake buat klian yg sering aktifitas di luar ruangan haruuus bgt ini buat perlindungan yaaaaaaaaaaaaa","138":"terima kasih bgt buat npure yg sudah bikin produk ini karena reapply sunscreen jadi mudah suka bgt sama sunscreen ini  pas buat aku yg suka pake makeup finishnya matte nggak geser makeup  gampang bgt pakenya","139":"pertama kali coba sunscreen versi powder hasilnya matte dan natural biasanya aku pakai di akhir setelah skincarean atau makeup selama 2 minggu kulitku ga menimbulkan reaksi negatif alias cocok super suka sama kemasannya yang unik ringan dan praktis bisa di bawa kemana aja","140":"yayyy akhirnya aku nemuin sunscreen yang cocok banget di kulit aku mudah di aaplikasikan mudah di blend dan tidak lengket sama sekali sunscreen ini alcohol free loh jadi aman banget untuk kulit sensitif seperti kulitku bakal beli lagi sih kalo udah habis","141":"aku udah pake produk ini sekitar 2 bulan lebih teksturnya aga sedikit cair gampang banget buat diblend dan yang paling aku suka itu adalah bikin muka jadi glowing bangetdan tentunya karena aman buat jerawat makanya aku cinta banget sama produk ini","142":"iiiii mampuy suka bgt sama sunscreen ini bener2 nyaman di pakenya dan bikin wajah keliatan glowing sehat cerah  teksturnya rada cair dan mudah di applikasiin setiap pake ini ak ngerasa dia lumayan ada efek tone up tp ga bikin muka abu2  suka nih kalo cocok sama produk2 lokal harganya jg masi masuk akal sesuai kualitas","143":"50\nsunscreen terbaik menurut aku dia gak bikin kulit berminyak gitu setelah diapply trus gak bikin muka kita cepet minyakan enak juga cepat meresap packagingnya praktis dan bisa dibawa kemana aja rekomen banget pokoknyaaaharganya juga terjangkau  manfaatnya juga juara","144":"omg ini sunscreen terlembut yang pernah aku coba enak banget dikulit aku bikin kulit wajah aku lembab jujur suncreen npure cica beat the sun ini bagus banget dong melindungi dari sinar matahari apa lagi aku banyak banget kegiatan diluar sebelum aku beraktifitas aku pake dulu next abis mau beli lagi","145":"pengalaman pertamaku pake sunscreem powder dari n pure ini tuh bener bener sukaa banget  karna baru kali ini nemuin produk sunscreen yg powder dengan kemasan praktis untuk dibawa traveling uda dilengkapi juga dengan spf 30 dan bisa dipake sebagai step ke 2 setelah sunscreen creamnya mantul banget deh","146":"lucu bgt sunscreen powder  packagingnya retractable  aplikator brushnya lembut bgt warnanya beige tapi ga merubah warna kulit malah bikin kulit makin cerah  simple lagi kalo mau touch up tinggal tap puter2 kaya pake blussh on  harganya jg affordable ","147":"wow sumpah pertama kalinya cobain sunscreen bentuk powder so far i luv this product so much pertama untuk packagingnya retractable dan brushnya soft bangettt untuk tekstur sedikit powder but its okay bcs finishnya matte natural and no whitecast sun powder ini juga tetep menghidrasi kulit walau finishnya matte luv it🥰","148":"baru pertama kali nyobain sun powder dan menurut aku feelsnya sama aja kayak kita pake loose powder gitu finishnya matte tapi di kulitku yg medium light dia ga kelihatan dempul dan jatuhnya natural banget nyatu ke warna kulit asli butirannya super halus dan kuasnya juga jd ga buat muka terasa kegores kemasannya super mini jadi enak buat dibawa kemanamana sayangnya karna dia sun powder jd kurang efektif klw dipake single aja harus pake sunscreen lotion dlu jadi jatuhnya produk ini tuh kayak ngeset riasan di bawahnya ama maksimalin proteksi lebh cocok dipake buat reapply apalagi pas makeup jd ga takut makeupnya tergeser so far aman aja sih di kulit aku dan worth to try tp krna harganya lumayan out of my budget aku prefer belinya pas promo aja wkwk","149":"seneng banget akhirnya nemu sunscreen powder yg slama ini aku cari2 ternyata npure punya produknya doomss sumpah ini bagus banget cocok banget dikulit aku yg super duper sensitif huhhh popoknya ini recomended deehhh","150":"baru kali ini punya sunscreen dalam bentuk powder apalagi aplikatornya brush dan suka banget apalagi pas pakai makeup reapply jadi lebih praktis matte finish dan bisa mengontrol minyak berlebih di wajah","151":"suka banget sama sun powdernya pacakgingnya kuat udah beberapa kali jatoh tapi masih kuat ga rusak untungnya trus juga hasilnya matte bagus gitu ga ngegeser makeup sama skali sih trus efisien banget juga jadinya seneng dibawa kemana2","152":"pertama kali cobain sunscreen dan langsung suka 🥺 pas di blend benerbener nyerap ke kulit dan bikin glowing dong  ringan juga di wajah  ini cocok banget buat yg dry skin ya soalnya habis pakai sunscreen npure ini wajahku jadi lembab  suka ","153":"pertama kali beli karena sering banget lewat fyp tktk aku awal pemakaian ternyata ringan gak ada whitecast gak lengket juga nyaman banget dipake gak bikin wajah tambah minyakan karena jenis kulitku yang oily masih aman dan nyaman dipake","154":"baru kali ini cobain sun screen powder dari npure dan kayanya baru npure yang keluarin produk kaya gini emang bagus banget sih bkn muka ga lepek dn lengket lgi klo diluar rumah  packagingnnya jg lucu gampang dibawa kemana2 ga makan tempat","155":"ini powder yang terdebest banget sih menurutku selain ada spf nya powder ini waktu di apply ke wajah tekstur nya ringan sama sekali dan ngurangin minyak diwajah jugaaa apalagi aku emang dari pagi sd sore aktivitasnya diluar teruuussssss kemasannya yang minimalis bikin jadi gampang dibawa kemanamana🥰 bakalan jadi powder fav aku sih ini‍","156":"npure cica beat the sun powder ini cocok banget untuk kulit yang berminyak seperti aku seperti yang kita tau reapply sunscreen itu penting banget apalagi kalo sering kegiatan di outdoor\nproduk ini praktis banget sih karna gampang banget dibawa kemanamana juga pas di reapply mudah banget karna tinggal diusap di wajah dan sekalipun muka kita masih ada makeup nyatidak buat makeup kita bergeser🥰untuk packaging nya sunscreen powder dari n’pure ini dikemas dalam tabung plastik mini berwarna hijau emerald bagian bawah tabungnya bening sehingga sunscreen powdernya kelihatan bagian atas tabung disambungkan dengan brush kuas warna cream kuas ini lembut banget sehingga mudah digunakan untuk seluruh bagian wajah kandungan dalam produk ini terdiri dari ada titanium dioxide ethylhexyl salicylate ethylhexyl methoxycinnamate natural centella asiatica leaf water rice bran oil dan vitamin e dan produk ini memiliki beragam manfaaf yaitu memberi perlindungan maksimal terhadap efek buruk sinar matahari pada kulit wajah dapat menangkal sinar uva maupun uvb secara efektif yang berpotensi dapat merusak kulit dapat melindungi kulit dari kerusakan karena paparan sinar matahari salah satunya yaitu sunburn dapat menenangkan kulit setelah beraktivitas di bawah sinar mataharini dan untuk menghidrasi dan menutrisi kulit wajah secara maksimal npure cica beat the sun powder ini bersifat noncomedogenic jadi aman untuk kamu yang punya kulit sensitif","157":"sesuka itu sama powder dari n’pure  favorite banget sih inimah  teksturnya juga lembut gtuh loh cocok banget buat kulit berminyak kaya aku  garibet dibawa kemana sesimple itu  pokoknya aku sih suka banget  emng deh produk n’pure gapernah gagal ","158":"aku nyobain ini karena fyp mulu kan di tiktok nah penasaran aku langsung beli kaget juga ada sunscreen bentuk powder pertama kali make seneng banget karena gaperlu hapus makeup sih kalau mau reapply sunscreen lagi hasilnya matte di muka aku bisa banget buat ngunci minyakkk dan makeup tetap on pointtt terus praktis buat dibawa kemana mana cara makenya sempet bingung tapi liat video video tutorial jadi bisa sih ini sunscreen membantu aku bangettt buat sehari hariii","159":"teksturnya agak cair warna putih standar produk sunscreen cepat menyerap baunya hampir gada agak whitecast di awalnya jadi diratain aja sering dibiarin sampe 14 jam dan muka agak berminyak tapi overall tidak mengecewakan sih"},"Pre #4":{"0":"akhirnya beli produk ini pas banget lagi sale juga di ecommerce niat beli produk ini emang buat reapply sunscreen through out the day buat temen temen yang mau pake pastiin jangan pake produk ini sendirian jadi tetep harus pake sunscreen dan bisa di set lagi pake ini jadi produk ini emang diperuntukan buat reapply sunscreen yang mudah banget sihhh","1":"sun powder dari npure ini bagus bangett gaboong deh teksturnya lembut bgt dan benerbener melindungi kulit dari paparan sinar matahari jadi kalo males pake sunscreen biasa bisa langsung pake ini yg super praktisss sukak pwoll pokonya","2":"waw sumpah si ini sunscreen yang bener bener bagus banget pertama kali nyoba emang langsung cocok di muka akuselain itu tekstur nya itu ringan dan cepat meresap di kulit dan juga sekali pake muka aku langsung glowing beuh pokonya cinta banget sama sunscreen yang ini","3":"npure cica beat the sun powder ini benerbener menjawab kebingunganku kalau harus reapply sunscreen dengan kondisi wajah bermakeup tekstur powdernya halus  nggak menyumbat pori ataupun menimbulkan jerawat tanpa whitecast ringan di kulit dan menyerap minyak","4":"suka sama teksturnya powder dan aplikatornya brush ada spf 30nya membantu perlindungan uvauvb recomendded dan wajib direapply setiap dua jam sekali jadi pengen beli lagi kalo ini dah habis hehe i love it sama npure produknya bagus²","5":"aku agak pemilih kalo urusan sunscreen soalnya biasanya sunscreen itu lengket dan bikin ga nyaman tapi ini beda toner ini ga terlalu lengket cepet ngeresap ga bikin berasa pakai dempul juga dan yg paling penting ga nyumbat pori dan spf tinggi tubenya juga lucu","6":"cocok banget untuk melindungi kulit dari paparan sinar matahari karena mengandung kandungan utama spf terus yang aku suka dia ga geser makeup di wajah jadi aman banget untuk ditimpa diatas makeup selain itu karena dia bentuk powder bisa bantu matte in makeup yang terlalu dewy  oily","7":"suka banget dengan inovasi sekeren ini gak perlu lagi buat bingung untuk really sunscreen sekaligus touchup make up spf nya 30 juga seneng banget kalau reapply sunscreen bikin tetep stay flawless dan masih bikin cantik mulifungsi banget suka banget dah","8":"bagi aku dia bener bener unique because bayangin aja sunscrren sama bedak bisa jadi satudan yang lebih bagusnya lagi dia gabikin kukit bruntusan dan pas di apply dia gabikin kulit kita kliatan kayak berminyak gitu ooo ya aku saranin nih kalian wajib touch up 2 jam sekali","9":"sumpah unik banget sunscreenya bentuk bedak gituu dan ada kuasnyaa apalagi spf 30 persenn mantul banget di apkenya gk ribet dan bisa di apply berulangkali hehehhe kalian semua wajib punya karena praktis banget kaya pake bedak rekomen dan harganya terjangkau prahhhh","10":"pertama kali nyobain dan ternyata cocok di aku ga bikin kusam padahal warnanya sedikit gelap dari kulitku hehe dan hasilnya matte aku suka bangetttt trus kemasannya juga praktis cuman harus berkali kali gitu biar kliatan pake bedaknya hehehe","11":"sunscreen ternyaman yg pernahh aku cobainn sii guyss dengan tekstur yang superrr ringann poll ga susah pokoknya di blend nyaa sudah bpom no alcohol dan no fragrancee the bestttttttt ‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍","12":"pertama kali nyobain sunscreen yang bentuknya powder aku sukaaa ini sih soalnya gampang di bawa kemana mana apa lagi buat reapply sunscreen pas udah makeup menurut ku ini bneran bagusss jadinya makeup ga geser udah gitu bisa ngontrol minyak jugaaa","13":"suka banget sama produk ini karena powdernya ringan banget di kulit cara pakainya juga mudah hasil akhirnya di kulitku matte dan lumayan tahan lama kuasnya juga bagus lembut dan ga mudah rontok jadi gampang banget re apply sunscreen","14":"baru kali ini nyobain sunscreen powder yang ringan membantu menyerap minyak berlebih meminimalkan tampilan poriporisekaligus mengurangi kilau minyakjadi gak perlu hapus makeup lagi jika mau apply sunscreen","15":"ini sunscreen paling cocok buat aku yang kulit sensitive ga lengket ge bikin berminyak dan ringan banget di wajah seriuss ini aku bakal repeat order ini terus kayanya karna secocok itu sama muka aku🤍 love banget sama cica beat te sun🤍🤍🤍","16":"bagus bangethdjdhdjjdjdjjsjdjdhhdhshshshshshshshshshsheheehhehehehdb jsjsjdjejej jejejejejjeje jejejejejejdjjd jejejejejejejejejjejeje jejejejejjeiee jejejejejeje jejejekekekkjejeejjeej nsjejejejejej jejejejejej","17":"powder suncreen pertama yang aku cobaa sekali coba langsung ketagihan wkwk soalnya cocok di kulit aku suka sama teksturnya lembut dan ringan finish looknya matte tapi tetep natural luv banget xx","18":"akhirnya nemuin sunscreen super simple garibet buat ngeapply selain itu tekstur powdernya halus banget seworth itu ini bakalan jadi sunscreean andalang aku thnk u n’pure udah ngeluarin produk cica beat the sun powder ini cocok banget di aku yang super mager","19":"demi apa sihh produk dr npure satu ini bener² baguss bgt buat ngatasin jerawat² aku yg sukaaa lama bgt sembuhnya cintaaa bgt sma produk ini recommended bgt buat kalian nihhhhh jerawat bisa bener² kering dalam waktu yg lebih cepat","20":"sukaaa suka sukaa bangett  hasilnya ga whitecast cepet nyerep dan ga buat wajah berminyaak lengket smaa sekalii  buat re apply jg okee bangett  harganyaa murah jgg  superr recomended buat yg cari sunscreen no white cast  ga buat berminyak","21":"buat kalian yang punya kulit jerawatan merah2 sini banget lah kalian wajib cobain sunscreen satu ini dia ga ada bau sma skali teksturnya cukup ringan  ga bikin risih lengket gitu finishnya kalian ga usah takut makeuo rusak pas mo reaplly sunscreen krena ini gampang bngt di blend  cepat menyerap di kulit 🥰","22":"sukaa bgtt sama sunscreen dari npure cica beat the sun ini tekstur nya juga gampang di blend gampang jugaa meresap dan ga lengket sama sekalisudah bpom aman buat bu sui serta bebas dari bahan bahan berbahayaaa udah spf 50 jugaa lohh","23":"honest review dari aku ini sunscreen termasuk sunscreen yang unik banget karena bentuknya itu powder jadi memudahkan aku untuk retouch make up lumayan tahan lama dan tahan minyak packagingnya juga simple dan mudah dibawa kemana mana","24":"packaging nya bagus lucu dan mudah dibawa kemanamana jadi ga ribet  tekturnya cream ringan ga bikin whitecast jdi ga ngedempul gampang ngresap hasil akhirnya glowing cocok untuk semua jenis kulit harganya juga affordable bagus banget produknyaa","25":"pliss ini sunscreen unik banget apalagi aplikatornya brush yang memudahkan untuk reapply dan touch up hasil akhirnya matte dan lumayan tahan minyak sesuai klaimnya aku reapply setiap 2 jam sekali walaupun langsung aku timpa dia ga bikin wajah kusam","26":"bagus bgtakhirnya bisa kebeli juga ini sunscreen ngerasa beruntusan ilang dan glowing aja pake inituh bukan yang minyakan cocok bgt buat kulit wajah aku yang normal to dry kaget pas beres ngeapply si cica beat sun ini trs lanjut tone up cream yang biasanya tone upnya susah diblend numpuk putih gitu skrg gampang bgt blendnya jadi rata putih glowing berkat si sunscreen ini suka bgttttt","27":"suka banget pake sunscreen dari npure cica beat the sun krna bagus banget terlihat kerutan bekurang dan tambah cerah wajah setelah rutin pakai produk ini  ga bikin lengket dan berminyak jg wajah setelah memakai rangkaian skincare lain","28":"sebelum pake yang powder aku pake yang ini dulu setelah aku pake ga berat dan ga ninggalin whitecast sih jadi ringan dan cepat menyerap gitu best combo kalo di paduin sama yang powder apalagi spf nya gede banget no worry deh tinggal apply yang powder","29":"asli sih ini sunscreen ter ga ribet impressed banget sama npure makasih puol udah ciptain sunscreen powder ini bawa kemanamana praktis juga bisa reapply tiap saat jadi ga perlu worried makeup kenapanapa ya kan hehe hasilnya matte finish juga","30":"ini adalah pertama kalinya gua coba pake product ini dan termyata sesuai ekspetasi emng sunscreenya bagus bgt kulit bener terlindungi dari sinar matahari dan skrg ga perlu kawatir lagi klu pergi pergi tinggal pakai dan ku bawa kemana mana","31":"bagus bget sih ini mana kandungan dan manfaatnya jga bagus bpom halal teruji secara dermatologis bebas sls bebas paraben bebas minyak mineral bebas alkohol bebas alergen ue bahan minimal bebas pewangi jadi kalian wajib coba yaaa","32":"produknya the best banget karna ini powder udah ada spf 30nya jadi mudah untuk reapply berkali kali teksturnya powdernya juga halus warnanya natural di muka dan hasilnya matte packagingnya jg aman bisa di bawa kmna mna aku recomended banget pokoknya","33":"sun cream nya bagus banget karna spf 50 melindungi kita dari teriknya sinar matahari apalagi di siang siang itu bener bener panas banget dan bisa membuat kulit kusam bisa merah juga kan setelah pake spf sun cream in benerbener menjaga kulit kita dari paparan matahari melindungi banget trs bisa meng glowing kan muka kita juga tekstur nya ringan banget di wajah dan nyaman si menurut ku🤗","34":"kaget banget ternyata sebagus itu kulitku tuh kombinasi tapi masih aman banget gabikin berminyak cuma glowimg biasa aja terus gabuat kusam cepet banget nyerepnya bakal beli lagi ini mah wkwk padhaal harganya gamahal tapi kualitasnya oke banget","35":"produk nya super bagus ini selain pigmen di wajah juga ada spf nya 30 super bagus bukan gak perlu repotrepot pakai sunscreen lagi bisa lgs ini 2in1 hihi aku suka banget pakai ini kalian wajib coba sih 🥰","36":"bagusss bangett produknya cocok untuk semua jenis kulit jugaa loh nggaa lengket dikulitt teksturnya dan harganyaa juga ramah kantong bgt pokoknyaaaa aku rekomend bangettttt buat kalian beli produk inii skrng jugaaaaa yaaaa","37":"baru kali ini cocok pakai sunscreen biasanya over oily tapi ini tuh cepet bgt nyerepnya no whitecast trus udah gitu finishnya bener2 bikin kulit makin glowing dong omg skrg jadi sunscreen addict bgt berkat npure cica beat the sun wajib repurchase sih iniii","38":"n’pure cica beat the sun sunscreen  texturenya super light di kulit nyaman dipake seharian ga lengket ga ninggalin whitecast bikin muka jadi glowing tapi ga bikin greasy   dengan spf 50 pa sebagai uv filter agent nya sunscreen ini bakal memprotect kita dari paparan sinar uv a  uv b kandungan 100 natural cica centella asiatica leaf water yang terdapat didalamnya juga bagus banget untuk menenangkan kulit kita setelah terpapar sinar matahari  chrysanthemum extract chamomilla extract and camellia sinensis leaf extract didalamnya kaya akan antioksidan  antiinflammatory jadi bagus banget untuk kemerahan  menghidrasi kulit kita bpom halal dermatologically tested bumil busui friendly free from  paraben sls mineral oil alcohol silicone eu allergen  fragrance recommended 🥰","39":"produk npure emang paling dabest sih sunscreennya ini matte finish gitu cocok banget buat aku yang males touch up dan reapply sunscreen pas lagi di luar rumah hihi kandungannya juga gausah diragukan lagi worth to buy","40":"sukaaa banget deh sama produk npure yang satu ini cica beat the sun powder  cocok banget buat aku yg mager banget kalo reapply sunscreen tapi semenjak ada produk ini aku gak mager lagi karena gampang banget di reapply nya dengan tekstur nya yg powder dan praktis banget buat di reapply  wajib banget sih punya produk npure yg satu ini  thankyou npure","41":"suka banget sama sunscreen dari npure karena ga bikin kulit jadi berminyak ga bikin whitecast selain itu juga non paraben non alkohol  non fragrance cocok banget buat kulit sensitif kayak aku udah ada spf 50 pa  lagi terbaikkk 🥺","42":"suka bangeeeet sama tekturnyaaa aman buat wajahku yg sering jerawatanbruntusan gabikin iritasi ga berat sama sekali efeknya glowing bund  aman ditimpa sama makeup juga pas nge touch up juga enak banget walau diatas makeup tapi bisa menyerap kekulit selalu di repurchase","43":"senang bangettt akhirnya bisa nemuin suncreen yang gampang di apply berkalikali tanpa harus hapus makeup duluuu yg aku suka juga warna tekturnya tuh natural jadi cocok juga buat jenis kulit yang sawo matang kaya akuuu thank uuu n’pure","44":"suka banget sama sunscreen ini awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan","45":"suka banget sama sunscreen ini awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan","46":"bener2 recommended banget deh cocok banget di mukaku spfnya juga tinggi dan ga buat muka aku kering sama ga ada efect putih nya di mukaku dan yang aku suka lagi harganya juga ga mahal deh dengan punya banyak manfaat untuk sunscream bener2 suka banget deh pokoknya","47":"ini produk yg wajib dipake harus punya pokoknya suka banget pakai sunscreen n pure ini bisa buat base makeup juga krna gak lengket di kulit trus cepet meresap harganya juga ramah dikantong recomended deh pokoknya next mau beli lagi","48":"sudah sebulanan ini aku pakai cica beat the sun npure teksturnya pas tidak terlalu kental dan tidak lengket nyaman di kulit meresap cepat dan ada kandungan spf 50 pa cukup tinggi serta di kulitku no whitecast namun tips jika kulitmu berminyak padukan dengan cica beat the sun powder yah","49":"buat yang punya kulit kering pasti bakal suka sama produk ini setelah dipake langsung auto glowing glass skin ala2 korea gitu tapi ga terasa lengket  greasy sama sekali dan pastinya bikin kulit terasa lembab seharian spf nya juga tinggi dan proteksi nya udh lengkap cocok juga untuk dijadikan base makeup jdi lebih nempel dan mulus","50":"teksturnya ringan banget dengan hasil matte finish penolong banget buat wajah aku yg oily ini ada spf 30 nya pula dan produknya juga praktis dibawa kemana dan bentuknya juga praktis banget gk ribet kalo mau reaply","51":"the finish looks good on my combi to dry skin kalo pake ss emang suka yg glowwy finish dan ini ga bikin gerah sama sekaliii gampang di blend jugaa dan minim oksidasii tapi kayaknya oil controlnya kurang tapi apply 3 kali sehari sekali udah enak banget bakal repurchase sih","52":"aaaaaa akhirnya ga worry lagi kalo lagi makeup harus reapply sunscreen sangat amat membantu aku yang kerjanya makeup tapi ttp terpapar matahari yang kerennya lagi selain doi memproteksi kulit dari efek uva uvb bisa sekalian touch up makeup jadi matte dan flawless must try","53":"aku suka sama sunscreen ini teksturnya gampang menyerap gak kental dan gak berat overall aku cocok biasanya kalo gak cocok aku akan timbul jerawat tapi ini gak aku ngerasa juga wajah aku tetap terasa lembab terus package nya juga aku suka di ujung buka tutup nya bentuknya kayak plastik bening gitu yang buat jd unik aja gak tau pertama kali liat langsung wah lucu hehe🤗","54":"ini highly recommended sih buat daily enak bgt simple dipakenya ga ribet mana teksturnya enak bgt ringan🤍 asli muka aku biasanya jam 12an gt udh oily dipakein ini langsung ngeset lagi kaya baru pake make up🥲🤍","55":"selama pake produk ini  aku ngerasa kulit ku terlindungi  karena jujur kulitku tipe yang suka sakit dan kemerahan disaat kena sinar matahari dan karena kebanyakan sunscreen bertexture creamy bkin aku susah meratakan creamnya diwajah dan bkin sakit akhirnya aku stop pake tapi setelah pake npure aku gak lagi khawatir karena lbh cepat meresap dan cpt bekerja di kulit wajah aku","56":"gilakkk sih produknya bagus bgt udah spf 50 pa selain itu dri packagingnya simple bgt buat di bawa kemana2 kesan pertama pakai langsung memberi efek glowing pada kulitku serta teksturnya ringan bgtt fix produknya npure emang bagus2 bgt apalagi yang cica beat the sun powder ini kalian harus cobaaaa","57":"terima kasih bgt buat npure yg sudah bikin produk ini karena reapply sunscreen jadi mudah suka bgt sama sunscreen ini  pas buat aku yg suka pake makeup finishnya matte nggak geser makeup  gampang bgt pakenya","58":"nyaman digunain bikin glowing diwajah gak kering dan adem di kulit wajib dipake buat klian yg sering aktifitas di luar ruangan haruuus bgt ini buat perlindungan yaaaaaaaaaaaaa","59":"pertama kali coba sunscreen versi powder hasilnya matte dan natural biasanya aku pakai di akhir setelah skincarean atau makeup selama 2 minggu kulitku ga menimbulkan reaksi negatif alias cocok super suka sama kemasannya yang unik ringan dan praktis bisa di bawa kemana aja","60":"yayyy akhirnya aku nemuin sunscreen yang cocok banget di kulit aku mudah di aaplikasikan mudah di blend dan tidak lengket sama sekali sunscreen ini alcohol free loh jadi aman banget untuk kulit sensitif seperti kulitku bakal beli lagi sih kalo udah habis","61":"aku udah pake produk ini sekitar 2 bulan lebih teksturnya aga sedikit cair gampang banget buat diblend dan yang paling aku suka itu adalah bikin muka jadi glowing bangetdan tentunya karena aman buat jerawat makanya aku cinta banget sama produk ini","62":"iiiii mampuy suka bgt sama sunscreen ini bener2 nyaman di pakenya dan bikin wajah keliatan glowing sehat cerah  teksturnya rada cair dan mudah di applikasiin setiap pake ini ak ngerasa dia lumayan ada efek tone up tp ga bikin muka abu2  suka nih kalo cocok sama produk2 lokal harganya jg masi masuk akal sesuai kualitas","63":"50 sunscreen terbaik menurut aku dia gak bikin kulit berminyak gitu setelah diapply trus gak bikin muka kita cepet minyakan enak juga cepat meresap packagingnya praktis dan bisa dibawa kemana aja rekomen banget pokoknyaaaharganya juga terjangkau  manfaatnya juga juara","64":"omg ini sunscreen terlembut yang pernah aku coba enak banget dikulit aku bikin kulit wajah aku lembab jujur suncreen npure cica beat the sun ini bagus banget dong melindungi dari sinar matahari apa lagi aku banyak banget kegiatan diluar sebelum aku beraktifitas aku pake dulu next abis mau beli lagi","65":"pengalaman pertamaku pake sunscreem powder dari n pure ini tuh bener bener sukaa banget  karna baru kali ini nemuin produk sunscreen yg powder dengan kemasan praktis untuk dibawa traveling uda dilengkapi juga dengan spf 30 dan bisa dipake sebagai step ke 2 setelah sunscreen creamnya mantul banget deh","66":"lucu bgt sunscreen powder  packagingnya retractable  aplikator brushnya lembut bgt warnanya beige tapi ga merubah warna kulit malah bikin kulit makin cerah  simple lagi kalo mau touch up tinggal tap puter2 kaya pake blussh on  harganya jg affordable","67":"wow sumpah pertama kalinya cobain sunscreen bentuk powder so far i luv this product so much pertama untuk packagingnya retractable dan brushnya soft bangettt untuk tekstur sedikit powder but its okay bcs finishnya matte natural and no whitecast sun powder ini juga tetep menghidrasi kulit walau finishnya matte luv it🥰","68":"baru pertama kali nyobain sun powder dan menurut aku feelsnya sama aja kayak kita pake loose powder gitu finishnya matte tapi di kulitku yg medium light dia ga kelihatan dempul dan jatuhnya natural banget nyatu ke warna kulit asli butirannya super halus dan kuasnya juga jd ga buat muka terasa kegores kemasannya super mini jadi enak buat dibawa kemanamana sayangnya karna dia sun powder jd kurang efektif klw dipake single aja harus pake sunscreen lotion dlu jadi jatuhnya produk ini tuh kayak ngeset riasan di bawahnya ama maksimalin proteksi lebh cocok dipake buat reapply apalagi pas makeup jd ga takut makeupnya tergeser so far aman aja sih di kulit aku dan worth to try tp krna harganya lumayan out of my budget aku prefer belinya pas promo aja wkwk","69":"seneng banget akhirnya nemu sunscreen powder yg slama ini aku cari2 ternyata npure punya produknya doomss sumpah ini bagus banget cocok banget dikulit aku yg super duper sensitif huhhh popoknya ini recomended deehhh","70":"baru kali ini punya sunscreen dalam bentuk powder apalagi aplikatornya brush dan suka banget apalagi pas pakai makeup reapply jadi lebih praktis matte finish dan bisa mengontrol minyak berlebih di wajah","71":"pertama kali cobain sunscreen dan langsung suka 🥺 pas di blend benerbener nyerap ke kulit dan bikin glowing dong  ringan juga di wajah  ini cocok banget buat yg dry skin ya soalnya habis pakai sunscreen npure ini wajahku jadi lembab  suka","72":"suka banget sama sun powdernya pacakgingnya kuat udah beberapa kali jatoh tapi masih kuat ga rusak untungnya trus juga hasilnya matte bagus gitu ga ngegeser makeup sama skali sih trus efisien banget juga jadinya seneng dibawa kemana2","73":"pertama kali beli karena sering banget lewat fyp tktk aku awal pemakaian ternyata ringan gak ada whitecast gak lengket juga nyaman banget dipake gak bikin wajah tambah minyakan karena jenis kulitku yang oily masih aman dan nyaman dipake","74":"baru kali ini cobain sun screen powder dari npure dan kayanya baru npure yang keluarin produk kaya gini emang bagus banget sih bkn muka ga lepek dn lengket lgi klo diluar rumah  packagingnnya jg lucu gampang dibawa kemana2 ga makan tempat","75":"ini powder yang terdebest banget sih menurutku selain ada spf nya powder ini waktu di apply ke wajah tekstur nya ringan sama sekali dan ngurangin minyak diwajah jugaaa apalagi aku emang dari pagi sd sore aktivitasnya diluar teruuussssss kemasannya yang minimalis bikin jadi gampang dibawa kemanamana🥰 bakalan jadi powder fav aku sih ini‍","76":"npure cica beat the sun powder ini cocok banget untuk kulit yang berminyak seperti aku seperti yang kita tau reapply sunscreen itu penting banget apalagi kalo sering kegiatan di outdoor produk ini praktis banget sih karna gampang banget dibawa kemanamana juga pas di reapply mudah banget karna tinggal diusap di wajah dan sekalipun muka kita masih ada makeup nyatidak buat makeup kita bergeser🥰untuk packaging nya sunscreen powder dari n’pure ini dikemas dalam tabung plastik mini berwarna hijau emerald bagian bawah tabungnya bening sehingga sunscreen powdernya kelihatan bagian atas tabung disambungkan dengan brush kuas warna cream kuas ini lembut banget sehingga mudah digunakan untuk seluruh bagian wajah kandungan dalam produk ini terdiri dari ada titanium dioxide ethylhexyl salicylate ethylhexyl methoxycinnamate natural centella asiatica leaf water rice bran oil dan vitamin e dan produk ini memiliki beragam manfaaf yaitu memberi perlindungan maksimal terhadap efek buruk sinar matahari pada kulit wajah dapat menangkal sinar uva maupun uvb secara efektif yang berpotensi dapat merusak kulit dapat melindungi kulit dari kerusakan karena paparan sinar matahari salah satunya yaitu sunburn dapat menenangkan kulit setelah beraktivitas di bawah sinar mataharini dan untuk menghidrasi dan menutrisi kulit wajah secara maksimal npure cica beat the sun powder ini bersifat noncomedogenic jadi aman untuk kamu yang punya kulit sensitif","77":"sesuka itu sama powder dari n’pure  favorite banget sih inimah  teksturnya juga lembut gtuh loh cocok banget buat kulit berminyak kaya aku  garibet dibawa kemana sesimple itu  pokoknya aku sih suka banget  emng deh produk n’pure gapernah gagal","78":"aku nyobain ini karena fyp mulu kan di tiktok nah penasaran aku langsung beli kaget juga ada sunscreen bentuk powder pertama kali make seneng banget karena gaperlu hapus makeup sih kalau mau reapply sunscreen lagi hasilnya matte di muka aku bisa banget buat ngunci minyakkk dan makeup tetap on pointtt terus praktis buat dibawa kemana mana cara makenya sempet bingung tapi liat video video tutorial jadi bisa sih ini sunscreen membantu aku bangettt buat sehari hariii","79":"teksturnya agak cair warna putih standar produk sunscreen cepat menyerap baunya hampir gada agak whitecast di awalnya jadi diratain aja sering dibiarin sampe 14 jam dan muka agak berminyak tapi overall tidak mengecewakan sih","80":"akhirnya beli produk ini pas banget lagi sale juga di ecommerce niat beli produk ini emang buat reapply sunscreen through out the day buat temen temen yang mau pake pastiin jangan pake produk ini sendirian jadi tetep harus pake sunscreen dan bisa di set lagi pake ini jadi produk ini emang diperuntukan buat reapply sunscreen yang mudah banget sihhh","81":"sun powder dari npure ini bagus bangett gaboong deh teksturnya lembut bgt dan benerbener melindungi kulit dari paparan sinar matahari jadi kalo males pake sunscreen biasa bisa langsung pake ini yg super praktisss sukak pwoll pokonya","82":"waw sumpah si ini sunscreen yang bener bener bagus banget pertama kali nyoba emang langsung cocok di muka akuselain itu tekstur nya itu ringan dan cepat meresap di kulit dan juga sekali pake muka aku langsung glowing beuh pokonya cinta banget sama sunscreen yang ini","83":"npure cica beat the sun powder ini benerbener menjawab kebingunganku kalau harus reapply sunscreen dengan kondisi wajah bermakeup tekstur powdernya halus  nggak menyumbat pori ataupun menimbulkan jerawat tanpa whitecast ringan di kulit dan menyerap minyak","84":"suka sama teksturnya powder dan aplikatornya brush ada spf 30nya membantu perlindungan uvauvb recomendded dan wajib direapply setiap dua jam sekali jadi pengen beli lagi kalo ini dah habis hehe i love it sama npure produknya bagus²","85":"aku agak pemilih kalo urusan sunscreen soalnya biasanya sunscreen itu lengket dan bikin ga nyaman tapi ini beda toner ini ga terlalu lengket cepet ngeresap ga bikin berasa pakai dempul juga dan yg paling penting ga nyumbat pori dan spf tinggi tubenya juga lucu","86":"cocok banget untuk melindungi kulit dari paparan sinar matahari karena mengandung kandungan utama spf terus yang aku suka dia ga geser makeup di wajah jadi aman banget untuk ditimpa diatas makeup selain itu karena dia bentuk powder bisa bantu matte in makeup yang terlalu dewy  oily","87":"suka banget dengan inovasi sekeren ini gak perlu lagi buat bingung untuk really sunscreen sekaligus touchup make up spf nya 30 juga seneng banget kalau reapply sunscreen bikin tetep stay flawless dan masih bikin cantik mulifungsi banget suka banget dah","88":"bagi aku dia bener bener unique because bayangin aja sunscrren sama bedak bisa jadi satudan yang lebih bagusnya lagi dia gabikin kukit bruntusan dan pas di apply dia gabikin kulit kita kliatan kayak berminyak gitu ooo ya aku saranin nih kalian wajib touch up 2 jam sekali","89":"sumpah unik banget sunscreenya bentuk bedak gituu dan ada kuasnyaa apalagi spf 30 persenn mantul banget di apkenya gk ribet dan bisa di apply berulangkali hehehhe kalian semua wajib punya karena praktis banget kaya pake bedak rekomen dan harganya terjangkau prahhhh","90":"pertama kali nyobain dan ternyata cocok di aku ga bikin kusam padahal warnanya sedikit gelap dari kulitku hehe dan hasilnya matte aku suka bangetttt trus kemasannya juga praktis cuman harus berkali kali gitu biar kliatan pake bedaknya hehehe","91":"sunscreen ternyaman yg pernahh aku cobainn sii guyss dengan tekstur yang superrr ringann poll ga susah pokoknya di blend nyaa sudah bpom no alcohol dan no fragrancee the bestttttttt ‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍","92":"pertama kali nyobain sunscreen yang bentuknya powder aku sukaaa ini sih soalnya gampang di bawa kemana mana apa lagi buat reapply sunscreen pas udah makeup menurut ku ini bneran bagusss jadinya makeup ga geser udah gitu bisa ngontrol minyak jugaaa","93":"suka banget sama produk ini karena powdernya ringan banget di kulit cara pakainya juga mudah hasil akhirnya di kulitku matte dan lumayan tahan lama kuasnya juga bagus lembut dan ga mudah rontok jadi gampang banget re apply sunscreen","94":"baru kali ini nyobain sunscreen powder yang ringan membantu menyerap minyak berlebih meminimalkan tampilan poriporisekaligus mengurangi kilau minyakjadi gak perlu hapus makeup lagi jika mau apply sunscreen","95":"ini sunscreen paling cocok buat aku yang kulit sensitive ga lengket ge bikin berminyak dan ringan banget di wajah seriuss ini aku bakal repeat order ini terus kayanya karna secocok itu sama muka aku🤍 love banget sama cica beat te sun🤍🤍🤍","96":"bagus bangethdjdhdjjdjdjjsjdjdhhdhshshshshshshshshshsheheehhehehehdb jsjsjdjejej jejejejejjeje jejejejejejdjjd jejejejejejejejejjejeje jejejejejjeiee jejejejejeje jejejekekekkjejeejjeej nsjejejejejej jejejejejej","97":"powder suncreen pertama yang aku cobaa sekali coba langsung ketagihan wkwk soalnya cocok di kulit aku suka sama teksturnya lembut dan ringan finish looknya matte tapi tetep natural luv banget xx","98":"akhirnya nemuin sunscreen super simple garibet buat ngeapply selain itu tekstur powdernya halus banget seworth itu ini bakalan jadi sunscreean andalang aku thnk u n’pure udah ngeluarin produk cica beat the sun powder ini cocok banget di aku yang super mager","99":"demi apa sihh produk dr npure satu ini bener² baguss bgt buat ngatasin jerawat² aku yg sukaaa lama bgt sembuhnya cintaaa bgt sma produk ini recommended bgt buat kalian nihhhhh jerawat bisa bener² kering dalam waktu yg lebih cepat","100":"sukaaa suka sukaa bangett  hasilnya ga whitecast cepet nyerep dan ga buat wajah berminyaak lengket smaa sekalii  buat re apply jg okee bangett  harganyaa murah jgg  superr recomended buat yg cari sunscreen no white cast  ga buat berminyak","101":"buat kalian yang punya kulit jerawatan merah2 sini banget lah kalian wajib cobain sunscreen satu ini dia ga ada bau sma skali teksturnya cukup ringan  ga bikin risih lengket gitu finishnya kalian ga usah takut makeuo rusak pas mo reaplly sunscreen krena ini gampang bngt di blend  cepat menyerap di kulit 🥰","102":"sukaa bgtt sama sunscreen dari npure cica beat the sun ini tekstur nya juga gampang di blend gampang jugaa meresap dan ga lengket sama sekalisudah bpom aman buat bu sui serta bebas dari bahan bahan berbahayaaa udah spf 50 jugaa lohh","103":"honest review dari aku ini sunscreen termasuk sunscreen yang unik banget karena bentuknya itu powder jadi memudahkan aku untuk retouch make up lumayan tahan lama dan tahan minyak packagingnya juga simple dan mudah dibawa kemana mana","104":"packaging nya bagus lucu dan mudah dibawa kemanamana jadi ga ribet  tekturnya cream ringan ga bikin whitecast jdi ga ngedempul gampang ngresap hasil akhirnya glowing cocok untuk semua jenis kulit harganya juga affordable bagus banget produknyaa","105":"pliss ini sunscreen unik banget apalagi aplikatornya brush yang memudahkan untuk reapply dan touch up hasil akhirnya matte dan lumayan tahan minyak sesuai klaimnya aku reapply setiap 2 jam sekali walaupun langsung aku timpa dia ga bikin wajah kusam","106":"bagus bgtakhirnya bisa kebeli juga ini sunscreen ngerasa beruntusan ilang dan glowing aja pake inituh bukan yang minyakan cocok bgt buat kulit wajah aku yang normal to dry kaget pas beres ngeapply si cica beat sun ini trs lanjut tone up cream yang biasanya tone upnya susah diblend numpuk putih gitu skrg gampang bgt blendnya jadi rata putih glowing berkat si sunscreen ini suka bgttttt","107":"suka banget pake sunscreen dari npure cica beat the sun krna bagus banget terlihat kerutan bekurang dan tambah cerah wajah setelah rutin pakai produk ini  ga bikin lengket dan berminyak jg wajah setelah memakai rangkaian skincare lain","108":"sebelum pake yang powder aku pake yang ini dulu setelah aku pake ga berat dan ga ninggalin whitecast sih jadi ringan dan cepat menyerap gitu best combo kalo di paduin sama yang powder apalagi spf nya gede banget no worry deh tinggal apply yang powder","109":"asli sih ini sunscreen ter ga ribet impressed banget sama npure makasih puol udah ciptain sunscreen powder ini bawa kemanamana praktis juga bisa reapply tiap saat jadi ga perlu worried makeup kenapanapa ya kan hehe hasilnya matte finish juga","110":"ini adalah pertama kalinya gua coba pake product ini dan termyata sesuai ekspetasi emng sunscreenya bagus bgt kulit bener terlindungi dari sinar matahari dan skrg ga perlu kawatir lagi klu pergi pergi tinggal pakai dan ku bawa kemana mana","111":"bagus bget sih ini mana kandungan dan manfaatnya jga bagus bpom halal teruji secara dermatologis bebas sls bebas paraben bebas minyak mineral bebas alkohol bebas alergen ue bahan minimal bebas pewangi jadi kalian wajib coba yaaa","112":"produknya the best banget karna ini powder udah ada spf 30nya jadi mudah untuk reapply berkali kali teksturnya powdernya juga halus warnanya natural di muka dan hasilnya matte packagingnya jg aman bisa di bawa kmna mna aku recomended banget pokoknya","113":"sun cream nya bagus banget karna spf 50 melindungi kita dari teriknya sinar matahari apalagi di siang siang itu bener bener panas banget dan bisa membuat kulit kusam bisa merah juga kan setelah pake spf sun cream in benerbener menjaga kulit kita dari paparan matahari melindungi banget trs bisa meng glowing kan muka kita juga tekstur nya ringan banget di wajah dan nyaman si menurut ku🤗","114":"kaget banget ternyata sebagus itu kulitku tuh kombinasi tapi masih aman banget gabikin berminyak cuma glowimg biasa aja terus gabuat kusam cepet banget nyerepnya bakal beli lagi ini mah wkwk padhaal harganya gamahal tapi kualitasnya oke banget","115":"produk nya super bagus ini selain pigmen di wajah juga ada spf nya 30 super bagus bukan gak perlu repotrepot pakai sunscreen lagi bisa lgs ini 2in1 hihi aku suka banget pakai ini kalian wajib coba sih 🥰","116":"bagusss bangett produknya cocok untuk semua jenis kulit jugaa loh nggaa lengket dikulitt teksturnya dan harganyaa juga ramah kantong bgt pokoknyaaaa aku rekomend bangettttt buat kalian beli produk inii skrng jugaaaaa yaaaa","117":"baru kali ini cocok pakai sunscreen biasanya over oily tapi ini tuh cepet bgt nyerepnya no whitecast trus udah gitu finishnya bener2 bikin kulit makin glowing dong omg skrg jadi sunscreen addict bgt berkat npure cica beat the sun wajib repurchase sih iniii","118":"n’pure cica beat the sun sunscreen  texturenya super light di kulit nyaman dipake seharian ga lengket ga ninggalin whitecast bikin muka jadi glowing tapi ga bikin greasy   dengan spf 50 pa sebagai uv filter agent nya sunscreen ini bakal memprotect kita dari paparan sinar uv a  uv b kandungan 100 natural cica centella asiatica leaf water yang terdapat didalamnya juga bagus banget untuk menenangkan kulit kita setelah terpapar sinar matahari  chrysanthemum extract chamomilla extract and camellia sinensis leaf extract didalamnya kaya akan antioksidan  antiinflammatory jadi bagus banget untuk kemerahan  menghidrasi kulit kita bpom halal dermatologically tested bumil busui friendly free from  paraben sls mineral oil alcohol silicone eu allergen  fragrance recommended 🥰","119":"produk npure emang paling dabest sih sunscreennya ini matte finish gitu cocok banget buat aku yang males touch up dan reapply sunscreen pas lagi di luar rumah hihi kandungannya juga gausah diragukan lagi worth to buy","120":"sukaaa banget deh sama produk npure yang satu ini cica beat the sun powder  cocok banget buat aku yg mager banget kalo reapply sunscreen tapi semenjak ada produk ini aku gak mager lagi karena gampang banget di reapply nya dengan tekstur nya yg powder dan praktis banget buat di reapply  wajib banget sih punya produk npure yg satu ini  thankyou npure","121":"suka banget sama sunscreen dari npure karena ga bikin kulit jadi berminyak ga bikin whitecast selain itu juga non paraben non alkohol  non fragrance cocok banget buat kulit sensitif kayak aku udah ada spf 50 pa  lagi terbaikkk 🥺","122":"suka bangeeeet sama tekturnyaaa aman buat wajahku yg sering jerawatanbruntusan gabikin iritasi ga berat sama sekali efeknya glowing bund  aman ditimpa sama makeup juga pas nge touch up juga enak banget walau diatas makeup tapi bisa menyerap kekulit selalu di repurchase","123":"senang bangettt akhirnya bisa nemuin suncreen yang gampang di apply berkalikali tanpa harus hapus makeup duluuu yg aku suka juga warna tekturnya tuh natural jadi cocok juga buat jenis kulit yang sawo matang kaya akuuu thank uuu n’pure","124":"suka banget sama sunscreen ini awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan","125":"suka banget sama sunscreen ini awalnya aku keracunan liat di ig pada pake ini pas aku cobain ternyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong ditambah teksturnya ringan terus aman banget buat muka aku yg jerawatan","126":"bener2 recommended banget deh cocok banget di mukaku spfnya juga tinggi dan ga buat muka aku kering sama ga ada efect putih nya di mukaku dan yang aku suka lagi harganya juga ga mahal deh dengan punya banyak manfaat untuk sunscream bener2 suka banget deh pokoknya","127":"ini produk yg wajib dipake harus punya pokoknya suka banget pakai sunscreen n pure ini bisa buat base makeup juga krna gak lengket di kulit trus cepet meresap harganya juga ramah dikantong recomended deh pokoknya next mau beli lagi","128":"sudah sebulanan ini aku pakai cica beat the sun npure teksturnya pas tidak terlalu kental dan tidak lengket nyaman di kulit meresap cepat dan ada kandungan spf 50 pa cukup tinggi serta di kulitku no whitecast namun tips jika kulitmu berminyak padukan dengan cica beat the sun powder yah","129":"buat yang punya kulit kering pasti bakal suka sama produk ini setelah dipake langsung auto glowing glass skin ala2 korea gitu tapi ga terasa lengket  greasy sama sekali dan pastinya bikin kulit terasa lembab seharian spf nya juga tinggi dan proteksi nya udh lengkap cocok juga untuk dijadikan base makeup jdi lebih nempel dan mulus","130":"teksturnya ringan banget dengan hasil matte finish penolong banget buat wajah aku yg oily ini ada spf 30 nya pula dan produknya juga praktis dibawa kemana dan bentuknya juga praktis banget gk ribet kalo mau reaply","131":"the finish looks good on my combi to dry skin kalo pake ss emang suka yg glowwy finish dan ini ga bikin gerah sama sekaliii gampang di blend jugaa dan minim oksidasii tapi kayaknya oil controlnya kurang tapi apply 3 kali sehari sekali udah enak banget bakal repurchase sih","132":"aaaaaa akhirnya ga worry lagi kalo lagi makeup harus reapply sunscreen sangat amat membantu aku yang kerjanya makeup tapi ttp terpapar matahari yang kerennya lagi selain doi memproteksi kulit dari efek uva uvb bisa sekalian touch up makeup jadi matte dan flawless must try","133":"aku suka sama sunscreen ini teksturnya gampang menyerap gak kental dan gak berat overall aku cocok biasanya kalo gak cocok aku akan timbul jerawat tapi ini gak aku ngerasa juga wajah aku tetap terasa lembab terus package nya juga aku suka di ujung buka tutup nya bentuknya kayak plastik bening gitu yang buat jd unik aja gak tau pertama kali liat langsung wah lucu hehe🤗","134":"ini highly recommended sih buat daily enak bgt simple dipakenya ga ribet mana teksturnya enak bgt ringan🤍 asli muka aku biasanya jam 12an gt udh oily dipakein ini langsung ngeset lagi kaya baru pake make up🥲🤍","135":"selama pake produk ini  aku ngerasa kulit ku terlindungi  karena jujur kulitku tipe yang suka sakit dan kemerahan disaat kena sinar matahari dan karena kebanyakan sunscreen bertexture creamy bkin aku susah meratakan creamnya diwajah dan bkin sakit akhirnya aku stop pake tapi setelah pake npure aku gak lagi khawatir karena lbh cepat meresap dan cpt bekerja di kulit wajah aku","136":"gilakkk sih produknya bagus bgt udah spf 50 pa selain itu dri packagingnya simple bgt buat di bawa kemana2 kesan pertama pakai langsung memberi efek glowing pada kulitku serta teksturnya ringan bgtt fix produknya npure emang bagus2 bgt apalagi yang cica beat the sun powder ini kalian harus cobaaaa","137":"nyaman digunain bikin glowing diwajah gak kering dan adem di kulit wajib dipake buat klian yg sering aktifitas di luar ruangan haruuus bgt ini buat perlindungan yaaaaaaaaaaaaa","138":"terima kasih bgt buat npure yg sudah bikin produk ini karena reapply sunscreen jadi mudah suka bgt sama sunscreen ini  pas buat aku yg suka pake makeup finishnya matte nggak geser makeup  gampang bgt pakenya","139":"pertama kali coba sunscreen versi powder hasilnya matte dan natural biasanya aku pakai di akhir setelah skincarean atau makeup selama 2 minggu kulitku ga menimbulkan reaksi negatif alias cocok super suka sama kemasannya yang unik ringan dan praktis bisa di bawa kemana aja","140":"yayyy akhirnya aku nemuin sunscreen yang cocok banget di kulit aku mudah di aaplikasikan mudah di blend dan tidak lengket sama sekali sunscreen ini alcohol free loh jadi aman banget untuk kulit sensitif seperti kulitku bakal beli lagi sih kalo udah habis","141":"aku udah pake produk ini sekitar 2 bulan lebih teksturnya aga sedikit cair gampang banget buat diblend dan yang paling aku suka itu adalah bikin muka jadi glowing bangetdan tentunya karena aman buat jerawat makanya aku cinta banget sama produk ini","142":"iiiii mampuy suka bgt sama sunscreen ini bener2 nyaman di pakenya dan bikin wajah keliatan glowing sehat cerah  teksturnya rada cair dan mudah di applikasiin setiap pake ini ak ngerasa dia lumayan ada efek tone up tp ga bikin muka abu2  suka nih kalo cocok sama produk2 lokal harganya jg masi masuk akal sesuai kualitas","143":"50 sunscreen terbaik menurut aku dia gak bikin kulit berminyak gitu setelah diapply trus gak bikin muka kita cepet minyakan enak juga cepat meresap packagingnya praktis dan bisa dibawa kemana aja rekomen banget pokoknyaaaharganya juga terjangkau  manfaatnya juga juara","144":"omg ini sunscreen terlembut yang pernah aku coba enak banget dikulit aku bikin kulit wajah aku lembab jujur suncreen npure cica beat the sun ini bagus banget dong melindungi dari sinar matahari apa lagi aku banyak banget kegiatan diluar sebelum aku beraktifitas aku pake dulu next abis mau beli lagi","145":"pengalaman pertamaku pake sunscreem powder dari n pure ini tuh bener bener sukaa banget  karna baru kali ini nemuin produk sunscreen yg powder dengan kemasan praktis untuk dibawa traveling uda dilengkapi juga dengan spf 30 dan bisa dipake sebagai step ke 2 setelah sunscreen creamnya mantul banget deh","146":"lucu bgt sunscreen powder  packagingnya retractable  aplikator brushnya lembut bgt warnanya beige tapi ga merubah warna kulit malah bikin kulit makin cerah  simple lagi kalo mau touch up tinggal tap puter2 kaya pake blussh on  harganya jg affordable","147":"wow sumpah pertama kalinya cobain sunscreen bentuk powder so far i luv this product so much pertama untuk packagingnya retractable dan brushnya soft bangettt untuk tekstur sedikit powder but its okay bcs finishnya matte natural and no whitecast sun powder ini juga tetep menghidrasi kulit walau finishnya matte luv it🥰","148":"baru pertama kali nyobain sun powder dan menurut aku feelsnya sama aja kayak kita pake loose powder gitu finishnya matte tapi di kulitku yg medium light dia ga kelihatan dempul dan jatuhnya natural banget nyatu ke warna kulit asli butirannya super halus dan kuasnya juga jd ga buat muka terasa kegores kemasannya super mini jadi enak buat dibawa kemanamana sayangnya karna dia sun powder jd kurang efektif klw dipake single aja harus pake sunscreen lotion dlu jadi jatuhnya produk ini tuh kayak ngeset riasan di bawahnya ama maksimalin proteksi lebh cocok dipake buat reapply apalagi pas makeup jd ga takut makeupnya tergeser so far aman aja sih di kulit aku dan worth to try tp krna harganya lumayan out of my budget aku prefer belinya pas promo aja wkwk","149":"seneng banget akhirnya nemu sunscreen powder yg slama ini aku cari2 ternyata npure punya produknya doomss sumpah ini bagus banget cocok banget dikulit aku yg super duper sensitif huhhh popoknya ini recomended deehhh","150":"baru kali ini punya sunscreen dalam bentuk powder apalagi aplikatornya brush dan suka banget apalagi pas pakai makeup reapply jadi lebih praktis matte finish dan bisa mengontrol minyak berlebih di wajah","151":"suka banget sama sun powdernya pacakgingnya kuat udah beberapa kali jatoh tapi masih kuat ga rusak untungnya trus juga hasilnya matte bagus gitu ga ngegeser makeup sama skali sih trus efisien banget juga jadinya seneng dibawa kemana2","152":"pertama kali cobain sunscreen dan langsung suka 🥺 pas di blend benerbener nyerap ke kulit dan bikin glowing dong  ringan juga di wajah  ini cocok banget buat yg dry skin ya soalnya habis pakai sunscreen npure ini wajahku jadi lembab  suka","153":"pertama kali beli karena sering banget lewat fyp tktk aku awal pemakaian ternyata ringan gak ada whitecast gak lengket juga nyaman banget dipake gak bikin wajah tambah minyakan karena jenis kulitku yang oily masih aman dan nyaman dipake","154":"baru kali ini cobain sun screen powder dari npure dan kayanya baru npure yang keluarin produk kaya gini emang bagus banget sih bkn muka ga lepek dn lengket lgi klo diluar rumah  packagingnnya jg lucu gampang dibawa kemana2 ga makan tempat","155":"ini powder yang terdebest banget sih menurutku selain ada spf nya powder ini waktu di apply ke wajah tekstur nya ringan sama sekali dan ngurangin minyak diwajah jugaaa apalagi aku emang dari pagi sd sore aktivitasnya diluar teruuussssss kemasannya yang minimalis bikin jadi gampang dibawa kemanamana🥰 bakalan jadi powder fav aku sih ini‍","156":"npure cica beat the sun powder ini cocok banget untuk kulit yang berminyak seperti aku seperti yang kita tau reapply sunscreen itu penting banget apalagi kalo sering kegiatan di outdoor produk ini praktis banget sih karna gampang banget dibawa kemanamana juga pas di reapply mudah banget karna tinggal diusap di wajah dan sekalipun muka kita masih ada makeup nyatidak buat makeup kita bergeser🥰untuk packaging nya sunscreen powder dari n’pure ini dikemas dalam tabung plastik mini berwarna hijau emerald bagian bawah tabungnya bening sehingga sunscreen powdernya kelihatan bagian atas tabung disambungkan dengan brush kuas warna cream kuas ini lembut banget sehingga mudah digunakan untuk seluruh bagian wajah kandungan dalam produk ini terdiri dari ada titanium dioxide ethylhexyl salicylate ethylhexyl methoxycinnamate natural centella asiatica leaf water rice bran oil dan vitamin e dan produk ini memiliki beragam manfaaf yaitu memberi perlindungan maksimal terhadap efek buruk sinar matahari pada kulit wajah dapat menangkal sinar uva maupun uvb secara efektif yang berpotensi dapat merusak kulit dapat melindungi kulit dari kerusakan karena paparan sinar matahari salah satunya yaitu sunburn dapat menenangkan kulit setelah beraktivitas di bawah sinar mataharini dan untuk menghidrasi dan menutrisi kulit wajah secara maksimal npure cica beat the sun powder ini bersifat noncomedogenic jadi aman untuk kamu yang punya kulit sensitif","157":"sesuka itu sama powder dari n’pure  favorite banget sih inimah  teksturnya juga lembut gtuh loh cocok banget buat kulit berminyak kaya aku  garibet dibawa kemana sesimple itu  pokoknya aku sih suka banget  emng deh produk n’pure gapernah gagal","158":"aku nyobain ini karena fyp mulu kan di tiktok nah penasaran aku langsung beli kaget juga ada sunscreen bentuk powder pertama kali make seneng banget karena gaperlu hapus makeup sih kalau mau reapply sunscreen lagi hasilnya matte di muka aku bisa banget buat ngunci minyakkk dan makeup tetap on pointtt terus praktis buat dibawa kemana mana cara makenya sempet bingung tapi liat video video tutorial jadi bisa sih ini sunscreen membantu aku bangettt buat sehari hariii","159":"teksturnya agak cair warna putih standar produk sunscreen cepat menyerap baunya hampir gada agak whitecast di awalnya jadi diratain aja sering dibiarin sampe 14 jam dan muka agak berminyak tapi overall tidak mengecewakan sih"},"Pre #5":{"0":"akhir beli produk ini pas banget lagi sale juga di ecommerce niat beli produk ini emang buat reapply sunscreen through out the day buat temen temen yang mau pake pastiin jangan pake produk ini sendiri jadi tetep harus pake sunscreen dan bisa di set lagi pake ini jadi produk ini emang untuk buat reapply sunscreen yang mudah banget sihhh","1":"sun powder dari npure ini bagus bangett gaboong deh tekstur lembut bgt dan benerbener lindung kulit dari papar sinar matahari jadi kalo males pake sunscreen biasa bisa langsung pake ini yg super praktisss sukak pwoll poko","2":"waw sumpah si ini sunscreen yang bener bener bagus banget pertama kali nyoba emang langsung cocok di muka akuselain itu tekstur nya itu ringan dan cepat resap di kulit dan juga sekali pake muka aku langsung glowing beuh poko cinta banget sama sunscreen yang ini","3":"npure cica beat the sun powder ini benerbener jawab bingung kalau harus reapply sunscreen dengan kondisi wajah bermakeup tekstur powdernya halus nggak sumbat pori atau timbul jerawat tanpa whitecast ringan di kulit dan serap minyak","4":"suka sama tekstur powder dan aplikatornya brush ada spf 30nya bantu lindung uvauvb recomendded dan wajib direapply tiap dua jam sekali jadi ken beli lagi kalo ini dah habis hehe i love it sama npure produk bagus","5":"aku agak pilih kalo urus sunscreen soal biasa sunscreen itu lengket dan bikin ga nyaman tapi ini beda toner ini ga terlalu lengket cepet ngeresap ga bikin asa pakai dempul juga dan yg paling penting ga nyumbat pori dan spf tinggi tube juga lucu","6":"cocok banget untuk lindung kulit dari papar sinar matahari karena kandung kandung utama spf terus yang aku suka dia ga geser makeup di wajah jadi aman banget untuk timpa atas makeup selain itu karena dia bentuk powder bisa bantu matte in makeup yang terlalu dewy oily","7":"suka banget dengan inovasi keren ini gak perlu lagi buat bingung untuk really sunscreen sekaligus touchup make up spf nya 30 juga neng banget kalau reapply sunscreen bikin tetep stay flawless dan masih bikin cantik mulifungsi banget suka banget dah","8":"bagi aku dia bener bener unique because bayangin aja sunscrren sama bedak bisa jadi satudan yang lebih bagus lagi dia gabikin kit bruntusan dan pas di apply dia gabikin kulit kita kliatan kayak minyak gitu ooo ya aku saranin nih kalian wajib touch up 2 jam sekali","9":"sumpah unik banget sunscreenya bentuk bedak gituu dan ada kuasnyaa apalagi spf 30 persenn mantul banget di apkenya gk ribet dan bisa di apply berulangkali hehehhe kalian semua wajib punya karena praktis banget kaya pake bedak rekomen dan harga jangkau prahhhh","10":"pertama kali nyobain dan nyata cocok di aku ga bikin kusam padahal warna sedikit gelap dari kulit hehe dan hasil matte aku suka bangetttt trus kemas juga praktis cuman harus kali kali gitu biar kliatan pake bedak hehehe","11":"sunscreen nyaman yg pernahh aku cobainn sii guyss dengan tekstur yang superrr ringann poll ga susah pokok di blend nyaa sudah bpom no alcohol dan no fragrancee the bestttttttt","12":"pertama kali nyobain sunscreen yang bentuk powder aku sukaaa ini sih soal gampang di bawa mana mana apa lagi buat reapply sunscreen pas udah makeup turut ku ini bneran bagusss jadi makeup ga geser udah gitu bisa ngontrol minyak jugaaa","13":"suka banget sama produk ini karena powdernya ringan banget di kulit cara pakai juga mudah hasil akhir di kulit matte dan lumayan tahan lama kuas juga bagus lembut dan ga mudah rontok jadi gampang banget re apply sunscreen","14":"baru kali ini nyobain sunscreen powder yang ringan bantu serap minyak lebih minimal tampil poriporisekaligus kurang kilau minyakjadi gak perlu hapus makeup lagi jika mau apply sunscreen","15":"ini sunscreen paling cocok buat aku yang kulit sensitive ga lengket ge bikin minyak dan ringan banget di wajah seriuss ini aku bakal repeat order ini terus kaya karna cocok itu sama muka aku love banget sama cica beat te sun","16":"bagus bangethdjdhdjjdjdjjsjdjdhhdhshshshshshshshshshsheheehhehehehdb jsjsjdjejej jejejejejjeje jejejejejejdjjd jejejejejejejejejjejeje jejejejejjeiee jejejejejeje jejejekekekkjejeejjeej nsjejejejejej jejejejejej","17":"powder suncreen pertama yang aku cobaa sekali coba langsung tagih wkwk soal cocok di kulit aku suka sama tekstur lembut dan ringan finish looknya matte tapi tetep natural luv banget xx","18":"akhir nemuin sunscreen super simple garibet buat ngeapply selain itu tekstur powdernya halus banget seworth itu ini bakal jadi sunscreean andalang aku thnk u n pure udah ngeluarin produk cica beat the sun powder ini cocok banget di aku yang super mager","19":"demi apa sihh produk dr npure satu ini bener baguss bgt buat ngatasin jerawat aku yg sukaaa lama bgt sembuh cintaaa bgt sma produk ini recommended bgt buat kalian nihhhhh jerawat bisa bener kering dalam waktu yg lebih cepat","20":"sukaaa suka sukaa bangett hasil ga whitecast cepet nyerep dan ga buat wajah berminyaak lengket smaa sekali buat re apply jg okee bangett harganyaa murah jgg superr recomended buat yg cari sunscreen no white cast ga buat minyak","21":"buat kalian yang punya kulit jerawat merah2 sini banget lah kalian wajib cobain sunscreen satu ini dia ga ada bau sma skali tekstur cukup ringan ga bikin risih lengket gitu finishnya kalian ga usah takut makeuo rusak pas mo reaplly sunscreen krena ini gampang bngt di blend cepat serap di kulit","22":"sukaa bgtt sama sunscreen dari npure cica beat the sun ini tekstur nya juga gampang di blend gampang jugaa resap dan ga lengket sama sekalisudah bpom aman buat bu sui serta bebas dari bahan bahan berbahayaaa udah spf 50 jugaa lohh","23":"honest review dari aku ini sunscreen masuk sunscreen yang unik banget karena bentuk itu powder jadi mudah aku untuk retouch make up lumayan tahan lama dan tahan minyak packagingnya juga simple dan mudah bawa mana mana","24":"packaging nya bagus lucu dan mudah bawa kemanamana jadi ga ribet tekturnya cream ringan ga bikin whitecast jdi ga ngedempul gampang ngresap hasil akhir glowing cocok untuk semua jenis kulit harga juga affordable bagus banget produknyaa","25":"pliss ini sunscreen unik banget apalagi aplikatornya brush yang mudah untuk reapply dan touch up hasil akhir matte dan lumayan tahan minyak sesuai klaim aku reapply tiap 2 jam sekali walaupun langsung aku timpa dia ga bikin wajah kusam","26":"bagus bgtakhirnya bisa kebel juga ini sunscreen ngerasa beruntus ilang dan glowing aja pake inituh bukan yang minyak cocok bgt buat kulit wajah aku yang normal to dry kaget pas beres ngeapply si cica beat sun ini trs lanjut tone up cream yang biasa tone upnya susah diblend numpuk putih gitu skrg gampang bgt blendnya jadi rata putih glowing berkat si sunscreen ini suka bgttttt","27":"suka banget pake sunscreen dari npure cica beat the sun krna bagus banget lihat kerut bekurang dan tambah cerah wajah telah rutin pakai produk ini ga bikin lengket dan minyak jg wajah telah pakai rangkai skincare lain","28":"belum pake yang powder aku pake yang ini dulu telah aku pake ga berat dan ga ninggalin whitecast sih jadi ringan dan cepat serap gitu best combo kalo di paduin sama yang powder apalagi spf nya gede banget no worry deh tinggal apply yang powder","29":"asli sih ini sunscreen ter ga ribet impressed banget sama npure makasih puol udah ciptain sunscreen powder ini bawa kemanamana praktis juga bisa reapply tiap saat jadi ga perlu worried makeup kenapanapa ya kan hehe hasil matte finish juga","30":"ini adalah pertama kali gua coba pake product ini dan termyata sesuai ekspetasi emng sunscreenya bagus bgt kulit bener lindung dari sinar matahari dan skrg ga perlu kawatir lagi klu pergi pergi tinggal pakai dan ku bawa mana mana","31":"bagus bget sih ini mana kandung dan manfaat jga bagus bpom halal uji cara dermatolog bebas sls bebas paraben bebas minyak mineral bebas alkohol bebas alergen ue bahan minimal bebas wangi jadi kalian wajib coba yaaa","32":"produk the best banget karna ini powder udah ada spf 30nya jadi mudah untuk reapply kali kali tekstur powdernya juga halus warna natural di muka dan hasil matte packagingnya jg aman bisa di bawa kmna mna aku recomended banget pokok","33":"sun cream nya bagus banget karna spf 50 lindung kita dari terik sinar matahari apalagi di siang siang itu bener bener panas banget dan bisa buat kulit kusam bisa merah juga kan telah pake spf sun cream in benerbener jaga kulit kita dari papar matahari lindung banget trs bisa meng glowing kan muka kita juga tekstur nya ringan banget di wajah dan nyaman si turut ku","34":"kaget banget nyata bagus itu kulit tuh kombinasi tapi masih aman banget gabikin minyak cuma glowimg biasa aja terus gabuat kusam cepet banget nyerepnya bakal beli lagi ini mah wkwk padhaal harga gamahal tapi kualitas oke banget","35":"produk nya super bagus ini selain pigmen di wajah juga ada spf nya 30 super bagus bukan gak perlu repotrepot pakai sunscreen lagi bisa lgs ini 2in1 hihi aku suka banget pakai ini kalian wajib coba sih","36":"bagusss bangett produk cocok untuk semua jenis kulit jugaa loh nggaa lengket dikulitt tekstur dan harganyaa juga ramah kantong bgt pokoknyaaaa aku rekomend bangettttt buat kalian beli produk ini skrng jugaaaaa yaaaa","37":"baru kali ini cocok pakai sunscreen biasa over oily tapi ini tuh cepet bgt nyerepnya no whitecast trus udah gitu finishnya bener2 bikin kulit makin glowing dong omg skrg jadi sunscreen addict bgt berkat npure cica beat the sun wajib repurchase sih iniii","38":"n pure cica beat the sun sunscreen texturenya super light di kulit nyaman dipake hari ga lengket ga ninggalin whitecast bikin muka jadi glowing tapi ga bikin greasy dengan spf 50 pa bagai uv filter agent nya sunscreen ini bakal memprotect kita dari papar sinar uv a uv b kandung 100 natural cica centella asiatica leaf water yang dapat dalam juga bagus banget untuk tenang kulit kita telah papar sinar matahari chrysanthemum extract chamomilla extract and camellia sinensis leaf extract dalam kaya akan antioksidan antiinflammatory jadi bagus banget untuk merah hidrasi kulit kita bpom halal dermatologically tested bumil busui friendly free from paraben sls mineral oil alcohol silicone eu allergen fragrance recommended","39":"produk npure emang paling dabest sih sunscreennya ini matte finish gitu cocok banget buat aku yang males touch up dan reapply sunscreen pas lagi di luar rumah hihi kandung juga gausah ragu lagi worth to buy","40":"sukaaa banget deh sama produk npure yang satu ini cica beat the sun powder cocok banget buat aku yg mager banget kalo reapply sunscreen tapi semenjak ada produk ini aku gak mager lagi karena gampang banget di reapply nya dengan tekstur nya yg powder dan praktis banget buat di reapply wajib banget sih punya produk npure yg satu ini thankyou npure","41":"suka banget sama sunscreen dari npure karena ga bikin kulit jadi minyak ga bikin whitecast selain itu juga non paraben non alkohol non fragrance cocok banget buat kulit sensitif kayak aku udah ada spf 50 pa lagi terbaikkk","42":"suka bangeeeet sama tekturnyaaa aman buat wajah yg sering jerawatanbruntusan gabikin iritasi ga berat sama sekali efek glowing bund aman timpa sama makeup juga pas nge touch up juga enak banget walau atas makeup tapi bisa serap kulit selalu di repurchase","43":"senang bangettt akhir bisa nemuin suncreen yang gampang di apply berkalikali tanpa harus hapus makeup duluuu yg aku suka juga warna tekturnya tuh natural jadi cocok juga buat jenis kulit yang sawo matang kaya akuuu thank uuu n pure","44":"suka banget sama sunscreen ini awal aku racun liat di ig pada pake ini pas aku cobain nyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong tambah tekstur ringan terus aman banget buat muka aku yg jerawat","45":"suka banget sama sunscreen ini awal aku racun liat di ig pada pake ini pas aku cobain nyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong tambah tekstur ringan terus aman banget buat muka aku yg jerawat","46":"bener2 recommended banget deh cocok banget di muka spfnya juga tinggi dan ga buat muka aku kering sama ga ada efect putih nya di muka dan yang aku suka lagi harga juga ga mahal deh dengan punya banyak manfaat untuk sunscream bener2 suka banget deh pokok","47":"ini produk yg wajib dipake harus punya pokok suka banget pakai sunscreen n pure ini bisa buat base makeup juga krna gak lengket di kulit trus cepet resap harga juga ramah kantong recomended deh pokok next mau beli lagi","48":"sudah bulan ini aku pakai cica beat the sun npure tekstur pas tidak terlalu kental dan tidak lengket nyaman di kulit resap cepat dan ada kandung spf 50 pa cukup tinggi serta di kulit no whitecast namun tips jika kulit minyak padu dengan cica beat the sun powder yah","49":"buat yang punya kulit kering pasti bakal suka sama produk ini telah dipake langsung auto glowing glass skin ala2 korea gitu tapi ga asa lengket greasy sama sekali dan pasti bikin kulit asa lembab hari spf nya juga tinggi dan proteksi nya udh lengkap cocok juga untuk jadi base makeup jdi lebih nempel dan mulus","50":"tekstur ringan banget dengan hasil matte finish tolong banget buat wajah aku yg oily ini ada spf 30 nya pula dan produk juga praktis bawa mana dan bentuk juga praktis banget gk ribet kalo mau reaply","51":"the finish looks good on my combi to dry skin kalo pake ss emang suka yg glowwy finish dan ini ga bikin gerah sama sekaliii gampang di blend jugaa dan minim oksidasi tapi kayak oil controlnya kurang tapi apply 3 kali hari sekali udah enak banget bakal repurchase sih","52":"aaaaaa akhir ga worry lagi kalo lagi makeup harus reapply sunscreen sangat amat bantu aku yang kerja makeup tapi ttp papar matahari yang keren lagi selain doi proteksi kulit dari efek uva uvb bisa sekali touch up makeup jadi matte dan flawless must try","53":"aku suka sama sunscreen ini tekstur gampang serap gak kental dan gak berat overall aku cocok biasa kalo gak cocok aku akan timbul jerawat tapi ini gak aku ngerasa juga wajah aku tetap asa lembab terus package nya juga aku suka di ujung buka tutup nya bentuk kayak plastik bening gitu yang buat jd unik aja gak tau pertama kali liat langsung wah lucu hehe","54":"ini highly recommended sih buat daily enak bgt simple dipakenya ga ribet mana tekstur enak bgt ringan asli muka aku biasa jam 12an gt udh oily dipakein ini langsung ngeset lagi kaya baru pake make up","55":"lama pake produk ini aku ngerasa kulit ku lindung karena jujur kulit tipe yang suka sakit dan merah saat kena sinar matahari dan karena banyak sunscreen bertexture creamy bkin aku susah rata creamnya wajah dan bkin sakit akhir aku stop pake tapi telah pake npure aku gak lagi khawatir karena lbh cepat resap dan cpt kerja di kulit wajah aku","56":"gilakkk sih produk bagus bgt udah spf 50 pa selain itu dri packagingnya simple bgt buat di bawa kemana2 kesan pertama pakai langsung beri efek glowing pada kulit serta tekstur ringan bgtt fix produk npure emang bagus2 bgt apalagi yang cica beat the sun powder ini kalian harus cobaaaa","57":"terima kasih bgt buat npure yg sudah bikin produk ini karena reapply sunscreen jadi mudah suka bgt sama sunscreen ini pas buat aku yg suka pake makeup finishnya matte nggak geser makeup gampang bgt pakenya","58":"nyaman digunain bikin glowing wajah gak kering dan adem di kulit wajib dipake buat klian yg sering aktifitas di luar ruang haruuus bgt ini buat lindung yaaaaaaaaaaaaa","59":"pertama kali coba sunscreen versi powder hasil matte dan natural biasa aku pakai di akhir telah skincarean atau makeup lama 2 minggu kulit ga timbul reaksi negatif alias cocok super suka sama kemas yang unik ringan dan praktis bisa di bawa mana aja","60":"yayyy akhir aku nemuin sunscreen yang cocok banget di kulit aku mudah di aaplikasikan mudah di blend dan tidak lengket sama sekali sunscreen ini alcohol free loh jadi aman banget untuk kulit sensitif seperti kulit bakal beli lagi sih kalo udah habis","61":"aku udah pake produk ini sekitar 2 bulan lebih tekstur aga sedikit cair gampang banget buat diblend dan yang paling aku suka itu adalah bikin muka jadi glowing bangetdan tentu karena aman buat jerawat makanya aku cinta banget sama produk ini","62":"iiiii mampuy suka bgt sama sunscreen ini bener2 nyaman di pakenya dan bikin wajah liat glowing sehat cerah tekstur rada cair dan mudah di applikasiin tiap pake ini ak ngerasa dia lumayan ada efek tone up tp ga bikin muka abu2 suka nih kalo cocok sama produk2 lokal harga jg mas masuk akal sesuai kualitas","63":"50 sunscreen baik turut aku dia gak bikin kulit minyak gitu telah diapply trus gak bikin muka kita cepet minyak enak juga cepat resap packagingnya praktis dan bisa bawa mana aja rekomen banget pokoknyaaaharganya juga jangkau manfaat juga juara","64":"omg ini sunscreen lembut yang pernah aku coba enak banget kulit aku bikin kulit wajah aku lembab jujur suncreen npure cica beat the sun ini bagus banget dong lindung dari sinar matahari apa lagi aku banyak banget giat luar belum aku beraktifitas aku pake dulu next abis mau beli lagi","65":"alam pertama pake sunscreem powder dari n pure ini tuh bener bener sukaa banget karna baru kali ini nemuin produk sunscreen yg powder dengan kemas praktis untuk bawa traveling uda lengkap juga dengan spf 30 dan bisa dipake bagai step ke 2 telah sunscreen creamnya mantul banget deh","66":"lucu bgt sunscreen powder packagingnya retractable aplikator brushnya lembut bgt warna beige tapi ga rubah warna kulit malah bikin kulit makin cerah simple lagi kalo mau touch up tinggal tap puter2 kaya pake blussh on harga jg affordable","67":"wow sumpah pertama kali cobain sunscreen bentuk powder so far i luv this product so much pertama untuk packagingnya retractable dan brushnya soft bangettt untuk tekstur sedikit powder but its okay bcs finishnya matte natural and no whitecast sun powder ini juga tetep hidrasi kulit walau finishnya matte luv it","68":"baru pertama kali nyobain sun powder dan turut aku feelsnya sama aja kayak kita pake loose powder gitu finishnya matte tapi di kulit yg medium light dia ga lihat dempul dan jatuh natural banget nyatu ke warna kulit asli butir super halus dan kuas juga jd ga buat muka asa gores kemas super mini jadi enak buat bawa kemanamana sayang karna dia sun powder jd kurang efektif klw dipake single aja harus pake sunscreen lotion dlu jadi jatuh produk ini tuh kayak ngeset rias di bawah ama maksimalin proteksi lebh cocok dipake buat reapply apalagi pas makeup jd ga takut makeupnya geser so far aman aja sih di kulit aku dan worth to try tp krna harga lumayan out of my budget aku prefer beli pas promo aja wkwk","69":"neng banget akhir nemu sunscreen powder yg slama ini aku cari2 nyata npure punya produk doomss sumpah ini bagus banget cocok banget kulit aku yg super duper sensitif huhhh popok ini recomended deehhh","70":"baru kali ini punya sunscreen dalam bentuk powder apalagi aplikatornya brush dan suka banget apalagi pas pakai makeup reapply jadi lebih praktis matte finish dan bisa kontrol minyak lebih di wajah","71":"pertama kali cobain sunscreen dan langsung suka pas di blend benerbener nyerap ke kulit dan bikin glowing dong ringan juga di wajah ini cocok banget buat yg dry skin ya soal habis pakai sunscreen npure ini wajah jadi lembab suka","72":"suka banget sama sun powdernya pacakgingnya kuat udah beberapa kali jatoh tapi masih kuat ga rusak untung trus juga hasil matte bagus gitu ga ngegeser makeup sama skali sih trus efisien banget juga jadi neng bawa kemana2","73":"pertama kali beli karena sering banget lewat fyp tktk aku awal pakai nyata ringan gak ada whitecast gak lengket juga nyaman banget dipake gak bikin wajah tambah minyak karena jenis kulit yang oily masih aman dan nyaman dipake","74":"baru kali ini cobain sun screen powder dari npure dan kaya baru npure yang keluarin produk kaya gin emang bagus banget sih bkn muka ga lepek dn lengket lgi klo luar rumah packagingnnya jg lucu gampang bawa kemana2 ga makan tempat","75":"ini powder yang terdebest banget sih turut selain ada spf nya powder ini waktu di apply ke wajah tekstur nya ringan sama sekali dan ngurangin minyak wajah jugaaa apalagi aku emang dari pagi sd sore aktivitas luar teruuussssss kemas yang minimal bikin jadi gampang bawa kemanamana bakal jadi powder fav aku sih ini","76":"npure cica beat the sun powder ini cocok banget untuk kulit yang minyak seperti aku seperti yang kita tau reapply sunscreen itu penting banget apalagi kalo sering giat di outdoor produk ini praktis banget sih karna gampang banget bawa kemanamana juga pas di reapply mudah banget karna tinggal usap di wajah dan sekalipun muka kita masih ada makeup nyatidak buat makeup kita geser untuk packaging nya sunscreen powder dari n pure ini kemas dalam tabung plastik mini warna hijau emerald bagi bawah tabung bening sehingga sunscreen powdernya lihat bagi atas tabung sambung dengan brush kuas warna cream kuas ini lembut banget sehingga mudah guna untuk seluruh bagi wajah kandung dalam produk ini diri dari ada titanium dioxide ethylhexyl salicylate ethylhexyl methoxycinnamate natural centella asiatica leaf water rice bran oil dan vitamin e dan produk ini milik agam manfaaf yaitu beri lindung maksimal hadap efek buruk sinar matahari pada kulit wajah dapat tangkal sinar uva maupun uvb cara efektif yang potensi dapat rusak kulit dapat lindung kulit dari rusa karena papar sinar matahari salah satu yaitu sunburn dapat tenang kulit telah aktivitas di bawah sinar mataharini dan untuk hidrasi dan nutrisi kulit wajah cara maksimal npure cica beat the sun powder ini sifat noncomedogenic jadi aman untuk kamu yang punya kulit sensitif","77":"suka itu sama powder dari n pure favorite banget sih inimah tekstur juga lembut gtuh loh cocok banget buat kulit minyak kaya aku garibet bawa mana sesimple itu pokok aku sih suka banget emng deh produk n pure gapernah gagal","78":"aku nyobain ini karena fyp mulu kan di tiktok nah penasaran aku langsung beli kaget juga ada sunscreen bentuk powder pertama kali make neng banget karena gaperlu hapus makeup sih kalau mau reapply sunscreen lagi hasil matte di muka aku bisa banget buat ngunci minyakkk dan makeup tetap on pointtt terus praktis buat bawa mana mana cara makenya sempet bingung tapi liat video video tutorial jadi bisa sih ini sunscreen bantu aku bangettt buat hari hariii","79":"tekstur agak cair warna putih standar produk sunscreen cepat serap bau hampir gada agak whitecast di awal jadi diratain aja sering dibiarin sampe 14 jam dan muka agak minyak tapi overall tidak kecewa sih","80":"akhir beli produk ini pas banget lagi sale juga di ecommerce niat beli produk ini emang buat reapply sunscreen through out the day buat temen temen yang mau pake pastiin jangan pake produk ini sendiri jadi tetep harus pake sunscreen dan bisa di set lagi pake ini jadi produk ini emang untuk buat reapply sunscreen yang mudah banget sihhh","81":"sun powder dari npure ini bagus bangett gaboong deh tekstur lembut bgt dan benerbener lindung kulit dari papar sinar matahari jadi kalo males pake sunscreen biasa bisa langsung pake ini yg super praktisss sukak pwoll poko","82":"waw sumpah si ini sunscreen yang bener bener bagus banget pertama kali nyoba emang langsung cocok di muka akuselain itu tekstur nya itu ringan dan cepat resap di kulit dan juga sekali pake muka aku langsung glowing beuh poko cinta banget sama sunscreen yang ini","83":"npure cica beat the sun powder ini benerbener jawab bingung kalau harus reapply sunscreen dengan kondisi wajah bermakeup tekstur powdernya halus nggak sumbat pori atau timbul jerawat tanpa whitecast ringan di kulit dan serap minyak","84":"suka sama tekstur powder dan aplikatornya brush ada spf 30nya bantu lindung uvauvb recomendded dan wajib direapply tiap dua jam sekali jadi ken beli lagi kalo ini dah habis hehe i love it sama npure produk bagus","85":"aku agak pilih kalo urus sunscreen soal biasa sunscreen itu lengket dan bikin ga nyaman tapi ini beda toner ini ga terlalu lengket cepet ngeresap ga bikin asa pakai dempul juga dan yg paling penting ga nyumbat pori dan spf tinggi tube juga lucu","86":"cocok banget untuk lindung kulit dari papar sinar matahari karena kandung kandung utama spf terus yang aku suka dia ga geser makeup di wajah jadi aman banget untuk timpa atas makeup selain itu karena dia bentuk powder bisa bantu matte in makeup yang terlalu dewy oily","87":"suka banget dengan inovasi keren ini gak perlu lagi buat bingung untuk really sunscreen sekaligus touchup make up spf nya 30 juga neng banget kalau reapply sunscreen bikin tetep stay flawless dan masih bikin cantik mulifungsi banget suka banget dah","88":"bagi aku dia bener bener unique because bayangin aja sunscrren sama bedak bisa jadi satudan yang lebih bagus lagi dia gabikin kit bruntusan dan pas di apply dia gabikin kulit kita kliatan kayak minyak gitu ooo ya aku saranin nih kalian wajib touch up 2 jam sekali","89":"sumpah unik banget sunscreenya bentuk bedak gituu dan ada kuasnyaa apalagi spf 30 persenn mantul banget di apkenya gk ribet dan bisa di apply berulangkali hehehhe kalian semua wajib punya karena praktis banget kaya pake bedak rekomen dan harga jangkau prahhhh","90":"pertama kali nyobain dan nyata cocok di aku ga bikin kusam padahal warna sedikit gelap dari kulit hehe dan hasil matte aku suka bangetttt trus kemas juga praktis cuman harus kali kali gitu biar kliatan pake bedak hehehe","91":"sunscreen nyaman yg pernahh aku cobainn sii guyss dengan tekstur yang superrr ringann poll ga susah pokok di blend nyaa sudah bpom no alcohol dan no fragrancee the bestttttttt","92":"pertama kali nyobain sunscreen yang bentuk powder aku sukaaa ini sih soal gampang di bawa mana mana apa lagi buat reapply sunscreen pas udah makeup turut ku ini bneran bagusss jadi makeup ga geser udah gitu bisa ngontrol minyak jugaaa","93":"suka banget sama produk ini karena powdernya ringan banget di kulit cara pakai juga mudah hasil akhir di kulit matte dan lumayan tahan lama kuas juga bagus lembut dan ga mudah rontok jadi gampang banget re apply sunscreen","94":"baru kali ini nyobain sunscreen powder yang ringan bantu serap minyak lebih minimal tampil poriporisekaligus kurang kilau minyakjadi gak perlu hapus makeup lagi jika mau apply sunscreen","95":"ini sunscreen paling cocok buat aku yang kulit sensitive ga lengket ge bikin minyak dan ringan banget di wajah seriuss ini aku bakal repeat order ini terus kaya karna cocok itu sama muka aku love banget sama cica beat te sun","96":"bagus bangethdjdhdjjdjdjjsjdjdhhdhshshshshshshshshshsheheehhehehehdb jsjsjdjejej jejejejejjeje jejejejejejdjjd jejejejejejejejejjejeje jejejejejjeiee jejejejejeje jejejekekekkjejeejjeej nsjejejejejej jejejejejej","97":"powder suncreen pertama yang aku cobaa sekali coba langsung tagih wkwk soal cocok di kulit aku suka sama tekstur lembut dan ringan finish looknya matte tapi tetep natural luv banget xx","98":"akhir nemuin sunscreen super simple garibet buat ngeapply selain itu tekstur powdernya halus banget seworth itu ini bakal jadi sunscreean andalang aku thnk u n pure udah ngeluarin produk cica beat the sun powder ini cocok banget di aku yang super mager","99":"demi apa sihh produk dr npure satu ini bener baguss bgt buat ngatasin jerawat aku yg sukaaa lama bgt sembuh cintaaa bgt sma produk ini recommended bgt buat kalian nihhhhh jerawat bisa bener kering dalam waktu yg lebih cepat","100":"sukaaa suka sukaa bangett hasil ga whitecast cepet nyerep dan ga buat wajah berminyaak lengket smaa sekali buat re apply jg okee bangett harganyaa murah jgg superr recomended buat yg cari sunscreen no white cast ga buat minyak","101":"buat kalian yang punya kulit jerawat merah2 sini banget lah kalian wajib cobain sunscreen satu ini dia ga ada bau sma skali tekstur cukup ringan ga bikin risih lengket gitu finishnya kalian ga usah takut makeuo rusak pas mo reaplly sunscreen krena ini gampang bngt di blend cepat serap di kulit","102":"sukaa bgtt sama sunscreen dari npure cica beat the sun ini tekstur nya juga gampang di blend gampang jugaa resap dan ga lengket sama sekalisudah bpom aman buat bu sui serta bebas dari bahan bahan berbahayaaa udah spf 50 jugaa lohh","103":"honest review dari aku ini sunscreen masuk sunscreen yang unik banget karena bentuk itu powder jadi mudah aku untuk retouch make up lumayan tahan lama dan tahan minyak packagingnya juga simple dan mudah bawa mana mana","104":"packaging nya bagus lucu dan mudah bawa kemanamana jadi ga ribet tekturnya cream ringan ga bikin whitecast jdi ga ngedempul gampang ngresap hasil akhir glowing cocok untuk semua jenis kulit harga juga affordable bagus banget produknyaa","105":"pliss ini sunscreen unik banget apalagi aplikatornya brush yang mudah untuk reapply dan touch up hasil akhir matte dan lumayan tahan minyak sesuai klaim aku reapply tiap 2 jam sekali walaupun langsung aku timpa dia ga bikin wajah kusam","106":"bagus bgtakhirnya bisa kebel juga ini sunscreen ngerasa beruntus ilang dan glowing aja pake inituh bukan yang minyak cocok bgt buat kulit wajah aku yang normal to dry kaget pas beres ngeapply si cica beat sun ini trs lanjut tone up cream yang biasa tone upnya susah diblend numpuk putih gitu skrg gampang bgt blendnya jadi rata putih glowing berkat si sunscreen ini suka bgttttt","107":"suka banget pake sunscreen dari npure cica beat the sun krna bagus banget lihat kerut bekurang dan tambah cerah wajah telah rutin pakai produk ini ga bikin lengket dan minyak jg wajah telah pakai rangkai skincare lain","108":"belum pake yang powder aku pake yang ini dulu telah aku pake ga berat dan ga ninggalin whitecast sih jadi ringan dan cepat serap gitu best combo kalo di paduin sama yang powder apalagi spf nya gede banget no worry deh tinggal apply yang powder","109":"asli sih ini sunscreen ter ga ribet impressed banget sama npure makasih puol udah ciptain sunscreen powder ini bawa kemanamana praktis juga bisa reapply tiap saat jadi ga perlu worried makeup kenapanapa ya kan hehe hasil matte finish juga","110":"ini adalah pertama kali gua coba pake product ini dan termyata sesuai ekspetasi emng sunscreenya bagus bgt kulit bener lindung dari sinar matahari dan skrg ga perlu kawatir lagi klu pergi pergi tinggal pakai dan ku bawa mana mana","111":"bagus bget sih ini mana kandung dan manfaat jga bagus bpom halal uji cara dermatolog bebas sls bebas paraben bebas minyak mineral bebas alkohol bebas alergen ue bahan minimal bebas wangi jadi kalian wajib coba yaaa","112":"produk the best banget karna ini powder udah ada spf 30nya jadi mudah untuk reapply kali kali tekstur powdernya juga halus warna natural di muka dan hasil matte packagingnya jg aman bisa di bawa kmna mna aku recomended banget pokok","113":"sun cream nya bagus banget karna spf 50 lindung kita dari terik sinar matahari apalagi di siang siang itu bener bener panas banget dan bisa buat kulit kusam bisa merah juga kan telah pake spf sun cream in benerbener jaga kulit kita dari papar matahari lindung banget trs bisa meng glowing kan muka kita juga tekstur nya ringan banget di wajah dan nyaman si turut ku","114":"kaget banget nyata bagus itu kulit tuh kombinasi tapi masih aman banget gabikin minyak cuma glowimg biasa aja terus gabuat kusam cepet banget nyerepnya bakal beli lagi ini mah wkwk padhaal harga gamahal tapi kualitas oke banget","115":"produk nya super bagus ini selain pigmen di wajah juga ada spf nya 30 super bagus bukan gak perlu repotrepot pakai sunscreen lagi bisa lgs ini 2in1 hihi aku suka banget pakai ini kalian wajib coba sih","116":"bagusss bangett produk cocok untuk semua jenis kulit jugaa loh nggaa lengket dikulitt tekstur dan harganyaa juga ramah kantong bgt pokoknyaaaa aku rekomend bangettttt buat kalian beli produk ini skrng jugaaaaa yaaaa","117":"baru kali ini cocok pakai sunscreen biasa over oily tapi ini tuh cepet bgt nyerepnya no whitecast trus udah gitu finishnya bener2 bikin kulit makin glowing dong omg skrg jadi sunscreen addict bgt berkat npure cica beat the sun wajib repurchase sih iniii","118":"n pure cica beat the sun sunscreen texturenya super light di kulit nyaman dipake hari ga lengket ga ninggalin whitecast bikin muka jadi glowing tapi ga bikin greasy dengan spf 50 pa bagai uv filter agent nya sunscreen ini bakal memprotect kita dari papar sinar uv a uv b kandung 100 natural cica centella asiatica leaf water yang dapat dalam juga bagus banget untuk tenang kulit kita telah papar sinar matahari chrysanthemum extract chamomilla extract and camellia sinensis leaf extract dalam kaya akan antioksidan antiinflammatory jadi bagus banget untuk merah hidrasi kulit kita bpom halal dermatologically tested bumil busui friendly free from paraben sls mineral oil alcohol silicone eu allergen fragrance recommended","119":"produk npure emang paling dabest sih sunscreennya ini matte finish gitu cocok banget buat aku yang males touch up dan reapply sunscreen pas lagi di luar rumah hihi kandung juga gausah ragu lagi worth to buy","120":"sukaaa banget deh sama produk npure yang satu ini cica beat the sun powder cocok banget buat aku yg mager banget kalo reapply sunscreen tapi semenjak ada produk ini aku gak mager lagi karena gampang banget di reapply nya dengan tekstur nya yg powder dan praktis banget buat di reapply wajib banget sih punya produk npure yg satu ini thankyou npure","121":"suka banget sama sunscreen dari npure karena ga bikin kulit jadi minyak ga bikin whitecast selain itu juga non paraben non alkohol non fragrance cocok banget buat kulit sensitif kayak aku udah ada spf 50 pa lagi terbaikkk","122":"suka bangeeeet sama tekturnyaaa aman buat wajah yg sering jerawatanbruntusan gabikin iritasi ga berat sama sekali efek glowing bund aman timpa sama makeup juga pas nge touch up juga enak banget walau atas makeup tapi bisa serap kulit selalu di repurchase","123":"senang bangettt akhir bisa nemuin suncreen yang gampang di apply berkalikali tanpa harus hapus makeup duluuu yg aku suka juga warna tekturnya tuh natural jadi cocok juga buat jenis kulit yang sawo matang kaya akuuu thank uuu n pure","124":"suka banget sama sunscreen ini awal aku racun liat di ig pada pake ini pas aku cobain nyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong tambah tekstur ringan terus aman banget buat muka aku yg jerawat","125":"suka banget sama sunscreen ini awal aku racun liat di ig pada pake ini pas aku cobain nyata emamg bagus banget buat ngelindungin muka aku dari matahari siang bolong tambah tekstur ringan terus aman banget buat muka aku yg jerawat","126":"bener2 recommended banget deh cocok banget di muka spfnya juga tinggi dan ga buat muka aku kering sama ga ada efect putih nya di muka dan yang aku suka lagi harga juga ga mahal deh dengan punya banyak manfaat untuk sunscream bener2 suka banget deh pokok","127":"ini produk yg wajib dipake harus punya pokok suka banget pakai sunscreen n pure ini bisa buat base makeup juga krna gak lengket di kulit trus cepet resap harga juga ramah kantong recomended deh pokok next mau beli lagi","128":"sudah bulan ini aku pakai cica beat the sun npure tekstur pas tidak terlalu kental dan tidak lengket nyaman di kulit resap cepat dan ada kandung spf 50 pa cukup tinggi serta di kulit no whitecast namun tips jika kulit minyak padu dengan cica beat the sun powder yah","129":"buat yang punya kulit kering pasti bakal suka sama produk ini telah dipake langsung auto glowing glass skin ala2 korea gitu tapi ga asa lengket greasy sama sekali dan pasti bikin kulit asa lembab hari spf nya juga tinggi dan proteksi nya udh lengkap cocok juga untuk jadi base makeup jdi lebih nempel dan mulus","130":"tekstur ringan banget dengan hasil matte finish tolong banget buat wajah aku yg oily ini ada spf 30 nya pula dan produk juga praktis bawa mana dan bentuk juga praktis banget gk ribet kalo mau reaply","131":"the finish looks good on my combi to dry skin kalo pake ss emang suka yg glowwy finish dan ini ga bikin gerah sama sekaliii gampang di blend jugaa dan minim oksidasi tapi kayak oil controlnya kurang tapi apply 3 kali hari sekali udah enak banget bakal repurchase sih","132":"aaaaaa akhir ga worry lagi kalo lagi makeup harus reapply sunscreen sangat amat bantu aku yang kerja makeup tapi ttp papar matahari yang keren lagi selain doi proteksi kulit dari efek uva uvb bisa sekali touch up makeup jadi matte dan flawless must try","133":"aku suka sama sunscreen ini tekstur gampang serap gak kental dan gak berat overall aku cocok biasa kalo gak cocok aku akan timbul jerawat tapi ini gak aku ngerasa juga wajah aku tetap asa lembab terus package nya juga aku suka di ujung buka tutup nya bentuk kayak plastik bening gitu yang buat jd unik aja gak tau pertama kali liat langsung wah lucu hehe","134":"ini highly recommended sih buat daily enak bgt simple dipakenya ga ribet mana tekstur enak bgt ringan asli muka aku biasa jam 12an gt udh oily dipakein ini langsung ngeset lagi kaya baru pake make up","135":"lama pake produk ini aku ngerasa kulit ku lindung karena jujur kulit tipe yang suka sakit dan merah saat kena sinar matahari dan karena banyak sunscreen bertexture creamy bkin aku susah rata creamnya wajah dan bkin sakit akhir aku stop pake tapi telah pake npure aku gak lagi khawatir karena lbh cepat resap dan cpt kerja di kulit wajah aku","136":"gilakkk sih produk bagus bgt udah spf 50 pa selain itu dri packagingnya simple bgt buat di bawa kemana2 kesan pertama pakai langsung beri efek glowing pada kulit serta tekstur ringan bgtt fix produk npure emang bagus2 bgt apalagi yang cica beat the sun powder ini kalian harus cobaaaa","137":"nyaman digunain bikin glowing wajah gak kering dan adem di kulit wajib dipake buat klian yg sering aktifitas di luar ruang haruuus bgt ini buat lindung yaaaaaaaaaaaaa","138":"terima kasih bgt buat npure yg sudah bikin produk ini karena reapply sunscreen jadi mudah suka bgt sama sunscreen ini pas buat aku yg suka pake makeup finishnya matte nggak geser makeup gampang bgt pakenya","139":"pertama kali coba sunscreen versi powder hasil matte dan natural biasa aku pakai di akhir telah skincarean atau makeup lama 2 minggu kulit ga timbul reaksi negatif alias cocok super suka sama kemas yang unik ringan dan praktis bisa di bawa mana aja","140":"yayyy akhir aku nemuin sunscreen yang cocok banget di kulit aku mudah di aaplikasikan mudah di blend dan tidak lengket sama sekali sunscreen ini alcohol free loh jadi aman banget untuk kulit sensitif seperti kulit bakal beli lagi sih kalo udah habis","141":"aku udah pake produk ini sekitar 2 bulan lebih tekstur aga sedikit cair gampang banget buat diblend dan yang paling aku suka itu adalah bikin muka jadi glowing bangetdan tentu karena aman buat jerawat makanya aku cinta banget sama produk ini","142":"iiiii mampuy suka bgt sama sunscreen ini bener2 nyaman di pakenya dan bikin wajah liat glowing sehat cerah tekstur rada cair dan mudah di applikasiin tiap pake ini ak ngerasa dia lumayan ada efek tone up tp ga bikin muka abu2 suka nih kalo cocok sama produk2 lokal harga jg mas masuk akal sesuai kualitas","143":"50 sunscreen baik turut aku dia gak bikin kulit minyak gitu telah diapply trus gak bikin muka kita cepet minyak enak juga cepat resap packagingnya praktis dan bisa bawa mana aja rekomen banget pokoknyaaaharganya juga jangkau manfaat juga juara","144":"omg ini sunscreen lembut yang pernah aku coba enak banget kulit aku bikin kulit wajah aku lembab jujur suncreen npure cica beat the sun ini bagus banget dong lindung dari sinar matahari apa lagi aku banyak banget giat luar belum aku beraktifitas aku pake dulu next abis mau beli lagi","145":"alam pertama pake sunscreem powder dari n pure ini tuh bener bener sukaa banget karna baru kali ini nemuin produk sunscreen yg powder dengan kemas praktis untuk bawa traveling uda lengkap juga dengan spf 30 dan bisa dipake bagai step ke 2 telah sunscreen creamnya mantul banget deh","146":"lucu bgt sunscreen powder packagingnya retractable aplikator brushnya lembut bgt warna beige tapi ga rubah warna kulit malah bikin kulit makin cerah simple lagi kalo mau touch up tinggal tap puter2 kaya pake blussh on harga jg affordable","147":"wow sumpah pertama kali cobain sunscreen bentuk powder so far i luv this product so much pertama untuk packagingnya retractable dan brushnya soft bangettt untuk tekstur sedikit powder but its okay bcs finishnya matte natural and no whitecast sun powder ini juga tetep hidrasi kulit walau finishnya matte luv it","148":"baru pertama kali nyobain sun powder dan turut aku feelsnya sama aja kayak kita pake loose powder gitu finishnya matte tapi di kulit yg medium light dia ga lihat dempul dan jatuh natural banget nyatu ke warna kulit asli butir super halus dan kuas juga jd ga buat muka asa gores kemas super mini jadi enak buat bawa kemanamana sayang karna dia sun powder jd kurang efektif klw dipake single aja harus pake sunscreen lotion dlu jadi jatuh produk ini tuh kayak ngeset rias di bawah ama maksimalin proteksi lebh cocok dipake buat reapply apalagi pas makeup jd ga takut makeupnya geser so far aman aja sih di kulit aku dan worth to try tp krna harga lumayan out of my budget aku prefer beli pas promo aja wkwk","149":"neng banget akhir nemu sunscreen powder yg slama ini aku cari2 nyata npure punya produk doomss sumpah ini bagus banget cocok banget kulit aku yg super duper sensitif huhhh popok ini recomended deehhh","150":"baru kali ini punya sunscreen dalam bentuk powder apalagi aplikatornya brush dan suka banget apalagi pas pakai makeup reapply jadi lebih praktis matte finish dan bisa kontrol minyak lebih di wajah","151":"suka banget sama sun powdernya pacakgingnya kuat udah beberapa kali jatoh tapi masih kuat ga rusak untung trus juga hasil matte bagus gitu ga ngegeser makeup sama skali sih trus efisien banget juga jadi neng bawa kemana2","152":"pertama kali cobain sunscreen dan langsung suka pas di blend benerbener nyerap ke kulit dan bikin glowing dong ringan juga di wajah ini cocok banget buat yg dry skin ya soal habis pakai sunscreen npure ini wajah jadi lembab suka","153":"pertama kali beli karena sering banget lewat fyp tktk aku awal pakai nyata ringan gak ada whitecast gak lengket juga nyaman banget dipake gak bikin wajah tambah minyak karena jenis kulit yang oily masih aman dan nyaman dipake","154":"baru kali ini cobain sun screen powder dari npure dan kaya baru npure yang keluarin produk kaya gin emang bagus banget sih bkn muka ga lepek dn lengket lgi klo luar rumah packagingnnya jg lucu gampang bawa kemana2 ga makan tempat","155":"ini powder yang terdebest banget sih turut selain ada spf nya powder ini waktu di apply ke wajah tekstur nya ringan sama sekali dan ngurangin minyak wajah jugaaa apalagi aku emang dari pagi sd sore aktivitas luar teruuussssss kemas yang minimal bikin jadi gampang bawa kemanamana bakal jadi powder fav aku sih ini","156":"npure cica beat the sun powder ini cocok banget untuk kulit yang minyak seperti aku seperti yang kita tau reapply sunscreen itu penting banget apalagi kalo sering giat di outdoor produk ini praktis banget sih karna gampang banget bawa kemanamana juga pas di reapply mudah banget karna tinggal usap di wajah dan sekalipun muka kita masih ada makeup nyatidak buat makeup kita geser untuk packaging nya sunscreen powder dari n pure ini kemas dalam tabung plastik mini warna hijau emerald bagi bawah tabung bening sehingga sunscreen powdernya lihat bagi atas tabung sambung dengan brush kuas warna cream kuas ini lembut banget sehingga mudah guna untuk seluruh bagi wajah kandung dalam produk ini diri dari ada titanium dioxide ethylhexyl salicylate ethylhexyl methoxycinnamate natural centella asiatica leaf water rice bran oil dan vitamin e dan produk ini milik agam manfaaf yaitu beri lindung maksimal hadap efek buruk sinar matahari pada kulit wajah dapat tangkal sinar uva maupun uvb cara efektif yang potensi dapat rusak kulit dapat lindung kulit dari rusa karena papar sinar matahari salah satu yaitu sunburn dapat tenang kulit telah aktivitas di bawah sinar mataharini dan untuk hidrasi dan nutrisi kulit wajah cara maksimal npure cica beat the sun powder ini sifat noncomedogenic jadi aman untuk kamu yang punya kulit sensitif","157":"suka itu sama powder dari n pure favorite banget sih inimah tekstur juga lembut gtuh loh cocok banget buat kulit minyak kaya aku garibet bawa mana sesimple itu pokok aku sih suka banget emng deh produk n pure gapernah gagal","158":"aku nyobain ini karena fyp mulu kan di tiktok nah penasaran aku langsung beli kaget juga ada sunscreen bentuk powder pertama kali make neng banget karena gaperlu hapus makeup sih kalau mau reapply sunscreen lagi hasil matte di muka aku bisa banget buat ngunci minyakkk dan makeup tetap on pointtt terus praktis buat bawa mana mana cara makenya sempet bingung tapi liat video video tutorial jadi bisa sih ini sunscreen bantu aku bangettt buat hari hariii","159":"tekstur agak cair warna putih standar produk sunscreen cepat serap bau hampir gada agak whitecast di awal jadi diratain aja sering dibiarin sampe 14 jam dan muka agak minyak tapi overall tidak kecewa sih"}}